{"course code":"CCEOE18","course title":"ADVANCED CONCRETE TECHNOLOGY","course type":"OPEN ELECTIVE","number of credits":"3","prerequisites":"Knowledge of Concrete and its ingredients.nIntroduction - Concrete materials - Cement: Physical tests on cement - Concrete materials - Tests on aggregates - Quality of Water for mixing and curing - use of sea water for mixing concrete. Rheology of concrete- Introduction, Rheological behaviour, Factors affecting rheological properties, mixture adjustments.nMix Design - factors influencing mix proportion - Mix design by ACI method and I.S. code method - Design of normal concrete, high strength concrete and self compacting concrete. Admixtures - accelerating admixtures - Retarding admixtures - water reducing admixtures - Air entraining admixtures - coloring agent - Plasticizers. Batching - Mixing -Transportation - Placing of concrete - curing of Concrete.nStrength of Concrete - Shrinkage and temperature effects - creep of concrete - permeability of concrete - durability of concrete - Corrosion - Causes and effects - remedial measures- Thermal properties of concrete - Micro cracking of concrete, microstructure of concrete. Classification of causes of concrete deterioration – Permeability of concrete – Chloride penetration – Acid attack - Sulfate attack – Alkali-aggregate reaction – Concrete in sea watern– AC impedance test - Corrosion of embedded steel in concrete – Case histories..nSpecial Concrete - High Performance Concrete (HPC) Introduction – Principles of HPC – Ingredients used for HPC – Production of HPC – Curing of HPC – Mechanism of HPC – Properties of HPC during the fresh and hardened state. Durability of HPC - Acid Attack – Permeability – Scaling resistance – Chloride penetration – Resistance to sea water – sulfate attack – Alkali-aggregate reaction – Fire resistance – Mix design methods of HPC. Special High Performance Concrete-Air-entrained HPC Reactive powder Concrete-Bio concrete-Geo polymer, Fiber reinforced concrete Quality control - Sampling and testing-Acceptance criteria.","branch":"ce","reference books":"- Shetty, M.S., Concrete Technology, Theory & Practice, S.Chand and Co, 2004.n- Gambhir, M.L., Concrete Technology, Tata McGraw Hill, 2004.n- Nevile, Properties of Concrete, Longman Publishers, 2004.n- Santakumar A.R., Concrete Technology, Oxford University Press, New Delhi, 2007.n- P.-C.Aïtcin, High Performance Concrete, E &FN SPON, 1998n- E.G.Nawy, Fundamentals of High Performance Concrete, John Wiley & Sons., 2nd edition, 2000n- High Performance Concrete Structural Designers Guide published by FHWA, USA, 2005.n- Geert De Schutter, Peter J.M. Bartos, Peter Domone, John Gibbs, Self Compacting Concrete, Whittles Publishing, 2008.nCourse Outcome: On completion of the course, the students shall be able to:n- Test all the concrete materials as per IS code.n- Design the concrete mix using ACI and IS code methods.n- Determine the properties of fresh and hardened of concrete.n- Design special concretes and their specific applications.n- Ensure quality control while testing/ sampling and acceptance criteria."}
