{"course code":"CEIR12","course title":"ENGINEERING GRAPHICS","course type":"EPR","number of credits":"2","prerequisites":"Knowledge of Applied Physics","branch":"ce","course content":"- Orthographic ProjectionsnTheory of orthographic projections, planes of projection, four quardrants, first angle projection, third angle projection, B.I.S. Code of practice, view analysis, orientation of the object, laying out three view drawings, hidden lines and curves surfaces, conventional lines, dimensioning and lettering, conversion of pictorial view into orthographic views, development of missing views.nProjections of Points, Straight Lines and PlanesnPlanes in different quadrants, projections of lines parallel to one or both the planes, contained by one or both the planes, perpendicular to plane, inclined to one plane and parallel to other, inclined to both the planes, contained by a plane perpendicular to both the planes, true length of a line and its inclinations with the reference plane, trances of line. Types of planes, perpendicular planes, oblique planes, traces of planes, projections of planes parallel to one plane, perpendicular to both the planes, perpendicular to one plane and inclined to other plane.nProjections of SolidsnTypes of solid-polyhedral, solids of revolution, projections of solids, axis perpendicular to one plane, axis parallel to both the planes, axis parallel to one plane and perpendicular to other plane, axis inclined to both the planes.nSection planes, sections, true shape of sections, sections of prisms, pyramids, cylinders, cone placed in simple position.nGraphical StaticsnGraphical methods, Basic concept, Bow’s notation, space diagram, force and polar diagram, funicular polygon, support and support reactions, analysis of trusses, compressive and tensile stresses, stresses in plane framed structures.","reference books":"- Engineering Drawing- P.S.Gill (S.K.Kataria & sons, Ludhiana)n- Elementary Engineering Drawing- N.D.Bhatt (Charotar Publishing House)n- Graphic Statics- P.S.Gill (S.K.Kataria & sons, Ludhiana)nCourse Outcome: After the completion of the course, students are ablen- To understand the concepts like dimensioning, conventions and standard related to working drawings in order to become professionally efficient.n- To understand the theory of projections.n- To draw orthographic projections of lines, planes and solids.n- To draw sections of solids including cylinders, cones, prisms and pyramids.n- To analyses different force system (concurrent and non-concurrent) by using graphical method."}
