{"course code":"CELR42","course title":"ENVIRONMENTAL ENGINEERING – II (P)","course type":"ELR","number of credits":"1","prerequisites":"Knowledge of Structural analysis, Steel structuresnContentsn- Introduction to plastic analysis and design, plastic bending of beams, stages of bending, shape factor, plastic hinge, load factor, failure mechanism - Theorems of plastic analysis, collapse load for beams and frames, design of continuous beams.n- Design of round tubular structures - Introduction, sectional properties, permissible stresses, grades of steel tubes, tubular tension members, tubular compression members, tubular flexural members, combined bending and axial stresses.n- Analysis and design of steel stacks - Wind load estimation as per IS875 part 3, functional and structural requirements, self supporting and guyed stacks, base plate and anchor bolts, stability considerations.n- Wind load - Introduction to wind load, analysis and design of structural elements.n- Connections - Welded and bolted connections for un-stiffened and stiffened connections, moment resistant beam end connections.n- Composite construction - Introduction, composite beams, method of construction, limit state of collapse, limit state of serviceability, design examples.n- Design of steel tanks - Design loads, permissible stresses, design of cylindrical tanks with suspended bottom, supporting ring beam, staging for tanks, rectangular pressed steel tanks.","branch":"ce","course learning objectives":"- To analyze the physical and chemical characteristics of wastewatern- To familiarize the methods to estimate the organic strength of wastewatern- To study the growth of microorganisms and its quantification","course content":"Physical, chemical and bacteriological characterization of wastewater and strength assessment of wastewater by performing following laboratory experiments:n- To determine the acidity of a wastewater samplen- To determine the alkalinity of a wastewater samplen- To determine total, suspended, dissolved and settable solids in a wastewater samplen- To determine volatile and fixed solids in a wastewater samplen- To determine oil and grease in a wastewater samplen- To determine the chloride concentration in a wastewater sample.n- To determine the sulphate concentration in a wastewater sample.n- To determine the B.O.D. of a given wastewater sample.n- To determine the C.O.D. of a given wastewater sample.n- To determine the T.O.C. of a given wastewater sample.n- To determine the fecal count of a given wastewater sample.n13. Microscopic studies of a wastewater","course outcomes":"On completion of the course, the students will be able ton- Apply different analysis techniques for the measurement of physical and chemical parameters of wastewatern- Quantify the pollutant concentration in wastewatern- Recommend the degree of treatment required for the wastewatern- Assess the microbial population in wastewater","reference books":"- Subramanian N, Design of Steel Structures, Oxford University Press, New Delhi 2008.n- Bhavikatti, S.S., Design of Steel Structures, I.K. International Publishing House Pvt. Ltd., New Delhi, 2010.n- Krishnaraju, N. Structural Design and Drawing, Universities Press, 2009n- IS 800 - 2007, Code of practice for general construction in steel, Bureau of Indian Standards, New Delhi.n- SP6 (1)-1964, IS hand book for structural Engineers. Bureau of Indian Standards, New Delhi.n- IS 875 Part (3)-1987, Code of Practice or Design Loads (other than earthquake) for buildings and structures: wind loads, Bureau of Indian Standards, New Delhi."}
