{"course code":"CEOE13","course title":"TRAFFIC ENGINEERING AND ROAD SAFETY","course type":"OE","number of credits":"4","prerequisites":"","branch":"ce","course learning objectives":"- To understand the importance of traffic engineering, characteristics of traffic and Causes of road accidentsn- To know the relationship between contributing factors and road accidentsn- To study the traffic control devices and principles of signal / intersection design to address the problem of road accidentsn- To learn the environmental issues related to road traffic","course content":"## UNIT-InnOrganisational set up of traffic engg department in India. Traffic characteristics. Max dimensions and weights of vehicles. Traffic growth. Traffic studies. Accident statistics, Accident study. Parking Issues. Road alignments and road geometrics affecting road safety. Land use planning and road safety.nnn## UNIT-IInnSpace and time headway. Fundamental diagram of traffic flow. Relationship between speed, volume and density. Level of service. PCU. Design service volume. Capacity of non-urban & urban roads. Road congestion and road safety. IRC recommendations. Traffic control devices. Signal & Intersection Designs. Road markings, Traffic control aids and street furniture. Traffic control devices and road safety.nnn## UNIT-IIInnTraffic regulations. Regulation of speed, vehicles and drivers. General traffic regulations. Motor vehicle act. Scope of traffic management. Traffic management measures: restrictions on turning movements, one way streets, tidal flow operations, exclusive bus lanes, traffic restraint, road pricing. Enforcement and education measures for road safety.nnn## UNIT-IVnnRoad safety audit, RSA team, RSA Report, Elements of RSA, Detrimental effects of traffic. Vehicular air pollution. Situation in India. Vehicular emission norms in India and abroad. Alternate fuels. Factors affecting fuel consumption. Arboriculture.","reference books":"- Traffic Engg. and Transportation Planning by L.R.Kadiyali, Khanna Publishers, Delhi, 2002.n- Highway Engg by S.K.Khanna & C.E.G. Justo, Veeraragavan A., Nem Chand Bros., Roorkee, 2014n- Traffic Engg. by Matson, T.M., Smith, W.S. and Hurd, F.W., McGraw- Hill Book Co., New York.n- Traffic Flow Theory by Drew, D.R., McGraw- Hill Book Co., New York.n- Trainers Road Safety Manual, NHA and Ministry of Shipping, Road Transport and Highways, Govt of India.","course outcomes":"At the end of the course, the students will be able to:n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to road safety.n- Design geometrics, signals and intersections, make investigations, use modern tools and develop solutions to traffic problems including safety of road users.n- Understand the engineering solutions in societal and environmental context for sustainable development that takes care of pollution and environment.n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/IRC/MoRTH specifications."}
