{"course code":"CEOE12","course title":"GEOTECHNICAL EARTHQUAKE ENGINEERING","course type":"OE","number of credits":"4","prerequisites":"Knowledge of Engineering Geology and Geotechnical Engineering.","branch":"ce","course learning objectives":"- To explain the mechanism of earthquake and its related causes to build structures and in-situ soilsn- To explain how ground motion is recorded and how do quantify the earthquake intensity and frequency related parametersn- To explain how seismic site investigation will be done and seismic soil design parameters are estimatedn- To explain how seismic resistant design of foundation will be done and also explain the concept of liquefaction and related causes including codal recommendationsn- To explain how to do hazard assessment and mitigation and explain how do prepare a risk and microzonation mapping","course content":"- Mechanism of Earthquakes - Causes of earthquake - Earthquake Fault sources – Elastic Rebound theory - Seismic wave in Earthquake shaking - terminology - Locating an earthquake - Quantification of earthquakes. Strong Motion Records - characteristics of ground motion - Factors influencing Ground motion - Estimation of frequency content parametersn- Seismic site investigations – Selected Case Studies - Evaluation of Dynamic soil properties – Codal Provisions Design Ground Motion - Developingn- Design Ground Motion-Codal recommendations.n- Earthquake Resistant Design of foundation of buildings - Design considerations -. Earthquake Response of slopes - Evaluation of slope stability – Liquefaction Susceptibility - Liquefaction Resistance-Codal recommendations.n- Risk mapping - Hazard assessment – Mitigation measures - Seismic microzonation and its importance","reference books":"- Kameswara Rao, N.S.V., Dynamics soil tests and applications, Wheeler Publishing - New Delhi, 2000.n- Krammer S.L., Geotechnical Earthquake Engineering, Prentice Hall, International Series, Pearson Education (Singapore) Pvt. Ltd., 2004.n- Kameswara Rao, Vibration Analysis and Foundation Dynamics, Wheelern- Robert W. Day, Geotechnical Earthquake Engineering Hand book, McGraw Hill, 2002n- Debashis Moitra, Geotechnical Engineering, Universities Press, Edition No. - I, 2016.","course outcomes":"On completion of the course, the students will be able to:n- Demonstrate the principles of earthquake loadingn- Quantify earthquake intensity and ground motionn- estimate seismic soil design parametersn- analyze and design seismic resistant foundation for buildingsn- prepare soil risk and microzonation maps"}
