{"course code":"CEPC43","course title":"RAILWAY AND AIRPORT ENGINEERING","course type":"PC","number of credits":"4","prerequisites":"Transportation Engineering-I&II","branch":"ce","course learning objectives":"- To understand the permanent way and its componentsn- To know about points, crossings and train control systemsn- To understand the geometric design of track, about stations, yards and maintenance of tracks.n- To learn airport layout planning and runway pavement design","course content":"## UNIT-InnIntroduction of Permanent WaynHistory and general features of Indian railways, Railway Track Gauge, Rails, Sleepers, Track fittings and fastenings, Creep of rails, Ballast, Subgrade and formation, Rail joints and welding of rails, modern welded railway track, Track and Track stresses.nnn## UNIT-IInnStations and Yards, Points and Crossings, and SignallingnStations and yards, Points and crossings, design of turnouts and crossings, Signalling and interlocking, Train Control systems, Track maintenance and drainage.nnn## UNIT-IIInnGeometric Design of Track, High speed train systemsnGeometric design of track, curves and super elevation, Train resistance and tractive power, Urban Railway system, High speed Tracks, high speed train system technologies, Introduction to RDSO/IS specifications.nnn## UNIT-IVnnAirport Planning, Runway Layout and Pavement DesignnAirport planning, layout, geometric design, Airport pavements, introduction to runway pavement design software like FAARFIELD","reference books":"- Chandra, S. and Agarwal, M. M., “Railway Engineering”, Oxford.n- Arora, S. P. and Saxena, S. C., “A Text Book of Railway Engineering”, Dhanpat Rai Publications.n- Mundrey, J. S., “Railway Track Engineering”, Tata Mcgraw Hill.n- Khanna, S. K., Arora, M. G. and Jain, S. S., “Airport Planning & Design”, Nem Chand and Bros.n- Horonjeff, Robert and McKelvey, Francis X., “Planning & Design of airports’, 4th Ed., McGraw Hill.n- Saxena, S.C., “Airport Engineering – Planning and Design”, CBS Publishers.n- Transportation Engineering by C Venkatramaiah","course outcomes":"At the end of the course, the students will be able to:n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to railway and airport engineering.n- Design points and crossings, design runway pavements, make investigations, use modern tools and develop solutions to problems related to railway / airport engg.n- Understand the engineering solutions in societal context for sustainable development that takes care of environment and optimal use of resources.n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/RDSO/FAA/ICAO specifications."}
