{"course code":"CEPC26","course title":"TRANSPORTATION ENGINEERING –I","course type":"PC","number of credits":"4","prerequisites":"Geotechnical-I, Surveying-I","branch":"ce","course learning objectives":"- To understand the importance of transportation, characteristics of road transport, highway planning, alignment and surveysn- To know the geometric design of highwaysn- To study the traffic characteristics, traffic control devices and principles of signal / intersection designn- To learn the characteristics, properties and testing procedures of aggregate and bituminous materialsn- To know about granular and bituminous mixes and their designs","course content":"## UNIT-Inn- Triangulation and Trilateration: Triangulation systems, classification, strength of figure, selection of triangulation stations, grade of triangulation, field work of triangulation, triangulation computations, Trilateration- Principle, Methods, advantages and disadvantages, introduction to total stationn- Survey layout/setting out: Introduction, controls for layout, examples of laying outnnn## UNIT-IInn- Survey Adjustment and computations: Definitions, types of error, weight of an observation, law of weights, most probable values, principle of least squares, method of correlates, normal equation, adjustment of triangulation figures by method of least squares.nnn## UNIT-IIInn- Astronomy: Definitions of astronomical terms, celestial coordinate systems, Napier's rule of circular parts, star at elongation, star at prime vertical star at horizon, star at culmination, Astronomical triangle, Time: definitions of sidereal, apparent, solar and mean solar time, equation of timen- Elements of Photogrammetry: Introduction, types of photographs, Terrestrial and aerial photographs, aerial , camera, scale and height displacements of vertical photographs, Stereoscopic vision and stereoscopes, height determination from parallax measurement, flight planning, principle of photo interpretation.nnn## UNIT-IVnn- Introduction to remote sensing: Definition of Remote Sensing, types of remote sensing, remote sensing system and components. EMR source and characteristics, active and passive remote sensing, EMR propagation through medium, Role of atmosphere, Atmospheric windows, EMR interaction with objects, Spectral signature, EMR interaction with vegetation, soil and water. Satellite orbits and platforms: Geostationary and sun synchronous satellites, Resolution, Applications of remote sensing in civil engineeringn- Geographical Information System (GIS): Definition, and Objectives, Components of GIS, Spatial data models: Raster and Vector, Data inputting in GIS, Linkage between spatial and non spatial data, Spatial data analysis: Vector and raster based spatial data analysis, Integration of RS and GIS data, Digital Elevation Model, GIS Software Packages.","reference books":"- Chang.T.K. 2002: Geographic Information Systems, Tata McGrawHilln- Punmia, B.C. 2005: Surveying I and II, Luxmi Publicationsn- Charles D. Ghilani: Adjustment Computations: Spatial Data Analysis (Fifth Edition)n- Paul R Wolf: Elements of Photogrammetryn- G S Srivastava: An introduction to Geoinformaticsn- Basudeb Bhatta: Remote Sensing and GISn- G. L. Hosmer: Text-book on Practical Astronomyn- Various Online resources including NPTELnCourse Outcome:nStudents would be able to know about advanced methods of locating horizontal controls, set out various civil engineering structures, learn about different types of time and solution of astronomical triangle, apply corrections to the measurements for different errors, understand the difference between aerial photograph and satellite images and their use in map making.","course outcomes":"At the end of the course, the students will be able to:n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to highway engineering.n- Design geometrics, signals and intersections, make investigations, use modern tools and develop solutions to highway problems including safety of road users.n- Understand the engineering solutions in societal and environmental context for sustainable development that takes care of pollution and environment.n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/IRC/MoRTH specifications.","course objectives":"- To understand the principle of surveying on very large scale by locating precise horizontal controlsn- To learn about surveying applications in setting out worksn- To learn about determining absolute positions of a point using celestial measurementsn- To learn about different types of errors in measurements and their adjustmentn- To introduce the basic concept of photogrammetry, Remote sensing, and GIS"}
