{"course code":"CEPC12","course title":"BUILDING CONSTRUCTION AND MATERIALS","course type":"EPR","number of credits":"3","prerequisites":"None","branch":"ce","course content":"- CONSTRUCTION Masonry ConstructionnIntroduction, various terms used, stone masonry-Dressing of stones, Classifications of stone masonry, safe permissible loads, Brick masonry-bonds in brick work, laying brick work, structural brick work-cavity and hollow walls, reinforced brick work, Defects in brick masonry, composite stone and brick masonry, glass block masonry.nDoors and WindowsnLocations, sizes, types of doors and windows, fixures and fastners for doors and windows.nAcoustics, Sound Insulation and Fire ProtectionnClassification, measurement and transmission of sound, sound absorber, classification of absorbers, sound insulation of buildings, wall construction and accoustical design of auditorium, fire-resisting properties of materials, fire resistant construction and fire protection requirements for buildings.nMATERIALS StonesnClassification, requirements of good structural stone, quarrying, blasting and sorting out of stones, dressing, sawing and polishing, prevention and seasoning of stone.nBrick and TilesnClassification of bricks, constituents of good brick earth, harmful ingredients, manufacturing of bricks, testing of bricks. Tiles, Terra-cotta, manufacturing of tiles and terra-cotta, types of terra-cotta, uses of terra-cotta.nCement and MortarsnCements composition, types of cement, manufacturing of ordinary Portland cement, testing of cement, special types of cement, storage of cement.nMortarsnDefinition, proportions of lime and cement mortars, mortars for masonry and plastering.nTimbernClassification of timber, structure of timber, seasoning of timber, defects in timber, fire proofing of timber, plywood, fiberboard, masonite and its manufacturing, important Indian timbers.nConcrete ConstituentsnCement, tests on cement (physical tests), types of Portland cement, various types of cement- ordinary Portland cement, rapid hardening cement, low heat cement, sulphate resistant cement, portland-pozzolona cement, high strength Portland cement, high alumina cement, waterproof cement, white Portland cement, hydrophobic cement, coloured Portland cement. Aggregates, classification of aggregates based on petrographic, size, shape & texures,ndeleterious substances in aggregates, bulking of fine aggregate, sieve analysis, grading of aggregates as per IS-383-1970. Fineness Modulus, Maximum size of aggregate. Quality of mixing water, curing water.nPROPERTIES Of CONCRETE:nIntroduction, workability, factors influencing workability, measurement of workability, requirements of workability, properties of hardened concrete, stress and strain characteristics of concrete, Young's modulus of concrete, creep and shrinkage of concrete, permeability of concrete, durability of concrete sulphate attack, fire-resistance, thermal properties of concrete, construction joints, expansion and contraction joints.nSPECIAL CONCRETEnLight weight concrete, definition and its properties, applications, high strength concrete, definitions, its properties and applications, mass concrete, waste material based concrete, shortcrete, fiber reinforced concrete: Materials. Fibers-types and properties, ferrocement, polymer concrete composites, heavy-weight concrete for radiation shielding.n- DRAWINGSnnnTypical drawings ofn- Typical drawings ofn- Cavity Walln- Bonds in brick workn- Grillage foundationnnnnPreparation of building drawing mentioning its salient features including the following details:n- Preparation of building drawing mentioning its salient features including the following details:n- Ground floor plann- Two Sectional Elevationsn- Front and Side Elevationsn- Plan and Sectional Elevation of stair case, doors/ windows/ ventilators, floor and roof.","reference books":"- Building Construction, Sushil Kumar, Standard Pub., N. Delhin- Building Material, Rangawalan- Construction Engineering, Y.S. Sanen- Building Construction, Gurcharan Singh, Standard Pub., N. DelhinCorse Outcome: On completion of the course, the students will ben- Able to identify the various building materials with symbols.n- Able to identify the properties of building materials.n- Made acquainted with the manufacturing process of basic construction materials.n- Made acquainted with the masonry construction and finishesn- Aware of building services, acoustics, DPC, etc."}
