{"course code":"CEPC39","course title":"TRANSPORTATION ENGINEERING-II","course type":"PC","number of credits":"4","prerequisites":"Transportation Engineering-I, SA-I","branch":"ce","course learning objectives":"- To understand the design of flexible and rigid pavements.n- To know the construction techniques of highways pavements.n- To understand the pavement failures and maintenance of pavements including strengthening.n- To learn economic evaluation of highway projects and sources of financing.n- To know the basics of tunnel engineering.","course content":"## UNIT-InnDesign of Flexible PavementsnTypes of pavements. Flexible and rigid pavements. Components of a pavement and their functions. Factors affecting design of pavements. Review of design by old methods, Design of a flexible pavement by CBR method (as per latest IRC guidelines).nDesign of Rigid PavementsnWestergaard’s theory, critical locations of loading, load and temperature stresses. Critical combination of stresses. IRC guidelines for determination of thickness of a rigid pavement. Joints: requirements, types, patterns. Spacing of expansion and contraction joints. Functions of dowel and tie bars.nnn## UNIT-IInnHighway Construction : Non-Bituminous PavementsnSubgrade and embankment construction, Construction of GSB, WBM, WMM. Construction of DLC & PQC. Fixed form and Slip-form paving techniques.nConstruction of Bituminous PavementsnVarious types of bituminous constructions. Prime coat, tack coat, seal coat and surface dressing. Construction of BUSG, Premix carpet, BM, DBM and BC. Mastic asphalt. Brief introduction to functions of Rollers, paver and hot mix plants. Introduction to various IRC and MoRTH specifications.nnn## UNIT-IIInnHighway MaintenancenFailures and remedies of bituminous and cement concrete pavements. Pavement evaluation. Benkleman beam. Introduction to various types of overlays. Overlay design.nHighway Drainage and Hill RoadsnSurface drainage: types, brief design. Types of sub-surface drainage. Special characteristics of hill roads: geometrics, hair pin bends.nnn## UNIT-IVnnHighway Economics and FinancenNeed of economic evaluation. Highway user benefits and costs. Methods of economic evaluation, Highway finance. PPP Projects. Rate analysis of MoRTH standard data book & cost estimation.nTunnelsnSections of tunnels, Shaft. Pilot tunnel. Driving tunnel in rocks. Driving tunnel in soft ground. Drainage and Ventilation of Tunnels.","reference books":"- Highway Engg by S.K.Khanna & C.E.G. Justo, Veeraragavan A., Nem Chand Bros., Roorkee, 2014.n- Principles and Practice of Highway Engg. by L.R.Kadiyali, N.B. Lal, Khanna Publishers, Delhi, 2008.n- Principles of Pavement Design by Yoder,E.J & Witczak,M.W., John Wiley and Sons, USA.n- Tunnel Engineering by S.C.Saxena, Dhanpat Rai Publications, N.Delhi.n- A text book of Tunnel, Bridges and Railway Engg. by S.P.Bindra, Dhanpat Rai Delhi.","course outcomes":"At the end of the course, the students will be able to:n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to pavement engineering.n- Design flexible and rigid pavements, make investigations, use modern tools and develop solutions to problems related to highway pavements.n- Understand the engineering solutions in societal context for sustainable development that takes care of environment and economical use of resources.n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/IRC/MoRTH specifications."}
