{"course code":"CEPC44","course title":"INDUSTRIAL WASTE WATER TREATMENT","course type":"PC","number of credits":"4","prerequisites":"","branch":"ce","course learning objectives":"- To study characteristics of industrial wastewater and its effects on water bodiesn- To know the quality of industrial effluents required before disposal on environmentn- To learn various physico-chemical and biological treatment techniques to treat industrial wastewatern- To gain knowledge about the reuse of treated industrial effluents","course content":"Prevention Vs control of industrial pollution, zero discharge concept, effects of industrial waste disposal on streams, sewerage systems and wastewater treatment plants, effluent standards for disposal into inland surface water sources and on land for irrigation, industry specific standards, quality requirements for reuse, various steps to minimize effects of industrial effluents on waste water treatment plants and receiving streams-conservation of water, process change, reuse of waste water, volume reduction, strength reduction, neutralization, equalization and proportioning, population equivalent, common effluent treatment plant (CETP), study of the following industries from waste generation, quality and its treatment including brief overview of manufacturing process: Textile, tannery, sugar mill, distillery, dairy, pulp & paper, metal plating, oil refinery, nitrogenous fertilizers, thermal power plants and radioactive wastes.","reference books":"- Industrial and Hazardous Waste Treatment: N. L. Nemerow and A. Dasgupta.n- Industrial Effluents by N. Manivasakamn- Waste Water Treatment: M. N. Rao and A. K. Duttan- Industrial Water Pollution Control: W. W. Eckenfeldern- Handbook of Industrial Pollution and Control, Volume I & II: S. C. Bhatian- Pollution Control in Process Industries: S. P. Mahajan","course outcomes":"On completion of the course, the students will be able ton- Recognize various environmental problems due to improper management of industrial wastewatern- Determine appropriate technologies for treatment and management of industrial wastewatern- Recommend different techniques for the safe disposal of industrial effluentsn- Analyse the quality requirements for reuse of industrial effluents"}
