{"course code":"CEPC21","course title":"STRUCTURAL ANALYSIS-II","course type":"PC","number of credits":"3","prerequisites":"Structural Analysis – In1 Analysis of continuous beam and framesnSlope deflection method, moment distribution method, Kani’s method, Approximate analysis of frames for vertical and lateral loadsnUnsymmetrical BendingnIntroduction Centroidal principal axes of sections, Bending stresses in beam subjected to unsymmetrical bending, shear centre, shear centre for channel, Angles and Z sections.nRolling Loads and Influence lines DiagramsnIntroduction, Single concentrated load, uniformly distributed load longer than span, shorter than span , two point loads, several point loads, Max.B.M. and S.F.Absolute, Max.B.M.nIntroduction, influence lines for three hinged and two hinged arches, load position for Max.S.F. and B.M. at a section in the span.nMuller-Breslau Principle, I.L. for B.M. & S.F. for continuous Beams.nAnalysis of Arches:nThree Hinge Arches: Horizontal thrust, shear force and Bending Moment diagram Two Hinge Arches: Parabolic and circular arches, Bending Moment Diagram for various loadings, temperature effets, web shortening, Axial thrust and Radial Shear force diagrams.nFixed Arches: Expression for Horizontal thrust and Bending Moment at a section, elastic centrenCourse Outcomen- To analysis the structures using different displacement methodsn- To understand the behaviour of structure under unsymmetrical bendingn- To understand influence line diagram and be able to draw influence lines for various functions of determinate and indeterminate structuresn- To analyse the archesnReferences Booksn- Indeterminate structures, R.L.Jindal S.Chand & Co.,N.Delhi.Advanced Structural Analysis-A.K.Jain, NemChand & Bros.,Roorkee.n- Structural Analysis-A Unified Approach, D.S.Prakash Rao,, University Press, Hyderabad.n- Structural Analysis-A unified classical & Matrix Approach, A.Ghali & A.M.Neville,Chapman & Hall London.n- Theory of Strucutres,- Vol. I&II,- S.P.Gupta & G.S.Pandit, Tata McGraw Hill, N.Delhi.","branch":"ce","course objectives":"- To understand the importance of surveying in Civil engineeringn- To study the basic of linear/angular/direction measurements using chain/tacheometer/compass and theodolite and their applicationsn- To study the method of determination of height of points using various leveling method and Tacheometern- To study the significance of Plane Table surveying in preparation of map and setting of different types of curvesn- To study the determination of coordinates using satellite based method","course content":"## UNIT-Inn- Basics of Surveying: Definition, objects, classification, f u nd a me n t a l principles, methods of fixing stations, concept of Geoid and reference spheroids,n- Linear measurement: Direct measurement, instruments for measuring distance, instruments for making stations, chaining of line, errors in chaining, tape corrections examples, Chain traversingn- Direction Measurement: Bearings and angles; Compass surveying- magnetic bearings, prismatic and surveyors compass, declination, local attraction errors and adjustments; Methods of compass traversing, checks in traversing, adjustment of closed traverse,nnn## UNIT-IInn- Angle Measurement: Theodolite: Theodolites, temporary adjustment of theodolite, measurement of horizontal and vertical angles, the odoli t e traverse.n- Leveling: Definition of terms used in leveling, types of levels and staff, temporary adjustment of levels, principles of leveling, spirit and trigonometric levelling, reduction of levels, booking of staff readings, plane and geodetic trigonometric levelling, correction due to curvature and refraction, axis signal correction, Contouring, contour, characteristics of contours lines, locating contours, interpolation of contours, use of contours.nnn## UNIT-IIInn- Plane Table Surveying: Plane table accessories, various methods of plane table surveying, two point and three point problems, sources of error, advantages and disadvantagesn- Curves: Classification of curves, elements of simple circular curve, location of tangent points-chain and tape methods, instrumental methods, examples of simple curves Transition Curves-Length and types of transition curves, length of combined curve, examples. Vertical C u r v e s : Necessity and types of vertical curves, setting out of a vertical curve by tangent correction, chord gradient and sight distance method.nnn## UNIT-IVnn- Tacheometry: Principle of tacheometry, stadia and tangential method of tacheometryn- GNNS: Global Navigation Satellite System (GNSS): basic concepts, History of GPS, GPS design objectives and details of segments: space, control and user. Brief of different GPS systems, including, NAVSTAR GPS, GLONASS, GALILEO,IRNSS, BeiDou etc, Advantages and limitations of GPS. GPS Signal structure: Carriers frequencies, GPS codes: C/A, P, navigational message, GPS receiver: Types. Principles of GPS position fixing, Pseudo ranging and carrier phase, GPS errors.","reference books":"Surveying volume I and II: B C Punmia Engineering Surveying (Sixth Edition): W. Schofield Text Book of Surveying: C.VenkataramiahnIntroduction to GPS: The Global Positioning System: Ahmed El-Rabbany Various Online resources including NPTEL","course outcomes":"On completion of the course, the students would be able to: carry out surveying in the field for various civil engineering projects, prepare a contour map and plan of the area, taking accurate measurements with different surveying instruments, adjustment of traverse, understand the process of setting of different curves for road and railway designs"}
