{"course code":"CEPC27","course title":"WATER SUPPLY AND TREATMENT","course type":"PC","number of credits":"4","prerequisites":"","branch":"ce","course learning objectives":"- To make the students conversant with sources of water and types of water demandn- To understand the basic characteristics of water and its determinationn- To expose the students to understand components of water supply schemen- To provide adequate knowledge about the water treatment processes and its designn- To have adequate knowledge on water conveyance and distribution network","course content":"- Water QuantitynImportance and necessity of water supply scheme. Components of water supply scheme, water demands and its variations. Population forecasting, estimation of total quantity of water requirement, quality and quantity of surface and ground water sources, selection of a source for water supply, types of intakes, pumps and pumping stations.nWater QualitynSources of impurities, type of impurities in water and their sanitary significance, physical, chemical and bacteriological analysis of water, water quality standards.nWater TreatmentnObjectives, treatment processes and their sequence in conventional water treatment plant, aeration, sedimentation – plain and aided with coagulation- types, features and design aspects, mixing basins and flocculation units. Filtration – mechanisms, types of filters - slow and rapid sand filtration units (features and design aspects), disinfection - theory, methods and practices, specific water treatment methodsnWater Conveyance and DistributionnHydraulic design of pressure pipe, pipe materials, types of distribution system – gravity system, pumping system, dual system, layout of distribution system – dead end system, grid iron system, ring system, radial system, their merits and demerits, distribution reservoir - functions and determination of storage capacity.","reference books":"- Water Supply and Sewerage: E.W. Steel.n- Water Supply Engineering: S.R. Kshirsagar.n- Water Supply Engineering: S.K. Garg.n- Water Supply Engineering: B.C. Punmia.n- Environmental Engineering: Peavy H. S., Rowe D. R. and Tchobanoglous G.n- Introduction to Environmental Engineering: Davis M. L. and Cornwell D. A.n- Water Supply and Sanitary Engineering: Birdie, G. S. and Birdien- Manual on Water Supply and Treatment: Ministry of Urban Dev., New Delhi.","course outcomes":"On completion of the course, the students will be able ton- Forecast the population and estimate water demandn- Analyze various water quality parametersn- Differentiate various intake structuresn- Design various water treatment units and distribution network"}
