{"course code":"CEPC37","course title":"SEWERAGE AND SEWAGE TREATMENT","course type":"PC","number of credits":"4","prerequisites":"","branch":"ce","course learning objectives":"- To learn basics of sewage collection and design of sewersn- To learn the basics of sewage composition and its characteristicsn- To have adequate knowledge about various sewage treatment processes and its designn- To provide adequate information on various disposal standards for treated effluents","course content":"- Collection of SewagenImportance of sanitation, types of sewerage systems – separate, combined and partially separate, quantity of sanitary sewage and variations, shapes of sewer - circular and egg shaped, design of sewers, self-cleansing velocity and slopes, construction and testing of sewer lines, sewer materials, joints and sewer appurtenances, building drainage and plumbing systems.nSewage CharacterisationnQuality parameters- BOD, COD, solids, oil and grease, Indian Standards for disposal of effluents into inland surface sources and on land, guidelines for reuse of treated wastewater.nSewage TreatmentnObjectives, sequence and efficiencies of conventional treatment units, preliminary treatment, screening and grit removal units, theory and design aspects of primary treatment, secondary treatment- activated sludge process & its modifications, tricking filter, UASB process, introduction to advance sewage treatment systems - sequencing batch reactor (SBR)-moving bed biofilm reactor (MBBR)-membrane bioreactor (MBR), Stabilization pond, aerated lagoon, septic tank, sludge disposal – thickening-digestion-dewatering, introduction of tertiary treatmentnDisposal of SewagenRecycling and reuse of treated wastewater, disposal of sewage by dilution - self-purification of streams - Streeter Phelps equation - oxygen sag curve, sewage disposal by irrigation (sewage treatment).","reference books":"- Environmental Engineering: Peavy H. S., Rowe D. R. and Tchobanoglous G.n- Introduction to Environmental Engineering: Davis M. L. and Cornwell D. A.n- Wastewater Engineering, Collection, Treatment and Disposal: Metcalf and Eddyn- Water Supply and Sanitary Engineering: Birdie, G. S. and Birdien- Sewage and Sewage Treatment: S.K. Garg.n- Sewage and Sewage Treatment: S.R. Krishansagar.n- Waste Water Engineering: B.C. Punmia.n- Manual on Sewerage and Sewage Treatment: Ministry of Urban Dev., New Delhi.","course outcomes":"On completion of the course, the students will be able ton- Estimate quantity of sewage and design sewerage systemn- Determine the various characteristics of sewagen- Design various sewage treatment unitsn- Plan reuse of treated effluent and select appropriate disposal option"}
