{"course code":"CEPC47","course title":"CONSTRUCTIONnMANAGEMENT, ESTIMATING AND COSTING","course type":"PC","number of credits":"3","prerequisites":"None","branch":"ce","course content":"- Network Techniques in Construction Management-I:CPMnIntroduction, network techniques, work break down, classification of activities, rules for developing networks, network development-logic of network, allocation of time to various activities, Fulkerson's rule for numbering events, network analysis , determination of project schedules, critical path, ladder construction, float in activities, shared float, updating, resources allocation, resources smoothing and resources leveling.nNetwork Techniques in Construction Management-II-PERTnProbability concept in network, optimistic time, pessimistic time, most likely time, lapsed time, deviation, variance, standard deviation, slack critical path, probability of achieving completion time, central limit theorem.nCost-Time AnalysisnCost versus time, direct cost, indirect cost, total project cost and optimum duration, contracting the network for cost optimisation, steps in time cost optimisation, illustrative examples.nConstruction Contracts & SpecificationsnIntroduction, types of contracts, contract document, specifications, important conditions of contract, arbitration.nNecessity of specifications, types of specifications, general specifications, specification for bricks, cement, sand, water, lime, reinforcement; Detailed specifications for Earthwork, Cement, concrete, brick work, floorings, D.P.C., R.C.C., cement plastering, white and colour washing, distempering, painting.nInspection & Quality ControlnIntroduction, principles of inspection, enforcement of specifications, stages in inspection and quality control, testing of structures, statistical analysis.nEstimatenPrinciples of estimation, units, items of work, different kinds of estimates, different methods of estimation, estimation of materials in single room building, two roomed building with different sections of walls, foundation, floors and roofs, R.B. and R.VC.C. works, Plastering, White-washing, Distempering and painting, doors and windows, lump sum items, Estimates of canals, roads etc.nRate AnalysisnPurpose, importance and requirements of rate analysis, units of measurement, preparation of rate analysis, procedure of rate analysis for items:- Earthwork, concrete works, R.C.C. works, reinforced brick work, plastering, painting, finishing(white-washing, distempering).nPublic Works AccountnIntroduction, function of P.W. department, contract, guidelines, types of contracts, their advantages and disadvantages, Tender and acceptance of tender, Earnest money, security money, retention money, measurement book, cash book, preparation, examination and payment of bills, first and final bills, administrative sanction, technical sanction.","reference books":"- Construction Planning & Management by P.S.Gehlot & B.M.Dhir, Wiley Eastern Ltd.n- PERT & CPM -Principles & Applications by L.S.Srinath. Affiliated East-west Press(P)Ltd.n- Project Planning & Control with PERT & CPM by B.C.Punia & K.K.Khandelwal,Lakshmi Pub. Delhin- Construction Management & Planning by B.sengupta & H.Guha, Tata McGraw Hills.n- Estimating and Costing for Building & Civil Engg.Works by P.L.Bhasin, S.Chand & Co., N.Delhi.n- Estimating, Costing & Specification in Civil Engg. by M.Chakarborty, Calcutta.n- Estimating & Costing in Civil Engg..: Theory & Practice by B.N.Dutta, S.Dutta & Co., Lucknow.n- Building Construction Estimating by George H.Cooper, McGraw Hill Book Co., New York.nCorse Outcome: On completion of the course, the students shall be able to:n- Understand the roles and responsibilities of a project managern- Prepare schedule of activities in a construction projectn- Prepare tender and contract document for a construction projectn- Understand safety practices in construction industryn- Identify the equipment used in construction"}
