{"course code":"CEPC35","course title":"HYDROLOGY & WATERnRESOURCES ENGINEERING","course type":"PC","number of credits":"4","prerequisites":"","branch":"ce","course objectives":"To provide student knowledge in hydrology and hydraulics and understand concepts of water resources systems.","course content":"- IntroductionnHydrologic cycle, scope and application of hydrology to engineering problems, drainage basins and its characteristics, stream geometry, hypsometric curves.nPrecipitationnForms and types of precipitation, characteristics of precipitation in India, measurement of preciptation, recording and non recording raingages, raingage station, raingage network, estimation of missing data, presentation of rainfall data, mean precipitation, depth -area -duration relationship, frequency of point rainfall, intensity - duration- frequency curves, probable max. precipitation.nEvaporation & TranspirationnProcess, evaporimeters and empirical relationships, analytical method, reservoir evaporation and methods of its control, transpiration, evapotranspiration and its measurement, Penman's equation and potential evapotranspiration.nInfiltrationnInfiltration process, initial loss, infiltration capacity and measurement of infiltration, infiltration indices.nRunoffnFactor affecting run-off, estimation of runoff, rainfall-run off relationships, measurement of stage-staff gauge, wire gauge, automatic stage recorder and stage hydrograph, measurement of velocity-current meters, floats, area velocity method, moving boat and slope area method, electromagnetic, ultra-sonic and dilution methods of stream flow measurement, stage discharge relationship.nHydrographnDischarge hydrograph, components and factors affecting shape of hydrograph, effective rainfall, unit hydrograph and its derivation, unit hydrograph of different durations, use and limitations of UH, triangular UH, Snyder's synthetic UH, floods, rational methods, empirical formulae, UH method, flood frequency methods, Gumbel's method, graphical method, design flood.nGround WaternOccurrence, types of aquifers, compressibility of aquifers, water table and its effects on fluctuations , wells and springs, movement of ground water, Darcy's law, permeability and its determination, porosity, specific yield and specific retention, storage coefficient, transmissibility. Steady state flow to wells in unconfined and confined aquifers.nWater Resources PlanningnRole of water in national development, assessment of water resources, planning process, environmental consideration in planning, system analysis in water planning, some common problems in project planning, functional requirements in multipurpose projects, multipurpose planning, basinwise planning, long term planning.nReservoir planning-dependable yield, sedimentation in reservoir, reservoir capacity, empirical-area reduction method.nWater Resources Systems EngineeringnConcept of system's engineering, optimal policy analysis, simulation and simulation modeling, nature of water resources system, analog simulation, limitations of simulation, objective function, production function, optimality condition, linear, non- linear and dynamic programming, applications to real time operations of existing system, hydrologic modeling and applications of basic concepts.","reference books":"- Engineering Hydrology by K.Subramanya.n- Hydrology by H.M.Raghunath.n- Hydrology for Engineers by Linsely, Kohler, Paulhus.n- Water Resources Engineering by Linseley and Franzinin- Economics of Water Resources Engineering by James and Lee.n- Optimisation Theory and Applications by S.S.Royn- Water Resources Systems Planning & Economics by R.S.Varshney.n- Operational Research-An Introduction by Hamdy A.Taha.","course outcomes":"Students will be able to understand and measure various hydrologic data required for water resources planning and design of hydraulic structures."}
