{"course code":"CEPC33","course title":"GEOTECHNOLOGY-I","course type":"PC","number of credits":"4","prerequisites":"Knowledge of Soil Mechanics","branch":"ce","course content":"- Sub-Surface ExplorationnPurpose, stages in soil exploration, depth and lateral extent of exploration, guidelines for various types of structures, ground water observations, excavation and boring methods, soil sampling and disturbance, major types of samplers, sounding methods-SCPT, DCPT, SPT and interpretation, geophysical methods, pressure-meter test, exploration logs.nDrainage & DewateringnIntroduction, ditches and sumps, well point systems, shallow well system, deep well drainage, vacuum method, Electro-osmosis, consolidation by sand piles.nShallow Foundations-InDesign criteria for structural safety of foundation( i ) location of footing,(ii) shear failure criterion, (iii) settlement criterion, ultimate bearing capacity, modes of shear failure, Rankine's analysis Tergazi's theory, Skempton's formula, effect of fluctuation of G.W.T. , effect of eccentricity on bearing capacity, inclined load, I.S Code recommendations, factors affecting bearing capacity, methods of improving bearing capacity.nShallow Foundations-IInVarious causes of settlement of foundation, allowable bearing pressure based on settlement, settlement calculation, elastic and consolidation settlement, allowable settlement according to I.S.Code. Plate load test and its interpretation, bearing capacity from penetration tests, design bearing capacity.nShallow Foundations-IIInSituation suitable for the shallow foundations, types of shallow foundations and their relative merits, depth of foundation, footing on slopes, uplift of footings, conventional procedure of proportioning of footings, combined footings, raft foundations, bearing capacity of raft in sands and clays, various methods of designing rafts, floating foundations.nPile Foundations-InIntroduction, necessity of pile foundations, classification of piles, load capacity, static analysis, analysis of pile capacity in sands and clays, dynamic analysis, pile load tests, negative skin friction, batter piles, lateral load capacity, uplift capacity of single pile, under- reamed pile.nPile Foundations-IInGroup action in piles, pile spacing, pile group capacity, stress on lower strata, settlement analysis, design of pile caps, negative skin friction of pile group, uplift resistance of pile group, lateral resistance, batter pile group.nDrilled Piers and Caisson FoundationsnDrilled piers-types, uses, bearing capacity, settlement, construction procedure. Caissons- Types, bearing capacity and settlement, construction procedure.nWell foundations-shapes, depth of well foundations, components, factors affecting well foundation design lateral stability, construction procedure, sinking of wells, rectification of tilts and shifts, recommended values of tilts & shifts as per I.S.3955.","reference books":"- Murthy, V.N.S, A text book of Soil Mechanics and Foundation Engineering, UBS Publishers & Distributors Pvt. Ltd., New Delhi 1999.n- Punmia, B.C., Soil Mechanics and Foundation Engineering, Laxmi Publications Pvt. Ltd., New Delhi, 1995.n- Gopal Ranjan, ASR Rao, Basic and Applied Soil Mechanics, New Age Intetrnationaln(P) Ltd. Publishers- N.Delhi, Edition No. - 3rd, 2016.n- Nainan P Kurian, Design of foundation Systems Principles and Practices, Narosa, 2011n- Braja M. Das, Principles of Foundation Engineering, Thomson Asia Pvt. Ltd., Singapore, 2005.n- Donald P. Coduto, Man-Chu Ronald Yeung and William A. Kitch, Geotechnical Engineering, Principles and Practices, PHI Learning Private limited, 2011.n- Joseph E. Bowles, Foundation Analysis and Design, McGRAW-Hill, 1998.n- P.Purshotam Raj, Geotechnical Engg, Tata Mcgraw Hill, N.Delhi, Edition No. - I, 1995nCourse Outcome: On completion of this course, the student will be able to:n- Understand the importance of soil investigation for any civil engineering constructionn- Do proper bearing capacity estimation including IS code methodsn- Do proper foundation proportioning for any kind of shallow foundation system and also get exposed in foundation analysisn- To estimate pile and pile group capacity for any kind of soils including group efficiency and negative frictionn- To emphasize the importance of soil investigations.n- To explain the concept of bearing capacity and how to estimate the safe bearing capacity for various foundation system including settlement considerationn- To explain how to select a suitable shallow foundation system for various site conditions and also analysis of different foundation systemn- To explain in what circumstances pile is needed and how to estimate pile and pile group capacity under various soil conditions"}
