{"course code":"CEPE18","course title":"POLLUTION CONTROL AND WASTE MANAGEMENT","course type":"PE","number of credits":"3","prerequisites":"","branch":"ce","course learning objectives":"- To understanding environment, impact of various activities on environment, sustainable development, ecology and biodiversity conservationn- To understand air pollution, its effects and control methodsn- To understand noise pollution, its effects and control measuresn- To understand the sources, types and composition of municipal solid waste and the methods of solid waste disposalnContentn- Environment, Ecology and BiodiversitynGlobal environment, impact of humans upon environment, impact of environment upon humans, population explosion and its effects on environment, need of sustainable development, conventional sources of energy and their impact on environment. Ecology: Ecosystem and its types, energy flow in ecosystems, food chains, trophic levels, food web, ecological pyramids, biogeochemical cycles - nitrogen, sulphur and phosphorus cycles, biodiversity and its importance, measures of biodiversity conservationnAir PollutionnComposition and structure of atmosphere, classification and sources of air pollutants, effects of air pollution on plants, animals, human health, economic effects of air pollution, greenhouse effect and global warming, ozone layer depletion and acid rains. Meteorological parameters influencing air pollution, plume behaviour. Air quality standards, air quality index, automobile pollution - effects and control measures. Atmospheric self – cleansing processes, approaches and techniques of air pollution control. Air pollution control devices: Gravitational settling chamber, cyclones, wet scrubbers, fabric filters, ESP and catalytic converters.nNoise PollutionnGeneral introduction to noise pollution, human acoustics, unit of measurement, loudness, measurements of noise and weighting networks, sources and effects of noise pollution, noise abatement/control, noise standards.nSolid Waste ManagementnDefinition, types, composition and sources of solid wastes, Solid Waste Management Rules (2016), storage and collection of municipal solid waste, methods of solid waste disposal – composting, incineration, pyrolysis and sanitary land filling, recovery of materials and energy from solid waste.","reference books":"- Environmental Engineering by H. S. Peavy, D. R. Rowe and G. Tchobanoglousn- Ecology by E. P. Odumn- Air Pollution by M. N. Raon- Environmental Noise Pollution by P. F. Cuniffn- Solid Waste Management Collection, Processing and Disposal by A. D. Bhide and B.nB. Sundaresan","course outcomes":"On completion of the course, the students will be able ton- Understand importance of sustainable development, biodiversity conservation and environmental protectionn- identify the types and sources of air pollutantsn- predict the effects of air pollutants on human health and the environmentn- choose appropriate technologies for control of air pollutantsn- understand and select appropriate measures for noise pollution controln- explain the various functional elements involved in solid waste management systemn- select suitable solid waste processing technologies and disposal methods"}
