{"course code":"CEPE12","course title":"DYNAMICS OF STRUCTURES","course type":"PE","number of credits":"3","prerequisites":"","branch":"ce","reference books":"Contentsn- Seismology:nIntroduction, plate tectonics, earthquake distribution and mechanism, seismicity, seismic waves, earthquake magnitude and intensity, seismic zoning and seismometry.nSingle Degree of Freedom Systems:nVarious types of dynamic loads, vibration of single degree of freedom system, Free and forced vibrations, types of damping, critical damping. Transmissibility, vibration measuring instruments, response spectrum.nMulti-degrees of Freedom(MDOF)Systems:nEquation of Motion, normal modes and natural frequencies, semi-definite systems, dynamic vibration absorbers, vibration dampers, principle of orthogonally, Stodolas method, Holzer's method, matrix method, modal analysis and its limitations. Mode super position method.nSeismic Analysis and Design:nGeneral principles, assumptions, seismic coefficient method, response spectrum method, strength and deflection, design criterion for structures, significance of ductility, design and detailing for ductility, codal provisions, design examples.nSeismic Performance, Repair and Strengthening:nMethods for assessing seismic performance, influence of design ductility and masonry infills, criterion for repair and strengthening, repair and strengthening techniques and their applications, additions of new structural elements.nVibrational Control:nGeneral features of structural control, base isolation, active and passive control system. Earthquake resistance design as per I.S.:1893, I.S.4326 and I.S.13920.n- Elements of Earthquake Engineering, Jai Krishna, A. R. Chandershekaran & Brajesh Chandra , South Asian Pub New Delhi.n- Dynamics of Structures, Clough & Penzion, McGraw Hilln- Earthquake Engineering, Y-X Hu,S-C.Liu and W.Dong, E and FN Sons., Madras.n- Earthquake Resistant Concrete Structures, George G. Penelis and J. Kapoors, E & FN Sons, Madras.n- Structural Dynamics, Mario Paz, CBB Pub. N. Delhi."}
