{"course code":"CEPE19","course title":"ENVIRONMENTAL IMPACT ASSESSMENT","course type":"PE","number of credits":"3","prerequisites":"","branch":"ce","course learning objectives":"- To learn the importance of environmental impact assessment in various development projectsn- To understand the legal provisions on EIA and EIA notificationsn- To brief the various methodologies involved in environmental impact assessmentn- To identify the prediction tools for the assessment of different environmental impactsn- To describe the concepts of environmental management system.nNational environmental policy, impacts of development projects on environment, Environmental Impact Assessment (EIA) and Environmental Impact Statement (EIS) - Objectives - EIA Types, EIA in project cycle - Capacity and limitations, Legal provisions on EIA, Environmental Impact Assessment notification, Methods of categorization of industries for EIA, Elements of EIA - Process screening, baseline studies, mitigation, Methods of EIA - matrices, checklist - strength, weakness and applicability, Prediction and assessment of impact on land, water, air, noise and energy, flora and fauna, Socio economic impact, Mathematical models for impact prediction, rapid EIA, public participation, Post environmental audit. Plan for mitigation of adverse impact on environment – Options for mitigation of impact on water, air and land, energy, flora and fauna; addressing the issues related to the project affected people, Environment Management Plan – ISO 14000. EIA case studies for new and expansion projects: township projects, river valley projects, thermal power plants and industrial plants.nReferences Booksn- Environmental Impact Assessment by Canter, R. L.n- Environmental Impact Assessment Methodologies, Anjaneyulu, Yn- Concepts in Environmental Impact Analysis by Shukla S. K. and P. R. Srivastavan- Environmental Impact Analysis by John G. Rao and David C. Hooten (Ed.).","course outcomes":"At the end of the course, the students will be able ton- Analyse the environmental impacts of proposed projectsn- Categorize the type of EIA required for proposed projectsn- Predict and assess the impact of proposed projects on the environmentn- Use mathematical tools to predict the environmental impactsn- Propose proper mitigation measures to avoid environmental impactsn- Summaries the EIA report with suitable environmental management plan"}
