{"course code":"CEPE15","course title":"GEOSYNTHETICS ENGINEERING","course type":"PE","number of credits":"3","prerequisites":"","branch":"ce","course learning objectives":"- To explain the basic mechanisms of soil reinforcement and design principles in reinforced earth walln- To understand the applications of Geosynthetics in geotechnical problems and its design principlesn- To explain the usage of Geosynthetics in geoenvironmental and pavement engineering with designn- To explain the present status of development in geo-synthetics and filed instrumentation and controlnContentsn- Basic Description of GeosyntheticsnHistorical Development, the Nomenclature, Function, Use Around the World, Applications, Development in India.nRaw Materials – Their Durability and AgeingnRaw Materials, Durability, Degrading Agencies, Polymers, Biological Resistance, Chemical Resistance, Weathering Resistance.nManufacturing MethodsnFibers, Yarn, Nonwoven Geotextiles, Woven geotextiles, D.S.F. Fabrics.nGeogrids – Testing And EvaluationnFactors Influencing Testing, Sampling, Physical Properties, Mechanical Properties under Uniaxial loading, Creep Testing.nErosion Control With GeogridsnWind Erosion, Rain Water Erosion, Erosion Control Measures, Placement of Geogrid.nBearing Capacity Improvement with GeogridsnAdvantages, Mechanism. Modes of Failure, Friction Coefficient, Experimental Studies.nApplication of Geosynthetics in Water Resources ProjectsnCase Studies: Dharoidam, Hiran II Dam, Meda Creek Irrigation Scheme, Lining of Kakarapar Canal.","reference books":"- Robert M. Koerner, Designing with Geosynthetics, Prentice-Halln- G.V. Rao & G.V.S. Raju, Engineering with Geosynthetics, Tata McGraw-Hilln- Debashis Moitra, Geotechnical Engineering, Universities Press, Edition No. - I, 2016.nCourse Outcome: On completion of this course, the students will be able to: 1 Identify the functions of geosyntheticsn- Select the geosynthetic productsn- Identify the testing methods for geosynthetics 4 Design geosynthetic products"}
