{"course code":"CEPE14","course title":"ROCK MECHANICS","course type":"PE","number of credits":"3","prerequisites":"Knowledge of Engineering Geology and Geotechnical Engineering.","branch":"ce","course learning objectives":"- To understand the problems associated with underground excavationsn- To understand the rock mass classificationn- To understand the failure criteria of rockn- To understand about in-situ stresses from field test datanContentsn- IntroductionnImportance of rock mechanics, composition of rocks, geological and lithological classification of rocks, classification of rocks for engineering purposes, R.Q.D. method of classification of rocks. Theories of Brittle failure.nLaboratory Testing of RocksnVarious methods of obtaining rock cores, methods of sample preparation, methods of removing end friction of the rock samples. Compression testing machine, uniaxial compression strength of rock samples, methods of finding tensile strength-direct and indirect methods, Brazilian test, shear box test, triaxial shear test, punch shear test.nIn-situ Testing of RocksnField direct shear test on rock blocks, field triaxial strength, use of flat jacks, chamber test, plate load test, cable jacking test.nStress Evaluation in FieldnStress-relief technique(over coring), use of strain gauges, bore hole, deformation cell, photo- elastic stress meter, stress measurement with flat jack. Hydraulics Fracturing Techniques.nStabilization of RocksnRock bolting, principle of rock bolting, various types of rock bolts, application of rock bolting. Field testing of rock bolts and cable anchors.nElastic and Dynamic Properties of RocksnStress-strain behaviour dynamic properties, resonance method and ultra-sonic pulse method.nPressure on Roof of TunnelsnTrap door experiment, Terzaghi's theory, Bieraumer, kommerel, Protodyakanov theory.nStress Around the TunnelsnBasic design and Principles of tunnels in rocks, design of pressure tunnels in rocks.","reference books":"- Lama,et.al Rock Mechanics, Vol.I,II,III,IVn- Jaeger and Cook, Fundamentals of Rock Mechanicsn- Stagg & Zienkiewiez, Rock Mechanicsn- Obert & Duvell, Rock Mechanics & Design of Structures in Rocksn- Jaeger, Rock Mechanics & Engineeringn- Schzy, Art of TunnelingnCourse Outcome: On completion of this course, the students will be able to: 1 Identify the problems associated with underground excavationsn2 Classify the rock mass using the reference data 3 Understand the failure criteria of rockn4 Determine in-situ stresses from field test data"}
