{"course code":"CHIR14","course title":"Chemistry (For CS and IT)","number of credits":"3(2L+1T)","prerequisites":"Nil","course type":"EPR","branch":"chem","course learning objectives":"- To introduce the students to basic principles of molecular modelling and applications of computers in chemistryn- To introduce the students to basic principles of batteries, fuel cell construction and the importance of advanced polymers.n- To give the students the knowledge of engineering materials and their applications in industry.","course content":"## UNIT 1nnMolecular ModellingnPotential energy surface: Energy minimisation, geometry optimisation, conformational analysis, global and local minimum determination, approaches and problems, bioactive vs global minima conformations, automated methods of conformation search, advantages and limitations of available softwares. (8 L)nnn## UNIT 2nnEngineering MaterialsnComposite materials: Introduction; different types and applications. Photovoltaic materials: solar cells and dye sensitized solar cells- principle and applications. Nanomaterials:Synthesis, characterization and applications of nano materials (fullerene, graphene, carbon nanotubes and quantum dots) in electronic and nano devices. (8L)nnn## UNIT 3nnBatteriesnPhysical concepts; Introduction to primary, secondary and flow batteries: Zn-AgO, Nickel-metal hydride, Metal-acid and Lithium ion batteries-construction, working principle, operation and applications; Fuel cells: Methanol-Oxygen,solid oxide fuel cell (SOFC) andpolymer electrolyte fuel cell (PEFC)-construction, working principle and applications;Solar battery-working principle and applications. (7L)nnn## UNIT 4nnPolymersnIntroduction to industrially important polymers: Liquid-crystal polymers (LCP), conducting polymers (CP), interpenetrating polymer network (IPN), smart polymers or stimuli-responsive polymers, polymer blends and polymer composites;Conducting Polymers:Methods of synthesis and properties of polyaniline (PANi), polypyrrol (PPy) and polythiophene (PTh); applications of these polymers in advanced technologies. (7L)","course outcomes":"Upon completion of this curriculum:n- Students will be able to understand the principles of molecular modelling and applications of computers in chemistryn- Students will learn the significance and construction of batteries and fuel cellsn- Students will get knowledge in polymers and engineering materials.","reference books":"- Materials Science and Engineering: An introduction: W. D. Callister, Wiley India Pvt. Ltd., New Delhi.n- Engineering Chemistry: P.C. Jain and Monica Jain(16th edition), Dhanpat Rai Publishing Company, New Delhi.n- A Text Book ofEngineering Chemistry: Shashi Chawla(3rd edition), Dhanpat Rai Publishing Company, New Delhi.n- A Text Book ofEngineering Chemistry: S. S. Dara and S. S. Umare(12th edition), S. Chand Publishing Company, New Delhi.n- An Introduction to Composite Materials: D. Hull and T. W. Clyne, Cambridge University Press.n- A Text Book ofEngineering Chemistry: O. G. Palanna(4th reprint 2012), McGraw Hill, New Delhi.n- Principles of Physical chemistry: Puri, Sharma and Pathania, W. H. Freeman and Company.n- Computational Chemistry: Introduction to the Theory and Applications of Molecular and Quantum Mechanics, Errol G. Lewars, Springer 2011.n- Introduction to Computational Chemistry, Frank Jensen, Third Ed. Wiley."}
