{"course code":"CHIR13","course title":"Chemistry (For ECE and EE)","number of credits":"3(2L+1T)","prerequisites":"Nil","course type":"EPR","branch":"chem","course learning objectives":"- To introduce the students to basic principles of batteries, fuel cell construction and the importance of advanced polymers.n- To make the students learn about Importance of nano and advanced materials.n- To introduce the spectroscopy and applications of photochemistry.","course content":"## UNIT 1nnPolymersnIntroduction to industrially important polymers: Liquid-crystal polymers (LCP), conducting polymers (CP), interpenetrating polymer network (IPN), smart polymers or stimuli-responsive polymers, polymer blends and polymer composites;Conducting Polymers:Methods of synthesis and properties of polyaniline (PANi), polypyrrol (PPy) and polythiophene (PTh); applications of these polymers in advanced technologies. (7L)nnn## UNIT 2nnBatteriesnPhysical concepts; Introduction to primary, secondary and flow batteries: Zn-AgO, Nickel-metal hydride, Metal-acid and Lithium ion batteries-construction, working principle, operation and applications; Fuel cells: Methanol-Oxygen,solid oxide fuel cell (SOFC) and polymer electrolyte fuel cell (PEFC)- construction, working principle and applications;Solar battery- working principle and applications. (7L)nnn## UNIT 3nnAdvanced MaterialsnComposite materials: Introduction; different types and applications. Photovoltaic materials: solar cells and dye sensitized solar cells- principle and applications. Nanomaterials:Synthesis, characterization and applications of nano materials (fullerene, graphene, carbon nanotubes and quantum dots) in electronic and nano devices. (8L)nnn## UNIT 4nnPhotochemistry and SpectroscopynPhotochemistry:Introduction; significance;laws governing light absorption; excited states, Jablonski diagram; fluorescence, phosphorescence, chemiluminescence and photosensitisation;applications in light emitting diodes (LED), laser, photodynamic therapy and artificial photosynthesis. (4L)nSpectroscopy: Introduction to atomic spectroscopy and molecular spectroscopy; instrumentation and applications of: Ultra Violet-Visible (UV-Vis), Infrared (IR) and Nuclear Magnetic Resonance (NMR) spectroscopy for material characterization. (4L)","course outcomes":"Upon completing this curriculum:n- Students will learn the significance and applications of industrially important advanced polymers.n- Students will be able to understand the basics of batteries and their working.n- Students will get knowledge in spectroscopic techniques and applications of photochemistry in engineering.","reference books":"- Materials Science and Engineering: An introduction: W. D. Callister, Wiley India Pvt. Ltd., New Delhi.n- Engineering Chemistry: P.C. Jain and Monica Jain(16th edition), Dhanpat Rai Publishing Company, New Delhi.n- A Text Book ofEngineering Chemistry: Shashi Chawla(3rd edition),Dhanpat Rai Publishing Company, New Delhi.n- A Text Book ofEngineering Chemistry: S. S. Dara and S. S. Umare(12th edition), S. Chand Publishing Company, New Delhi.n- An Introduction to Composite Materials: D. Hull and T. W. Clyne, Cambridge University Press.n- A Text Book ofEngineering Chemistry: O. G. Palanna(4th reprint 2012), McGraw Hill, New Delhi.n- Principles of Physical chemistry: Puri, Sharma and Pathania, W. H. Freeman and Company.n- Fundamentals of Molecular Spectroscopy: C. N. Benwell and E. M. McCash, Tata Mcgraw Hill Publishing Co. Ltd., New Delhi."}
