{"course code":"CHIR12","course title":"Chemistry ( For CE, ME and PIE )","number of credits":"3(2L+1T)","prerequisites":"Nil","course type":"EPR","branch":"chem","course learning objectives":"- To enable the students to acquire knowledge of the principles of chemistry for engineering applications.n- To bring adaptability to new developments in engineering chemistry and a knowledge of contemporary issues relevant to engineering.n- To make them apply the knowledge of fundamental chemistry for identification, solution and analysis of complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.","course content":"## UNIT 1nnPolymers & CompositesnPolymers-Polymerization techniques (free radical, ionic and coordination mechanisms); preparation, properties and technical applications of: phenol–formaldehyde resins, elastomers: synthetic rubbers (Buna-S, Buna-N, neoprene), inorganic polymers: silicones, adhesives: epoxy resins; Introduction and applications of conducting polymers (polythiophene, polyaniline) and biodegradable polymers (cellulose acetate, polyhydroxy urethanes) (4L)nComposites-Introduction; Classification and basic requirements of composite materials; different matrix materials with examples: polymer matrix, metal matrix, ceramic matrix, carbon matrix, glass matrix; nano-composites for electrical, superconducting and device applications.n(3L)nnn## UNIT 2nnEngineering Materials & CorrosionnEngineering Materials- High energy materials (HEMs)-Introduction; classification (explosives, propellants, pyrotechnics); requirements of HEM: sensitivity, detonation performance, oxygen balance; Important explosives (structure, preparation, properties): Leadnazide, DDNP, dynamites, TNT, PETN, RDX, and plastic explosives; Cement-Introduction and types of cement; cement composition; setting and hardening of Portland cement. (4L)nCorrosion-Introduction; corrosion mechanisms: dry corrosion and wet corrosion; types of corrosion: concentration/water-line corrosion, stress corrosion (caustic embrittlement in boilers and seasonal cracking), pitting corrosion; factors affecting the rate of corrosion; remedial measures against corrosion: design, cathodic protection, modification of environment, protective coatings (galvanizing and tinning by hot dipping, metal cladding). (4L)nnn## UNIT 3nnFuels and LubricantsnFuels- Introduction; characteristics of good fuel; calorific value (HCV and LCV); determination of HCV by Bomb’s calorimeter; proximate & ultimate analysis of coal; coal liquefaction (Fischer-Tropsch method); coal gasification (water gas); bio-diesel, green diesel and power alcohol. (3L)nLubricants-Introduction; classification; mechanism of lubrication; significant properties of lubricants and their determination (viscosity and viscosity index, cloud and pour point, flash and fire point, aniline point, carbon , acid value, saponification value, iodine value); semi-solid and solid lubricants. (4L)nnn## UNIT4nnWater & Phase RulenWater-Softening of water: zeolite process & demineralization by ion-exchange process; polished water; boiler problems and remedial measures; desalination: advanced reverse osmosis,andelectrodialysis. (4L)nPhase Rule-Description of various terms (phase, component and degrees of freedom); one component system (water and CO2systems); two component system (Pb-Ag, KI-H2O and benzene-water systems); technical applications: freeze drying, solders, safety plugs and freezing mixtures. (4L)","course outcomes":"Upon successful completion of this curriculum students will be able to:n- Gain the basic knowledge of polymers and their applications in day to day life.n- Understand the basic principles of fuels and lubricants.n- Learn the fundamental principles of explosives, energetic properties, their applications in civil as well as military applications and safety standards for their safe use.","reference books":"- Engineering Chemistry: P.C. Jain and Monica Jain(16th edition), Dhanpat Rai Publishing Company, New Delhi.n- A Text Book ofEngineering Chemistry: Shashi Chawla(3rd edition),Dhanpat Rai Publishing Company, New Delhi.n- A Text Book ofEngineering Chemistry: S. S. Dara and S. S. Umare(12th edition), S. Chand Publishing Company, New Delhi.n- Engineering Chemistry: R. Sivakumar and N. Sivakumar, Tata McGraw-Hill Publishing Company Limited, New Delhi.n- An Introduction to Composite Materials: D. Hull and T. W. Clyne, Cambridge University Press.n- A Text Book ofEngineering Chemistry: O. G. Palanna(4th reprint 2012), McGraw Hill, New Delhi.n- Principles of Physical chemistry: Puri, Sharma and Pathania, W. H. Freeman and Company."}
