{"course code":"CSPC24","course title":"Unix and Linux Programming","number of credits":"3","prerequisites":"","course type":"PC","branch":"cs","course content":"Course Learning Objective:n- To introduce the Unix/Linux operating system and shell programming basics.n- Knowledge of Unix/Linux tools for file handling.n- Analysis of C/C++ environment of Unix/Linux and learn basic of Pythan programmingn- Introduction of process manipulation and learning password management for user privileged in Linux.n- Linux Startup and Shell ProgrammingnUser accounts, accessing linux- starting and shutting process, Logging in and Logging out, Command line, simple command, Unix file system: Linux/Unix files, inodes and structure and file system related commands, Shell as command processor, shell variables, creating command substitution, scripts, functions, conditionals, loops, customizingnRegular Expressions and FiltersnIntroducing regular expressions patterns, syntax, character classes, quantifiers, introduction to egrep, sed, programming with awk and perlnThe C/C++ EnvironmentnThe C compiler, vi editor, compiler options, managing projects, memory management, use of makefiles, dependency calculations, memory management- dynamic and static memory, building and using static and dynamic libraries, using ldd, soname, dynamic loader, debugging with gdb, introduction to Pythan programmingnProcesses in LinuxnProcesses, starting and stopping processes, initialization processes, rc and init files, job control- at, batch, cron, time, network files, security, privileges, authentication, password administration, archiving, Signals and signal handlers, Linux I/O system.","reference books":"- Sumitabha Das: Your Unix- The Ultimate Guide, TMH, 2012n- Behrouz A. Forouzan, Richard F. Gilberg: UNIX and Shell Programming, Brooks/Cole-Thomson Learning (CENGAGE Learning, India) , 2009n- John Goerzen: Linux Programming Bible, IDG Books, New Delhi, 2000n- Neil Matthew, Richard Stones: Beginning Linux Programming, Wrox-Shroff, 2007n- Welsh & Kaufmann: Running Linux, O’Reiley & Associates, 2000n- Guido van Rossum: An Introduction to Python, Network Theory Ltd, 2011n- The Python Tutorial Online Book (http://docs.python.org/3/tutorial/index.html)","course outcomes":"(CO’s)n- Able to understand the Unix/Linux operating system, installation procedures, basic utilities command, and basics of shell programming.n- Ability to handle the files or records through various Unix/Linux tools by using regular expression.n- Able to learn C/C++ environment, Makefile, libraries, linking, debugging methodologies and apply the advantages of Pythan programming.n- Able to manipulate the processes and manage the networks securely in Linux."}
