{"course code":"CSPC10","course title":"Digital System Design","number of credits":"3","prerequisites":"","course type":"PC","branch":"cs","course learning objectives":"- To provide the basic knowledge gates, Number Systems and their Arithmetic, Computer Codes, digital logic families, SOP and POS simplifications.n- Ability to design MSI circuits.n- Gain Knowledge about the function of Flip-Flops, Counters, Registers.n- Understanding the concepts of Sequential circuits.","course content":"- Number Systems and CodesnIntroduction to the positional number system, signed magnitude numbers, floating point numbers, binary arithmetic: addition, subtraction, multiplication and division, Base conversion, conversion formulas with examples, one’s and two’s compliment arithmetic, Computer codes – BCD codes, gray codes, excess-3 codes, parity checks, Hamming and alphanumeric codes.nDigital Logic FamiliesnIntroduction to digital ICs, TTL, Schottky TTL, ECL, MOS Logic, CMOS Logic, Tri-state logic: Characteristics and properties.nCombinational Logic DesignnIntroduction, standard representations for logical functions, Karnaugh map representation, simplification of logical functions using K-map, minimization of logical functions specified in minterms/maxterms or Truth Table, minimization of logical functions not specified in minterms/maxterms, Don’t care conditions, design examples, Ex-or and Ex-nor simplification of K-nmaps, five and six-variable K-maps, QM method, MEV method, Introduction of multiplexers and their use in combinational logic design, demultiplexers /decoders and their use in combinational logic design, adders and their use as subtractors, digital comparators, parity generators/checkers, code converters, priority encoders, 7-segment decoder/driver.nSynchronous Sequential Circuits and Asynchronous Sequential CircuitsnIntroduction, FSM model, memory elements and their excitation functions. Synthesis of synchronous sequential circuits, capabilities and limitation of FSM, state equivalence and minimization, simplification of incompletely specified machines, Fundamental mode circuits synthesis, state assignment, pulse mode circuits.","reference books":"- R.P. Jain: Modern Digital Electronics, Tmh.n- Z Kohavi: Switching and Finite Automata Theory, Tmhn- M.M. Mano: Digital Logic Design, Phi.n- Dr. B.R. Gupta: Digital Electronics, Katson.n- James W. Bignell& Robert Donovan: Digital Electronics, Cengage Learning.n- Sanjay Kumar Bose: Digital Systems, New Age International Publishers","course outcomes":"- Understand the basic fundamentals of digital systems.n- Apply fundamental to implement real systems that are useful for the society.n- Understand the basic concept of synthesis of synchronous as well as asynchronous sequential circuits."}
