{"course code":"CSPE77","course title":"Image processing","number of credits":"4","prerequisites":"MAIR12","course type":"PE","branch":"cs","course learning objectives":"Image Processing is a major course in the computer science major, designed to teach students the fundamentals of digital image processing on the computer. The primary objective of this course is to introduce students to basic principles of digital images, image data structures, and image processing algorithms.","course content":"- IntroductionnImage Processing Fourier Transform and Z-Transform, Causality and stability, Toeplit and Circulate Matrics, orthogonal and unitary Matrices and Kroenker product, Markov Processes, KI Transform, Mean square Estimates and Orthogonal PrinciplesnImage sampling & Quantization: Band Limited Image, Sampling Versus Replication, Reconstruction of Image from samples Sampling Theorem, Sampling Theorem for Random Fields, Optimal Sampling, Non-rectangular Grid Sampling, Sampling Aperture, Display Aperture/ Interpolation Functions, Lagrange Interpolation, Moire EffectnImage Quantization: Uniform Optimal Quantizer, Properties of Mean Square Quantizer, Compandor Design, Visual QuantizationnImage TransformsnTwo Dimensional Orthogonal and Unitary Transforms and their properties, One Dimensional and Two Dimensional DFT, Cosine, Sine, Hadamard, SLANT, HAAR and KI Transforms and their properties, Approximation to KI Transforms.nImage representation by stochastic models: One Dimensional Causal Models, AR, ARMA models, Spectral factorization, Non Causal Representation, Image Decomposition.nImage Enhancement and RestorationnPoint Operation, Histogram Modeling, Spatial Operations, Transform Operations, Multispectral Image Enhancement.nImage Filtering: Image Observation Models, Inverse and Wiener filter, FIR Wiener Filters, Filtering using Image Transform, Causal Models and recursive filtering, Maximum entropy restoration, Extrapolation of band limited signal.nImage Analysis and Image CompressionnSpatial feature extraction, Edge detection, Boundary extraction, Boundary representations, Region representations, Moment representations, Structures, Texture, Image Segmentation, Image ClassificationnImage Reconstruction from Projections:nData Compression: Pixel Coding, Predictive Techniques, Transform Coding Theory, Transform coding of Image, Coding of two-tone image.","reference books":"- Anil Jain, Fundamentals of Digital Image Processing, Pearson, 1988.n- Richard E Woods and Rafael C Gonzales, Digital Image Processing, Pearson, 3rd edition, 2009.n- William. K. Pratt, Digital Image Processing, John Wiley & Sons, 4th edition, 2007.","course outcomes":"- Acquire the fundamental concepts of a digital image processing systemn- Apply knowledge of various mathematical tools used for 1D and 2D signal analysis and processingn- Analyze 2D signals in the spatial and frequency domain.n- Design and implement algorithms for digital image processing operations.n- Ability to apply image processing techniques to solve various real time problems.nCSIR30 / CSIR32 – Internship / Project Work"}
