{"course code":"CSPE40","course title":"High Performance Computing","number of credits":"4","prerequisites":"CSPE315","course type":"PE","branch":"cs","course learning objectives":"The objective of course, is to provide a comprehensive introduction to parallel algorithms and parallel programming, with strong emphasis on the design of parallel algorithms and their rigorous analysis. Exposure to parallel programming is provided through programming assignments using MPI. Throughout the course, the design of algorithms is interlaced with the programming techniques useful in coding them.","course content":"- Performance measures: Speedup, efficiency and scalability. Model of parallel computation and basic communication primitives. Parallel prefix and applications, Parallel sorting, Embeddings, Parallel matrix algorithms.n- Communication networks for parallel computers and parallel models of computation, Parallel fast Fourier transforms.n- Parallel Programming with MPI: Writing and executing MPI programs, collective communication, grouping data for communication, communicators and topologies.n- Parallel random number generation, Parallel Octrees, Parallel N-body methods, Parallel Bayesian network construction.nSuggested Books:n- Introduction to Parallel Computing: Design and Analysis of Algorithms by A. Grama, A. Gupta, G. Karypis and V. Kumar.n- Parallel Programming with MPI by Peter S. Pacheco.n- Introduction to High Performance Scientific Computing Victor Eijkhout, Edmond Chow, Robert van de Geijn.","course outcomes":"- Understand in a general sense the architecture of high performance computers.n- Understand how the architecture of high performance computers affects the speed of programs run on HPCs.n- Understand how memory access affects the speed of HPC programs.n- Understand Amdahl’s law for parallel and serial computing.n- Understand the importance of communication overhead in high performance computing.n- Understand some of the general types of parallel computers.n- Understand how different types of problems are best suited for different types of parallel computers.n- Understand some of the practical aspects of message passing on MIMD machines."}
