{"course code":"CSPE24","course title":"Number Theory and Cryptography","number of credits":"4","prerequisites":"","course type":"PE","branch":"cs","course learning objectives":"- To understand Mathematical foundations of Cryptography theory.n- To analyze the robustness of Cryptosystems.n- To design robust cryptosystem for real time applications.n- To develop prototype Cryptosystems and demonstrate their performance.","course content":"- Elementary Number Theory: Divisibility, Division Algorithm, Euclidean Algorithm; Congruences, Complete Residue systems, Reduced Residue systems; Fermat's little theorem, Euler's Generalization, Wilson's Theorem; Chinese Remainder Theorem, Generalized Chinese Remainder Theorem-Euler Phi-function, multiplicative property; Finite Fields, Primitive Roots; Quadratic Residues, Legendre Symbol, Jacobi Symbol; Gauss's lemma, Quadratic Reciprocity Law.n- Primality Testing and Factorization: Primality Tests; Pseudoprimes, Carmichael Numbers; Fermat’s pseudoprimes, Euler pseudoprimes; Factorization by Pollard’s Rho method; Simple Continued Fraction, simple infinite continued fractions; Approximation to irrational numbers using continued fractions; Continued Fraction method for factorization.n- Private Key Cryptosystems: Classical methods: Caesar cipher, Vigenere cipher, one-time pad and others; Block ciphers, Fiestel structure, DES, AES and its security properties; Linear Cryptanalysis, Differential Cryptanalysis; Hash functions: MD5, SHA-1 and its propertiesn- Public Key Cryptosystems: Traditional Cryptosystem, limitations; Public Key Cryptography; Diffie- Hellmann key exchange; Discrete Logarithm problem; One-way functions, Trapdoor functions; RSA cryptosystem; Digital signature schemes; Digital signature standards; RSA signature schemes; Knapsack problem; ElGamal Public Key Cryptosystem; Attacks on RSA cryptosystem: Common modulus attack; Homomorphism attack, timing attack; Forging of digital signatures; Elliptic curve cryptography: Cubic Curves, Singular points, Discriminant; Introduction to Elliptic Curves, Geometry of elliptic curves over reals; point at infinity; Addition of two points; Elliptic Curves over finite fields, ElGamal Public Key Cryptosystem for elliptic curves.nText Books, and/or reference materialn- A Course in Number Theory and Cryptography, Neal Koblitz, (Springer 2006)n- An Introduction to Mathematical Cryptography, Jill Pipher, Jeffrey Hoffstein, Joseph H. Silverman (Springer, 2008)n- An Introduction to theory of numbers, Niven, Zuckerman and Montgomery, (Wiley 2006)n- Elliptic curves: Number theory and cryptography, Lawrence C. Washington, (Chapman & Hall/CRC 2003)n- An Introduction to Cryptography, R.A. Mollin (Chapman & Hall, 2001)n- Rational Points on Elliptic Curves, Silverman and Tate (Springer 2005)n- Guide to elliptic curve cryptography Hankerson, Menezes, Vanstone (Springer, 2004)n- Elementary Number Theory, Jones and Jones (Springer, 1998).","course outcomes":"- To understand Mathematical foundations of Cryptography theory.n- To analyze the robustness of Cryptosystems.n- To design robust cryptosystem for real time applications.n- To develop prototype Cryptosystems and demonstrate their performance."}
