{"course code":"CSPE31","course title":"Software Verification and Validation","number of credits":"4","prerequisites":"CSPC27","course type":"PE","branch":"cs","course learning objectives":"The objectives of the course is to prepare students for learning different techniques of verification and validation of object oriented and web based software.","course content":"- Introduction to Testing & Software Verification [1]nReview of Functional and Structural Testing Techniques- Slice Based testing and Mutation Based testing. Verification methods, SRS document verification, SDD document verification, source code reviews, User document verification, Software project AuditnTest Case Generation & Regression Testing [1]nIntroduction to Use case diagram and use cases, test case generation from Use cases, validity checking and its guidelines, Data validation Strategies, Database Testing.nIntroduction to regression testing, regression test cases selection methods and their management, risk analysis, code coverage prioritization techniquesnObject Oriented Testing [1] [2]nIntroduction to object orientation and testing [1], issues in object oriented testing [2], path testing, state based testing, class testing, integration testing [2], GUI testing [2].nTesting metrics, models & Web Application TestingnIntroduction to software metrics, categorization of metrics, object oriented metrics used in testing, elements to measure during testing, software quality attributes prediction models.nIntroduction to web testing, functional testing, user interface testing, usability testing, configuration and compatibility testing, security testing, performance testing, database testing, post deployment testing, web metrics.","reference books":"- Yogesh Singh, Software Testing, Cambridge Publication, 2013.n- Paul C. Jorgensen, Software Testing- A Craftsman’s Approach, Auerbach Publication, 3rd Edition, 2012.","course outcomes":"On completion of the course, the student will be able to:n- Describe techniques in the areas of software inspection, software testing and software validation.n- Apply different techniques for verification of the software.n- Generate test cases for validation object oriented and web based software."}
