{"course code":"CSPE42","course title":"Human Computer Interaction","number of credits":"4","prerequisites":"","course type":"PE","branch":"cs","course learning objectives":"- Describe and apply core theories, models and methodologies from the field of HCIn- Implement simple graphical user interfacesn- Discuss current research in the field of HCI","course content":"- Introduction, Task-centred system design, User-centred design and prototyping:nHuman-Computer Interaction. Task-centred system design: Task-centered process, development of task examples, evaluation of designs through a task-centered walk-through. User-centred design and prototyping: Assumptions, participatory design, methods for involving the user, prototyping, low fidelity prototypes, medium fidelitynMethods for evaluation of interfaces with users and Psychology of everyday things:nGoals of evaluation, approaches, ethics, introspection, extracting the conceptual model, direct observation, constructive interaction, interviews and questionnaires, continuous evaluation via user feedback and field studies, choosing an evaluation method. Psychology of everyday things: Psychopathology of everyday things, examples, concepts for designing everyday things. Beyond screen design: characteristics of good representations, information visualization, Tufte’s guidelines, visual variables, metaphors, direct manipulationnGraphical screen design, Design principles and usability heuristics:nGraphical design concepts, components of visible language, graphical design by grids. Design principles and usability heuristics: Design principles, principles to support usability, golden rules and heuristics, HCI patternsnHCI design standards, Past and future of HCI:nProcess-oriented standards, product-oriented standards, strengths and limitations of HCI Standards. Past and future of HCI: The past, present and future, perceptual interfaces, context-awareness and perception","reference books":"- Dix A., Finlay J., Abowd G. D. and Beale R., Human Computer Interaction, Pearson Education, 3rd edition, 2005.n- Preece J., Rogers Y., Sharp H., Baniyon D., Holland S. and Carey T. Human Computer Interaction, Addison Wesley, 1st edition, 1994.","course outcomes":"- Understand the basics of human and computational abilities and limitationsn- Understand basic theories, tools and techniques in HCIn- Understand the fundamental aspects of designing and evaluating interfacesn- Practice a variety of simple methods for evaluating the quality of a user interfacen- Apply appropriate HCI techniques to design systems that are usable by people"}
