{"course code":"CSPE20","course title":"Advanced Java Programming","number of credits":"4","prerequisites":"CSIR11, CSPC23","course type":"PE","branch":"cs","course learning objectives":"- How to interact with a relational database using java programming language.n- How to write generic java programs.n- Writing server side programs using java technology.","course content":"- JDBC Architecture, a Relational Database Overview, Processing SQL Statements with JDBC Establishing a Connection, Connecting with DataSource Objects, Handling SQLExceptions, Retrieving and Modifying Values from Result Sets, Using Prepared Statements, Using Transactions, Using RowSet Objectsn- Generics & Collection Framework APIs. Introduction to Design Patterns: the Factory Design Pattern, the Singleton Design Pattern..n- Why use Servlets & JSPs: an introduction to web servers & clients, HTML, HTTP Protocol, HTTP GET and POST requests, HTTP responses. Web App Architecture: high-level overview. A Model- View-Controller (MVC) overview and example, life cycle of a servlet, request & response objects, Init Parameters and ServletConfig, JSP init parameters, Context init parameters, attributes and listeners, session management.n- Create a simple JSP using “out” and a page directive, JSP expressions, variables, and declarations, implicit objects, The Lifecycle and initialization of a JSP, other directives. Scriptless JSP: Standard actions, Expression Language, The EL implicit objects & EL functions, using JSTL.","reference books":"- Dietel & Deitel, Java How to Program, Pearson Education, 10th Ed., 2015.n- Bryan Basham, Kathy Sierra, Bert Bates, Head First Servlets & JSPs , O’REILLY, 2nd Ed., 2008.n- Eric Freeman , Elisabeth Freeman, Kathy Sierra and Bert Bates, Head First Design Patterns, O’REILLY, 1st Ed., 2004.","course outcomes":"- Able to interact with a database using java-programming language.n- Able to write generic programs with the usage of collection framework APIsn- Able to design a web application using various J2EE constructs such as servlets and JSPs."}
