{"course code":"CSPE33","course title":"Embedded System Development","number of credits":"4","prerequisites":"CSPC10, CSPC22, CSPC29","course type":"PE","branch":"cs","course learning objectives":"- Present overview structure of embedded system with pipelining.n- Understand the programming languages for embedded system design.n- Develop an understanding of implementation methodology of Arduino and Rasberry Pi.","course content":"- Intel 8051 Micro controller: Basic differences between Microprocessors and Microcontroller. Introduction to Intel 8051 Microcontroller, architecture, registers, Internal and External Memory. Instruction Set. On Chip Counters / Timers, Serial I/O, Interrupts and their use. Assembly language programming.n- Atmel And PIC Microcontrollers: Introduction to Atmel and PIC C6X microcontrollers, architecture, registers, Internal and External Memory, Instruction Set, On Chip Counters / Timers, Serial I/O, Interrupts and their use. PWM, Watch dog Timer, ISP, IAP features. Assembly language programming.n- ARM7TDMI (Advanced RISC Machines): ARM Architecture, Cortex-M3 Basics, Exceptions, Instruction Sets, NVIC, Interrupt Behaviour, Cortex-M3/M4 Programming, Exception Programming, Memory Protection Unit and other Cortex-M3 features, STM32L15xxx ARM Cortex M3/M4 Microcontroller Memory and Peripherals, Development & Debugging Tools.n- Open Source Embedded Development Board (Arduino): Overview of open source embedded development board (Arduino), block diagram, pins of embedded development board, features of open source tool used for programming a development board, programming of embedded development board, Interface Serial Port with embedded development board, Program Raspberry Pi: a credit-card sized computer, Python programming for Raspberry Pi, Interacting and configuring the RPi OS, Porting of Linux Kernel and booting RPi.nCASE STUDIES: Design of Embedded Systems using the Microcontroller– 8051/ Amtel/ Arduino/ Raspberry Pi, for applications in the area of Communications, Automotives, and industry.","reference books":"- Raj Kumar, “Embedded Systems: Architecture, Programming and Design”, Tata McGraw Hill, Third Reprint, 2003.n- John Catsoulis, O’Reilly, “Designing Embedded Hardware”, First Indian Reprint, 2003.n- David E. Simon, “An Embedded Software Primer”, Pearson Education Asia, Fifth Indian Reprint, 2002.n- Michael Barr, O’Reilly, “Programming Embedded Systems in C and C ++”, 1999.n- J.W. Valvano, “Embedded Microcomputor System: Real Time Interfacing”, Brooks/Cole, 2000.n- Jack Ganssle, “The Art of Designing Embedded Systems”, Newnes, 1999.n- V.K. Madisetti, “VLSI Digital Signal Processing”, IEEE Press (NY, USA), 1995.n- Arduino Cookbook, By Michael Margolis, O’Reilly , 2011.n- Raspberry Pi Assembly Language RASPBIAN Beginners THIRD EDITION, CreateSpace Independent Publishing Platform, 19-Aug-2013.","course outcomes":"- Learn the concept of structure of embedded system.n- Identify the needs of Arduino/Rasberry Pi in real life applications."}
