{"course code":"CSPE46","course title":"Graph theory and Combinatorics","number of credits":"4","prerequisites":"MAIR13","course type":"PE","branch":"cs","course learning objectives":"- To introduce topics and techniques of discrete methods and combinatorial analysis.n- To introduce a large variety of applications and, through some of them, the algorithmic approach to the solution of problems.","course content":"- Graph fundamentals: Walks, paths, directed graphs, knots, cycles, neighborhood, clique, reachability, connectivity, spanning tree, knot detection algorithms.nGraph coloring: Problem and model, greedy and random coloring algorithms, edge coloring, coloring trees, coloring planar and arbitrary graph.n- Graph traversal: Tarry’s traversal algorithm, search algorithms, BFS algorithms and applications, classical and Awerbuch’s DFS algorithm, DFS with neighbor knowledge, spanning tree construction using flooding and DFS, GHS, Awerbuch, Korach-Kutten-Moran MST algorithms and applications, synchronizers.nMatching: Unweighted and weighted matching algorithms, matching from edge coloring.nVertex cover: Unweighted and weighted vertex cover algorithms, pricing algorithm, bipartite matching-based algorithms.n- Routing: Shortest path algorithms, Dijkstra, Bellman-Ford, Floyd-Warshall, Chandi-Misra algorithms, Johnson’s algorithm, link state, distance vector, and interval routing algorithms, maximum flow, Ford- Fulkerson method, maximum bipartite matching, push-relabel algorithm, relabel-to-front algorithm. Maximal Independent Set (MIS): Rank-based MIS algorithms, Luby’s MIS algorithm, MIS construction from vertex coloring.nDomination algorithms: Greedy MDS algorithms, Guha-Khuller algorithm, connected dominating sets, MIS-based and pruning-based algorithms, weakly connected dominating sets.n- Network Algorithms: Network analysis, vertex degrees, degree distribution, degree correlation, distance statistics, clustering coefficient, local and global view, centrality, Topology control.nSuggested Books:n- Douglas B. West, Introduction to Graph Theory, PHI.n- David Avis, Alain Hertz, Odile Marcotte (Eds.), Graph Theory and Combinatorial Optimization, Springer.n- Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein, Introduction to Algorithms, PHI.n- Sukumar Ghosh, Distributed Systems: An Algorithmic Approach, 2/EChapman & Hall/CRC.n- KayhanErciyes, Distributed Graph Algorithms for Computer Networks, Springer. Yvonne-Anne Pignolet, Thomas Locher, Roger Wattenhofer, Principles of Distributedn- Computing, Available online.n- Herbert S. Wilf, Algorithms and Complexity, Available online.n- Michel Raynal, Distributed Algorithms for Message-Passing Systems, Springer.n- Nancy Lynch, Distributed Algorithms, Morgan Kaufmann.n- Gerard Tel, Introduction to Distributed Algorithms, Cambridge Univ. PressnCourse Outcome:n- Able to apply knowledge of Discrete Mathematics to model computer networks.n- Design distributed graph algorithms for complex networks.n- Analyze the performance of various graph algorithms and evaluate the scalability of solutions for large and heterogeneous networks.n- Adapt conventional graph algorithms to ad hoc networks and use knowledge of mathematics to sketch proofn- Simulate the algorithms in wireless environment.nOpen Elective – I"}
