{"course code":"CSPE44","course title":"Compiler Design","number of credits":"4","prerequisites":"CSPC37","course type":"PE","branch":"cs","course learning objectives":"The objective of this course is to give students a clear understanding of the major concept areas of language translation and to enrich the knowledge in various phases of compiler and its use, parsing techniques, code optimization techniques, machine code generation, and use of symbol table.","course content":"- Introduction and types of translators, the structure of a compiler, design of lexical analyzer,specification & implementation of lexical analyzer. Parsers, shift-reduce parsing, operator- precedence parsing, top-down parsing, recursive descent parsing, predictive parsers.n- LR Parsers, the canonical collection of L R (O) items, construction of SLR parsing tables, constructing canonical L.R. Parsing tables, Constructing LALR parsing tables, implementation of L R Parsing tables Syntax-directed translation schemes, implementation of syntax directed translators, intermediate code, postfix notation, parse trees and syntax trees, three address code, quadruples, and triples, translation of assignment statements, Boolean expressions, control statements.n- The contents of a symbol table, data structures for symbol tables, representing scope information. Implementation of a simple stack allocation scheme, implementation of block structured languages, storage allocation in block structured language. Error-lexical phase errors, syntactic phase errors, semantic errors.n- The principle sources of optimization, loop optimization, the DAG representation of basic blocks, value number and algebraic laws, global data-flow analysis. Object programs, problems in code generation, a machine model, a simple code generator, register allocation and assignment, code generation from DAGs, peephole optimization.","reference books":"- Aho A.V. and Ullman J.D. Principles of Compiler Design, Addison Wesley.n- Donovan, J, System Programming, TMH.n- D.M. Dhamdhere: Compiler Construction-Principles and Practice McMillan India.n- David Gries: Compiler Construction for Digital Computer.","course outcomes":"- Learn the fundamentals of language translator and compiler design.n- Ability to design algorithms for Parsers (Top-down and Bottom-Up).n- Classify and discuss intermediate code generation and optimization techniques to improve the performance of a programn- Gain knowledge of techniques of symbol table organization, fundamentals of runtime environment and Code generation."}
