{"course code":"CSPE45","course title":"Computer Vision","number of credits":"4","prerequisites":"MAIR13, CSPC11","course type":"PE","branch":"cs","course learning objectives":"- Be familiar with both the theoretical and practical aspects of computing with images;n- Have described the foundation of image formation, measurement, and analysis;n- Have implemented common methods for robust image matching and alignment;n- Understand the geometric relationships between 2D images and the 3D world.n- Have gained exposure to object and scene recognition and categorization from images;n- Able to develop the practical skills necessary to build computer vision applications.","course content":"- Digital Image Formation and low-level processingnOverview and State-of-the-art, Fundamentals of Image Formation, Transformation: Orthogonal, Euclidean, Affine, Projective, etc; Fourier Transform, Convolution and Filtering, Image Enhancement, Restoration, Histogram Processing.nFeature ExtractionnEdges - Canny, LOG, DOG; Line detectors (Hough Transform), Corners - Harris and Hessian Affine, Orientation Histogram, SIFT, SURF, HOG, GLOH, Scale-Space Analysis- Image Pyramids and Gaussian derivative filters, Gabor Filters and DWT.nShape Representation, Segmentation and Object RecognitionnShape Representation and Segmentation, Deformable curves and surfaces, Snakes and active contours, Level set representations, Fourier and Wavelet Descriptors, Medial Representationsn,Multiresolution analysis, Hough transforms and other simple object recognition Methods, Shape Correspondence and Shape Matching, Shape priors for recognition.nMotion EstimationnRegularization Theory, Optical Computation, Stereo Vision, Motion Estimation, Structure from Motion.","reference books":"- Richard Szeliski, Computer Vision: Algorithms and Applications, Springer-Verlag London Limited 2011.n- Computer Vision: A Modern Approach, D. A. Forsyth, J. Ponce, Pearson Education, 2003.n- Richard Hartley and Andrew Zisserman, Multiple View Geometry in Computer Vision, Second Edition, Cambridge University Press, March 2004.n- K. Fukunaga; Introduction to Statistical Pattern Recognition, Second Edition, Academic Press, Morgan Kaufmann, 1990.n- R.C. Gonzalez and R.E. Woods, Digital Image Processing, Addison- Wesley, 1992.nJournalsn- IEEE-T-PAMI (IEEE Transactions on Pattern Analysis and Machine Intelligence).n- IJCV (International Journal of Computer Vision) - Springer.nCourse Outcome:n- Able to demonstrate knowledge and understanding of Human and computer vision systems.n- Understand current approaches to image formation and image modeling.n- Analyze and design a range of algorithms for image processing and computer visionn- Develop and evaluate solutions to problems in computer vision"}
