{"course code":"CSPE60","course title":"Stochastic Processes and Queuing Theory","number of credits":"4","prerequisites":"MAIR13","course type":"PE","branch":"cs","course learning objectives":"- It provides an essential base for mathematical modelling which is normally used to solve the problems of pattern recognition and machine learning.n- It is used in the research of various science and engineering problem.","course content":"- Random variables, Functions of random variables, joint1y distributed random variables. Expectation, Expectation of functions of more than one random variable, Covariance and Correlation, Auto and Cross Correlation, Correlation Co-efficient, Parameter Estimation – Maximum Likelihood Estimation and Maximum a Posteriori.n- Stochastic Processes, Classification of stochastic processes, Stationary Random Processes- First order, second order and nth order, Strict sense stationary process, Ergodic Process, the Bernoulli process, The Poisson process, Renewal process, Advanced Renewal Theory, Renewal Function, Alternating Renewal Processes .n- Markov Chains, Computation of n-step transition probabilities, Chapman-Kolmogorov theorem, Classification of states of a Markov Chain, Distribution of times between state changes, Irreducible finite chains with aperiodic states, Birth and Death processes, Pure Birth Process, Pure Death Process, Non-Birth-Death Processes, Analysis of program execution time..n- Introduction to Queuing Theory, General Queuing, Components of a queuing system, Deterministic Queues, (M/M/1):(∞/FIFO)-Single server with infinite capacity, Extension to (M/M/2): (∞/FIFO), (M/M/k) : (∞/FIFO)- Multiple server with infinite capacity, Engset Loss Formula, M/G/1 queuing system, M/G/1 with non-FIFO disciplines, M/G/∞, Queues with time-varying arrival rate.","reference books":"- A. Populis and S.U. Pillai, “Probability, Random Variables, and Stochastic Process”, 4th Edition, McGraw-Hill.n- S. Palaniammal, “Probability and Queueing theory.” Prentice Hall of India.n- V. Sundarapandian, “Probability, Statistics and Queueing Theory.” Prentice Hall of India.","course outcomes":"- Develop an understanding to the basic concepts of Random Processes, Expectations and Parameter Estimation.n- Able to understand and apply the Stochastic processes to Science and Engineering problems and applications.n- Able to calculate the n-step transition probabilities for any Markov chain and understand about the birth and death of processes.n- Able to apply Markov chain & Birth Death process to real life problems.n- Develop an understanding of various Queuing Systems."}
