{"course code":"ECOE71","course title":"Introduction To CommunicationnEngineering","number of credits":"3","prerequisites":"ECIR11","course type":"OE","branch":"ec","course learning objectives":"To familiarize the students with the evolution and basics of communication engineering and their applications. The student should also be able to explain a transmission line, do transmission line calculations using smith chart. The students should be able to name the basic elements of optical fiber transmission link, describe fiber modes and different types of fibers and their losses.","course content":"## UNIT InnANALOG COMMUNICATION: Basic constituents of Communication System, Amplitude modulation, modulation index, DSBSC modulation, SSB modulation, vestigial side band modulation, Angle modulation, frequency and phase modulation spectrum of FM Wave, modulation index and Band width of FM Signal, NBFM and WBFM, Transmitter and Receiver, Classification of radio transmitters, Classification of radio receivers, NOISE, Classification of noise, various sources of noise.nnn## UNIT IInnDIGITAL COMMUNICATION: Pulse Modulation, PAM, PPM, PCM, PWM, DM, Baseband Pulse transmission, Matched filter and its properties, average probability of symbol error in binary enclosed PCM receiver, Intersymbol interference, Digital pass band transmission, Gram Schmidt orthogonalization procedure, geometric Interpretation of signals, Hierarchy of digital modulation techniques, BPSK, DPSK, DEPSK, QPSK, systems; ASK, FSK, QASK, Many FSK, MSK, Spread spectrum modulation, Pseudonoise sequence, A notion of spread spectrum, direct sequence spread spectrum with coherent BPSK.nnn## UNIT IIInnPROPAGATION OF RADIO WAVES AND WAVEGUIDES: Different modes ofnpropagation, Ground waves, Space waves, Surface waves and Tropospheric waves, Ionosphere, Wave propagation in the ionosphere, Transmission line equations, graphical methods, Smith chart, Time domain and frequency domain analysis, TE, TM and TEM waves, TE and TM modes in rectangular and Circular wave guides.nnn## UNIT IVnnOPTICAL COMMUNICATION: Propagation within the fiber, Numerical aperture of fiber, diffraction, step index and graded index fiber, Modes of propagation in the fiber, Single mode and multi mode fibers, Losses in Optical Fiber, Rayleigh Scattering Losses, Absorption Losses, Leaky modes, mode coupling losses, Bending Losses, Combined Losses in the fiber.","reference books":"- E.C.Jordan and K.G.Balmain, Electromagnetic Waves and Radiating Systems, PHI, 2nd Edition, 2000.n- Simon Haykin, Communication Systems, John Wiley, 5th Edition, 2009.n- John G. Proakis, Digital Communication, PHI, 4th Edition, 2003.n- John Gowar, Optical Communication Systems, Prentice Hall, 2nd Edition, 1993.","course outcomes":"At the end of the course, student will be able to;n- Acquire knowledge about analog communication.n- Learn the basics of digital communication.n- Understand Pulse modulation and its types.n- Classify various types of radio transmitters and radio receivers.n- Tell various types of waves and their propagation.n- Acquire knowledge of fiber, its various modes and losses."}
