{"course code":"ECOE51","course title":"Signal Analysis","number of credits":"3","prerequisites":"MAIR11","course type":"OE","branch":"ec","course learning objectives":"To understand continuous time and discrete time signals, Fourier series representation of CTPS, Continuous Time Fourier Transform, Z- transform and its properties.","course content":"## UNIT InnINTRODUCTION TO SIGNAL: Continuous time and discrete time signals, Even and Odd signals. Elementary continuous time and discrete time signals. Classification of signals, causality; stability, time invariance, linearity. Continuous time and Discrete time LTI Systems, convolution Integral and convolution sum, Properties of LTI Systems. Differential and Difference equations.nnn## UNIT IInnFOURIER SERIES AND LTI SYSTEMS: Fourier series representation of CTPS, convergence of FS. Properties of CTFS. Fourier series representation of DTPS. Properties of DTFS. Fourier series and LTI Systems. Filtering, RC low pass and high pass filters. Recursive and Non recursive Discrete Time filters.nSampling theorem, sampling of continuous time signal with impulse train. Aliasing, Discrete-time processing of continuous time signals.nnn## UNIT IIInnFOURIER TRANSFORM: Continuous Time Fourier Transform (CTFT), Convergence of FT. Properties of CTFT. Discrete time Fourier Transform (DTFT). Properties of DTFT. Systems characterized by Linear constant co-efficient differential equation and difference equations. Magnitude and phase spectrum, group delay.nnn## UNIT IVnnZ-TRANSFORM: Z- transform and its properties, poles and zeros, Inversion of Z-transform, One sided Z-transform and solution of differential equations. Analysis of LTI systems in Z-domain, causality, stability, Relationship between Z-transform and Fourier transform. Frequency selective filters; all pass filters, minimum-phase, maximum-phase and mixed-phase systems.","reference books":"- Oppenheim Willsky and Nawab, Signals and Systems, PHI. 3rd Ed.n- Simon Haykin , Signals and Systems, John Wiley, 3rd Ed.n- Taub and Schilling, Principles of Communication Systems, TMH, 3rd Ed..","course outcomes":"- Utilize the concepts of Discrete time and Continuous time signals and their transformations.n- Analyze the Fourier series of periodic and Fourier transform of non-periodic discrete time and continuous time signals.n- Understand and apply the concepts of bandwidth and filters and Bode plots. 4 Apply the Laplace transform for various applications.n- Represent continuous time and discrete time systems in the Frequency domain using Fourier analysis tools like CTFS, CTFT, DTFS and DTFT.n- Understand and apply the concept of Z transform."}
