{"course code":"ECOE-50","course title":"Electronics Engineering","number of credits":"3","prerequisites":"None","course type":"OE","branch":"ec","course learning objectives":"To familiarize the students with Boolean algebra, combinational and sequential circuits, counters, various types of semiconductors and their applications and analyse 555 Timer, PLL, various IC applications. The students should be able to define amplifier and oscillators and various types of transistors.","course content":"## UNIT InnDIGITAL ELECTRONICS: Introduction to Boolean Algebra, Electronic Implementation of Boolean Operations, Gates-Functional Block Approach, Combinational and Sequential Circuits, Storage elements-Flip Flops-A Functional block approach, Counters: Ripple, Up/down and decade, shift registers.nnn## UNIT IInnSEMICONDUCTOR DEVICES AND APPLICATIONS: Elemental and compound semiconductors, Energy band model, Intrinsic and Extrinsic semiconductors, pn junctions diode, V-I characteristic of an ideal diode, Zener and Avalanche Breakdown, Half Wave, Full Wave and Bridge rectifier, varactor, BJT, JFET, MOSFET, Op-amp.nnn## UNIT IIInnAMPLIFIERS AND OSCILLATORS: Power amplifiers, JFET and MOSFET parameters, JFET and MOSFET amplifiers: Feedback in amplifiers:Basic feedback topologies .Oscillators : Barkhausen criterion, Sinusoidal Oscillators, the phase-shift oscillator, resonant circuit Oscillators, a general form of oscillator circuit, the Wein -bridge oscillator, crystal oscillatorsnnn## UNIT IVnnLINEAR IC APPLICATIONS: Universal active filter, switched capacitor filter, 555 timer, PLL.","reference books":"- B.G.Streetman, Semiconductor Devices, PHI, 6th Edition, 2013.n- R. Tocci & N. Widmer, Digital Systems, Pearson, 12th Edition, 2016.n- R.A. Gayakwaed, OP-amps and Linear Integrated circuits, PHI, 4th Edition, 2004.n- Sedra & Smith, Microelectronic Circuits, Oxford University Press, 4th Edition, 2003.","course outcomes":"At the end of the course, student will be able to;n- Acquire the knowledge of basics of Digital Electronics.n- Distinguish various types of semiconductors and their applications.n- Understand various types of transistors.n- Elaborate various linear IC applications.n- Understand various types of amplifiers and feedback in amplifiers.n- Design and analyze various types of oscillators."}
