{"course code":"ECOE81","course title":"Sensor Technology","number of credits":"3","prerequisites":"ECPE70","course type":"OE","branch":"ec","course learning objectives":"Course will provide the understanding of the right sensors for a given application and desi gn basic circuit building blocks. Also help to simulate, synthesize, and layout a complete sensor and sensor system.","course content":"## Unit InnPrinciples of Sensing, Classification and Terminology of Sensors, Measurands. Sensors ty pes and classification – mechanical, acoustic, magnetic, thermal, chemical, radiation and b iosensors.nnn## Unit IInnPHYSICAL PRINCIPLE OF SENSING: Electric charges, field and potential, capacita nce, magnetism and induction, resistance, piezeoelectric effect, hall effect, temperature an d thermal properties of materials, heat transfer, light, dynamic models of sensor elements.nnn## Unit IIInnWireless Sensors and its applications, Modeling and simulation of microsensors and actu ators, Sensors and smart structures. Micro-opto-electro-mechanical sensors and system, In terworking with IoT.nnn## Unit IVnnSENSORS IN DIFFERENT APPLICATION AREAS: occupancy and motion detector s, position displacement and level, velocity and acceleration, force, strain and tactile senso rs, pressure sensors and temperature sensors.","reference books":"- J. Fraden, Handbook of Modern Sensors:Physical, Designs, and Applications, AIP Press, Springer.n- Sze S.M “Semiconductor Sensors”, John Wiley, New York, 1994.n- Ristic L,“Sensor Technology and Devices”, Artech House, London, 1994.n- Gerard Meijer, Kofi Makinwa, “Smart Sensor Systems: Emerging Technologies and Applications”, ISBN: 978-0-470-68600-3,April 2014.","course outcomes":"- understand the concept of sensors and its characteristics.n- understand the practical approach in design of technology based on different sensorsn- learn various sensor materials and technology used in designing sensorsn- synthesis and analyze wireless sensors for advanced applicationsn- understand the software and hardware designing aspects of sensors co-existing with other systemsn- propose new applications for sensors.nElectronics & Communication Engineering DepartmentnLAB COURSES"}
