{"course code":"ECOE72","course title":"VHDL","number of credits":"03","prerequisites":"ECPC34","course type":"OE","branch":"ec","course learning objectives":"To enable the students to design digital circuits in VHDL.","course content":"## UNIT InnINTRODUCTION: Introduction to VHDL, Hardware design construction.nPROGRAMMABLE LOGIC DEVICES : Introduction to programmable logic device, Architectures, Characteristics of PLDs, CPLDs and FPGAs.nBEHAVIORAL MODELING: Entity declaration, architecture body, process statement, variable assignment, signal assignment. Inertial and transport delays, Simulation deltas, Signal drivers.nnn## UNIT IInnDATA FLOW AND STRUCTURAL MODELLING: Concurrent signal assignment, sequential signal assignment, Multiple drivers, conditional signal assignment, selected signal assignment, block statements, concurrent assertion statement, component declaration, component instantiation.nnn## UNIT IIInnGENERICS AND CONFIGURATIONS: Configurations. Generics in configuration. Generic value specification in architecture, block configurations, architecture configurations.nSUBPROGRAMS AND PACKAGES: Subprograms – functions, procedures, declarations. Package declarations, package body, use clause, predefinal package standard. Design libraries, design file.nnn## UNIT IVnnADVANCED TOPICS: Digital design using FSM, Generate Statements, Aliases, Qualified expressions, Type conversions, Guarded signals, User defined attributes, Predefined attributes., VHDL synthesis.","reference books":"- D. Perry , VHDL: Programming by Example, McGraw-Hill Education; 4th Edition 2002.n- J. Bhasker, A.VHDL- Primer, Phi Learning, 3rd Edition, 2009.n- K. Skahil, VHDL for Programmable logic, Pearson Education India; 1st Edition 2006.","course outcomes":"At the end of the course student will be able ton- Understand various programmable logic devices and EDA tools.n- Understand the behavioral modeling.n- Understand the data flow and structural modelling.n- Understand modeling styles in VHDL and to design digital systems.n- Understand generics and configurations VHDL.n- Understand advanced topics in VHDL."}
