{"course code":"ECOE70","course title":"Cellular Mobile Communication","number of credits":"3","prerequisites":"ECPC35, ECPC32 and ECPC53","course type":"OE","branch":"ec","course learning objectives":"To understand the cellular concept, small scale and large scale fading, diversity reception and different types of multiple access techniques","course content":"## UNIT InnCELLULAR SYSTEM: Hexagonal geometry cell and concept of frequency reuse, Channel Assignment Strategies, Distance to frequency reuse ratio, Channel & co-channel interference reduction factor, S/I ratio consideration and calculation for Minimum Co-channel and adjacent interference, Handoff Strategies, Umbrella Cell Concept, Trunking and Grade of Service, Improving Coverage & Capacity in Cellular System-cell splitting, Cell Sectorization, Repeaters, Micro cell zone concept, Channel antenna system design considerations.nnn## UNIT IInnLARGE SCALE PATH LOSS: Free Space Propagation loss equation, Path-loss of NLOS and LOS systems, Reflection, Ray ground reflection model, Diffraction, Scattering, Link budget design, Max. Distance Coverage formula, Empirical formula for path loss, Indoor and outdoor propagation models.nnn## UNIT IIInnSMALL SCALE FADING: Small scale multipath propagation, Impulse model for multipath channel, Delay spread, Feher’s delay spread, upper bound Small scale, Multipath measurement parameters of multipath channels, Types of small scale fading, Rayleigh and Rician distribution, Diversity techniques in brief.nnn## UNIT IVnnACCESS TECHNIQUES: Introduction and comparisons of various multiple access strategies- TDMA, CDMA, FDMA, OFDM, CSMA and modulation schemes for wireless communication.","reference books":"- Theodore S. Rappaport, Wireless Communications Principles and Practice, 2nd Edition, Prentice Hall.n- Kamilo Feher, Wireless Digital Communications, Modernization & Spread Spectrum Applications, Prentice Hall.n- KavehPahlavan and Allen H. Levesque, Wireless Information Networks, John Wiley and Sons Inc.","course outcomes":"At the end of the course student will be able to …n- Apply and analyze the concepts of cellular systemn- Understand the different techniques for capacity enhancement of a cellular systemn- Compute path loss using various path loss modelsn- Understand and analyze small and large scale fadingn- Compare the various multiple access techniquesn- Understand the basics of propagation of radio signalsnINTRODUCTION TO COMMUNICATION ENGINEERING"}
