{"course code":"ECOE80","course title":"MICROCONTROLLERS","number of credits":"03","prerequisites":"ECPC34","course type":"OE","branch":"ec","course learning objectives":"Course will provide the understanding of the difference between microprocessor and microcontroller and basics of embedded System. Students will be able to apply the principles of logic design in understanding architecture and memory organization, understand different peripherals and their interfacing concepts with microcontroller.","course content":"## UNIT InnINTRODUCTION: Comparing Microprocessors and Microcontrollers. Technological trends in Microcontrollers development, Survey of microcontrollers- 4 bit, 8 bit, 16 bit, 32 bit microcontrollers, Applications of microcontrollers.nnn## UNIT IInn8051 ARCHITECTURE: Block diagram, pin diagram of 8051. Functional descriptions of internal units, registers, PSW, internal RAM, ROM, Stack, Oscillator and Clock. I/O Pins, Ports and Circuits Connecting external memory, Counters and timers. Serial data interrupt. Serial data transmission/reception and transmission modes, Timer flag interrupt. External interrupt, software generated interrupts. External memory and memory space decoding, expanding I/Os, memory mapped I/O Reset & CLK Circuits.nnn## UNIT IIInn8051 INSTRUCTION SET AND PROGRAMMING: 8051 Instruction syntax, addressing modes, Data transfer instructions, logical instructions, arithmetic instructions, Jump and Call instructions. Interrupts and interrupt handler subroutines, Writing assembly Language programs, Time delays, Pure S/W time delays. S/W polled timer, Pure H/W delay. Lookup tables, Serial data transmission using time delays and polling. Interrupt driven serial transmission and reception.nnn## UNIT IVnn8051 APPLICATIONS: Interfacing Keyboards Programs for small keyboards and matrix keyboards. Interfacing multiplexed displays, numeric displays and LCD displays, Measuringnfrequency and pulse width, Interfacing ADCs & DACs. Hardware circuits for handling multiple interrupts, 8051 Serial data communication modes- Mode 0, Mode 1, Mode 2 and Mode 3.","reference books":"- K. J. Ayala, The 8051 Microcontroller – 2nd ed. Penram International.n- Intel’s manual on “Embedded Microcontrollers”","course outcomes":"At the end of the course student will be able ton- apply knowledge of mathematics, engineering to understand concepts in microcontroller based system.n2: analyze a problem and formulate appropriate computing solution for microcontroller based applications.n3: design experiments in microcontrollers analyze computer based process to meet desired needsn4: work, document and present as an individual and as a team-member to design formulate and implement experiments using modern tools.n5: Select appropriate microcontroller for different application.n6: Write and execute assembly language programs (software) for given application"}
