{"course code":"ECPC51","course title":"Antenna And Wave Propagation","number of credits":"4","prerequisites":"ECPC31","course type":"PC","branch":"ec","course learning objectives":"By the end of this course the student should be able to describe the evolution and basics of Antenna and Wave propagation technology. Student should be able to identify antenna parameters of Linear wire antennas, Aperture type antennas, Antenna Arrays, Narrowband, Broadband and Frequency independent antennas","course content":"## UNIT InnBASIC PRINCIPLES AND DEFINITIONS: Retarded vector and scalar potentials. Radiation and induction fields, Radiation from elementary dipole (Hertzian dipole, short dipole, Linear current distribution), half wave dipole, Antenna parameters : Radiation resistance, Radiation pattern, Beam width, Gain, Directivity, Effective height, Effective aperture, Polarization, Bandwidth and Antenna Temperature.nnn## UNIT IInnRADIATING WIRE STRUCTURES AND ANTENNA ARRAYS: Folded dipole, Monopole,nBiconical Antenna, Loop Antenna, Helical Antenna. Principle of pattern multiplication, Broadside arrays, Endfire arrays, Array pattern synthesis, Uniform Array, Binomial Array, Chebyshev Array, Antennas for receiving and transmitting TV Signals e.g. Yagi-Uda and Turnstile Antennas. Printed antennas.nnn## UNIT IIInnAPERTURE TYPE ANTENNAS: Radiation from rectangular aperture, E-plane Horns, H-plane Horns, Pyramidal Horn, Lens Antenna, Reflector Antennas and Slot Antennas.nBROADBAND AND FREQUENCY INDEPENDENT ANTENNAS: Broadband Antennas. Thenfrequency independent concept: Rumsey’s principle, Frequency independent planar log spiral antenna, Frequency independent conical spiral antenna and Log periodic antenna.nnn## UNIT IVnnPROPAGATION OF RADIO WAVES : Different modes of propagation, Ground waves, Space waves, Surface waves and Tropospheric waves, Ionosphere, Wave propagation in the ionosphere, Critical frequency, Maximum Usable Frequency (MUF), Skip distance, Virtual height, Radio noise of terrestrial and extra terrestrial origin. Multipath fading of radio waves.","reference books":"- John D. Kraus, Antennas, McGraw Hill. 4th Ed. 2010 , Mc Graw Hilln- C. A Balanis Antenna theory Analysis & Design 3rd Ed. 2005 ,Wiley & Sonsn- E. C. Jordan and K. G. Balmain, Electromagnetic Waves and Radiating Systems, PHI","course outcomes":"At the end of the course student will be able to…n- Develop an understanding of the design features of various Antenna Types and their familiesn- Understand the fundamentals and modes of wave propagationn- Differentiate and deploy Broadband and Narrowband Antennas with characteristic radiation patterns.n- Use mathematical analysis and tools to simulate Antenna signals for transmission and reception.n- Quantify the fields radiated by various types of antenna.n- Plot the characteristics of wire and aperture antennas."}
