{"course code":"ECPC42","course title":"Microprocessor And Microcontroller","number of credits":"03","prerequisites":"ECPC34","course type":"PC","branch":"ec","course learning objectives":"To learn importance of microprocessors and microcontrollers, understand architecture and programming of 8086 processors, interfacing techniques like memory and I/O Interfacing with microprocessor and microcontroller.","course content":"## UNIT InnINTRODUCTION TO MICROPROCESSOR AND MICROCONTROLLER: Evolutionnof microprocessors, technological trends in microprocessor development, The Intel family tree, applications of Microprocessors.nINTRODUCTION TO 16-BIT MICROPROCESSOR ARCHITECTURE:n: 8086 Block diagram; description of data registers, address registers; pointer and index registers, PSW, Queue, BIU and EU, 8086 Pin diagram descriptions. Microprocessor BUS types and buffering techniques, 8086 minimum mode and maximum mode CPU module. 8086 CPU Read/Write timing diagrams in minimum mode and maximum mode.nnn## UNIT IInn8086 INSTRUCTION SET: Instruction formats, addressing modes, Data transfer instructions, string instructions, logical instructions, arithmetic instructions, transfer of control instructions; process control instructions; Assembler directives, writing assembly Language programs for logical processing, arithmetic processing, timing delays; loops, data conversions, Writing procedures; Data tables, modular programming, Macros.nnn## UNIT IIInnINTERFACING AND PROGRAMMABLE DEVICES: Basic interfacing concepts and address decoding techniques., Interfacing output displays, memory, D/A & A/D converters, Programmable interval timer, programmable peripheral interface 8255.nINTERRUPTS AND DMA: Interrupt driven I/O. 8086 Interrupt mechanism; interrupt types and interrupt vector table, Programmable interrupt controller 8259, programmable DMA controller 8237.nnn## UNIT IVnnINTRODUCTION TO MICRO CONTROLLERS (8051): Micro controllers & Embedded processors, Overview of 8051 family, Instruction set, Introduction to 8051 assembly language programming, Program counter, data types & directives, flag, Registers, Stack, Hardware Description, I/O Port programming, Timer and counter programming, Serial communication, Interrupt programming, Interfacing, 16 & 32 bit micro controllers, PIC and ARM controllers","reference books":"- D.V.Hall , Microprocessors and Interfacing , McGraw Hill 2nd ed.n- M A Mazidi, J G Mazidi, R D Mc Kinlay “The 8051 Micro controllers & Embedded Systems”, 2nd Indian reprint, Pearson education, (2002).n- J Uffenbeck , The 8086/8088 family, (PHI).n- Liu,Gibson , Microcomputer Systems – The 8086/8088 family, (2nd Ed-PHI).n- Kenneth J, Ayala, “8051 Microcontroller: Architecture, Programming and Application,” 2nd edition, Delmar Learning.n- John Morton “The PIC Microcontroller: Your Personal Introductory Course”, Newnes (an imprint of Butterworth-Heinemann Ltd); 3rd Revised Edition (2005).","course outcomes":"At the end of the course, the student will be able to:n- Develop the basic understanding of 16-bit microprocessor architecture.n- Program a microprocessor system using assembly language.n- Understand and capable of interfacing the microprocessor to the I/O devices.n- Develop simple applications on microprocessor and microcontroller -based systems. 5: Interpret specifications for any microprocessor or peripheral chip.n6: Use compilers and assemblers from open source, third party, and microprocessor/ microcontroller providers"}
