{"course code":"ECPC12","course title":"Signals And Systems","number of credits":"04","prerequisites":"MAIR11","course type":"PC","branch":"ec","course learning objectives":"To understand LTI systems, analysis of periodic signals, analysis of aperiodic signals, Laplace transform.","course content":"## UNIT InnLTI SYSTEMS: Continuous time and discrete time signals, Even and Odd signals. Elementary continuous time and discrete time signals. Classification of signals, causality; stability, time invariance, linearity. Continuous time and Discrete time LTI Systems, convolution Integral and convolution sum, Properties of LTI Systems. Differential and Difference equations. Singularity functions.nnn## UNIT IInnANALYSIS OF PERIODIC SIGNALS: Fourier series representation of CTPS, convergence of FS. Properties of CTFS. Fourier series representation of DTPS. Properties of DTFS. Fourier series and LTI Systems. Filtering, RC low pass and high pass filters. Recursive and Non recursive Discrete Time filters.nSampling theorem, sampling of continuous time signal with impulse train. Aliasing, Discrete-time processing of continuous time signals.nnn## UNIT IIInnANALYSIS OF APERIODIC SIGNALS: Continuous Time Fourier Transform (CTFT), Convergence of FT. Properties of CTFT. Discrete time Fourier Transform (DTFT). Properties of DTFT. Systems characterized by Linear constant co-efficient differential equation and difference equations. Magnitude and phase spectrum, group delay.nnn## UNIT IVnnLAPLACE TRANSFORM: The Laplace transform; Region of convergence for Laplace transform, Inverse Laplace transform. Geometric evaluation of Fourier transform from pole zero plot, First order, second order and all pass systems. Properties of Laplace transform, Analysis and characterization of LTI systems using the Laplace transform. Causality, stability, Differential equations, Butterworth filters. Unilateral Laplace transform, its properties and uses.","reference books":"- Oppenheim Willsky and Nawab, Signals and Systems, PHI. 4th Edn- Simon Haykin , Signals and Systems, John Wiley 4th Edn- Taub and Schilling, Principles of Communication Systems, TMH. 4th Ed","course outcomes":"- Utilize the concepts of Discrete time and Continuous time signals and their transformations.n- Analyze the Fourier series of periodic and Fourier transform of non-periodic discrete time and continuous time signals.n- Understand and apply the concepts of bandwidth .n- Apply the Laplace transform for various applications.n- Understand and apply the concepts of fourier series.n- Understand and apply the concepts of fourier transform."}
