{"course code":"ECPC32","course title":"Random Variables & Stochastic Processes","number of credits":"4","prerequisites":"MAIR11, MAIR12","course type":"PC","branch":"ec","course learning objectives":"To understand Random Variables, Standard Distribution Functions Several Random Variables, Random Processes.","course content":"## UNIT InnRANDOM VARIABLES: Sample space and events, Probability, Conditional Probability, definition of random variables, cumulative distribution function, probability density function, discrete random variables, continuous random variables, mathematical expectation, moments of random variables. Chebyshev inequality.nnn## UNIT IInnSTANDARD DISTRIBUTION FUNCTIONS: uniform, triangular, Gaussian, Bernoulli, binomial, negative binomial, geometric, Poissoins, Exponential, Weibul, Gamma, Erlang, Rayleigh, Rice, lognormal, chi square and other useful disribution functions. Functions of random variables.nnn## UNIT IIInnSEVERAL RANDOM VARIABLES: Joint distribution Functions, marginal and conditional distributions, Expectations, Joint Statistics, Conditional Statistics, independence, Sum of random variables, Central Limit Theorem, Functions of random variables & random vectors, Joint density function, mean, variance, correlation, covariance, moments, joint moments, Characteristic Functions, Convergence of a sequence of random variables,nnn## UNIT IVnnRANDOM PROCESSES: Definition and description of Random Processes, Classification of random processes, statistical characterization, mean, correlation and covariance functions,nStationary random processes, Ergodicity, Power Spectral density, Weiner-khintchine theorem, Response of memory- less and linear systems to random inputs, discrete time stochastic processes, Cyclostationary processes, Gaussian, Poisson, Markov processes.","reference books":"- Papoulis, A. Probability, Random Variables and Stochastic Processes, MGH, 3rd Ed.n- Gray, R.M. Davission,L.D,Introduction to Statistical Signal Processing- Web Edition-1999.n- Sundarapandian, V. Probability, Statistics and Queueing Theory, PHI Learning Private Limited, 3rd Ed.","course outcomes":"- Understand the basics of probability, events, sample space and how to use them to real life problems.n- Characterize probability models and function of random variables based on single & multiples random variables.n- Evaluate and apply moments & characteristic functions and understand the concept of inequalities and probabilistic limits.n- Understanding of autocorrelation and its relation with power density spectrum and its propertiesn- Understand the concept of random processes and determine covariance and spectral density of stationary random processes.n- Demonstrate the specific applications to Poisson and Gaussian processes and representation of low pass and band pass noise models."}
