{"course code":"ECPC52","course title":"Digital Signal Processing","number of credits":"4","prerequisites":"ECPC12","course type":"PC","branch":"ec","course learning objectives":"To understand Discrete transforms, implementation of discrete time systems, design of FIR filters, design of IIR filters.","course content":"## UNIT InnDISCRETE TRANSFORMS: Z- transform and its properties, poles and zeros, Inversion of Z-transform, One sided Z-transform and solution of differential equations. Analysis of LTI systems in Z-domain, causality, stability, Relationship between Z-transform and Fourier transform. Frequency selective filters; all pass filters, minimum-phase, maximum-phase and mixed-phase systems.nFrequency domain sampling and DFT; properties of DFT, Linear filtering using DFT, Frequency analysis of signals using DFT, radix 2 & radix-4 FFT algorithms, Goertzel algorithm, Applications of FFT algorithm, computation of DFT of real sequences.nnn## UNIT IInnIMPLEMENTATION OF DISCRETE TIME SYSTEMS: Direct form,ncascade form, frequency sampling and lattice structures for FIR systems. Direct forms, transposed form, cascade form parallel form. Lattice and lattice ladder structures for IIR systems. state space structures.nnn## UNIT IIInnDESIGN OF FIR FILTERS: Characteristics of practical frequency selective filters. Filters design specifications peak pass band ripple, minimum stop band attenuation. Four types of FIR filters Design of FIR filters using windows. Kaiser window method comparison of design methods for FIR filters Gibbs phenomenon, design of FIR filters by frequency sampling method, design of optimum equiripple FIR filters, alternation theorem.nnn## UNIT IVnnDESIGN OF IIR FILTERS: Design of IIR filters from analog filters, Design by approximation of derivatives, Impulse invariance method bilinear transformation method characteristics of Butterworth, Chebyshev, and Elliptical analog filters and design of IIR filters, Frequency transformation.","reference books":"- John G. Proakis, Digital Signal Processing, PHIn- S. K. Mitra, Digital Signal Processing , TMHn- Rabiner and Gold, Digital Signal Processing, PHIn- Salivahan, Digital Signal Processing , TMH","course outcomes":"- Understand discrete- time sequences and Z-transform.n- Compute DFT and FFT of discrete time signals.n- Design FIR and IIR filters using different techniques.n- Design frequency selective filters.n- Learn the DSP programming tools and use them for applicationsn- Design and implement signal processing modules in DSPs"}
