{"course code":"ECPC33","course title":"Measurement and Instrumentation","number of credits":"03","prerequisites":"ECPC11","course type":"PC","branch":"ec","course learning objectives":"To understand the various measurement techniques, basic working of instruments used for measurement and errors in measurements and their rectification.","course content":"## UNIT InnMeasurements and Errors: Principles of measurement, accuracy, precision, types of Errors, limiting Errors, Bridge Measurements (AC and DC bridges), analysis of Linear Systems, time domain response, Pressure Gauge-Measurement of Flow.nnn## UNIT IInnElectromechanical & Digital Indicating Instruments: PMMC Mechanism, DC Ammeters and Voltmeters, Series and Shunt Type Ohmmeter, Alternating Current Indicating Instruments (Moving Iron instruments, electrodynamometer instrument), D/A and A/D Converters Digital Voltmeters, Vector Voltmeter, Guarding Techniques, Automation in Voltmeter.nnn## UNIT IIInnSignal Generation and Analysis: Sine Wave Generator, Sweep Frequency Generator, Pulse and Square wave Generator, Function Generator Analyzer, Wave Analyzer, Distortion Analyzer, Harmonic Distortion Analyzer, Spectrum Analyzer, and Logic Analyzer.nnn## UNIT IVnnMeasurement systems for non-electrical quantities: Basics of telemetry; Different types of transducers and displays; Data acquisition system basics. Oscilloscopes and recorders.","reference books":"- Albert.D. Helfrick and William. D. Cooper, Modern Electronic Instrumentation and Measurement Techniques, PHI.Learning Private Limited, 2010.n- H. S. Kalsi, Electronic Instrumentation, 3rd Edition, Tata McGraw Hill Publishing Company Ltd., 2010.n- Earnest .O Doeblin, Measurement Systems Application and Design, 5th Edition, McGraw Hill International editions, 2009.n- A.K.Sawhney, A course in electrical and electronic measurements and instrumentation, Dhanapat Rai & Sons, 2000.","course outcomes":"At the end of the course student will be able to:n- Understand the fundamentals of electronic instrumentation.n- Measure various electrical parameters with accuracy, precision, resolution.n- Use AC and DC bridges for relevant parameter measurement.n- Select appropriate passive or active transducers for measurement of physical phenomenon.n- Use Signal Generator, frequency counter, CRO and digital IC tester for appropriate measurement.n- Ability to measure frequency, phase with Oscilloscope"}
