{"course code":"ECPC35","course title":"Communication Engineering","number of credits":"4","prerequisites":"ECIR11, ECPC12 and ECPC32","course type":"PC","branch":"ec","course learning objectives":"To understand modulation, demodulation and major building blocks of Communication system. Also, develop a clear insight into the input and output ac signals at various stages of a transmitter and a receiver of AM & FM systems.","course content":"## UNIT InnAMPLITUDE MODULATION: Need for modulation, linear modulation schemes, Frequency translation, FDM, Modulation and demodulation of DSBSC, SSB and VSB signals.nANGLE MODULATION: Basic concepts, Phase modulation, Frequency Modulation, Single tone frequency modulation, Spectrum Analysis of Sinusoidal FM Wave, Narrow band FM, Wide band FM, Transmission bandwidth of FM Wave - Generation of FM Waves, Detection of FM , Balanced Frequency discriminator, Zero crossing detector, Phase locked loop, Comparison of FM and AM.nnn## UNIT IInnNOISE: Resistive Noise Source (Thermal), Arbitrary noise Sources, Effective Noise Temperature, Average Noise Figures, Average Noise Figure of cascaded networks, Narrow Band noise, Quadrature representation of narrow band noise & its properties. Noise in Analog communication Systems: Noise in DSBSC and SSB Systems, Noise in AM System, Noise in Angle Modulation System, Threshold effect in Angle Modulation System, Pre-emphasis and de-emphasis.nnn## UNIT IIInnRECEIVERS: Types of Radio Receiver, Tuned radio frequency receiver, Super heterodyne receiver, RF section and characteristics - Frequency tuning and tracking, Intermediate frequency, AGC, FM Receiver, Comparison with AM Receiver, Amplitude limiting.nnn## UNIT IVnnPULSE MODULATION: Sampling theorem, sampling process, Quantization process, quantization noise, Types of Pulse modulation, PAM, PWM, PPM: Generation and demodulation of pulse modulated signals, Time Division Multiplexing. PCM, μ Law and A- law compressors. Line codes, Noise in PCM, DPCM, DM, delta sigma modulator, ADM.nTEXTBOOKSn- Simon Haykins , Communication Systems , Wiley & Sons , 4th Edition.n- Taub & Schilling, Principles of Communication Systems, TMH.n- B.P. Lathi , Modern Digital and Analog Communications, Oxford.n- George Kennedy and Bernard Davis ,Electronics & Communication Systems.","course outcomes":"At the end of the course student will be able to…n- Understand effect of noise on analog communication systems.n- Analyze energy and power spectral density of the signal.n- Evaluate analog modulated waveform in time /frequency domain.n- Analyze different characteristics of receiver.n- Generate pulse modulated signalsn- Draw the block diagram of AM and FM receiver."}
