{"course code":"ECPC34","course title":"Digital Design","number of credits":"4","prerequisites":"ECIR11","course type":"PC","branch":"ec","course learning objectives":"To familiarize students with the importance of digital logic design and develop the understanding towards the need of digital logics in computers and real world applications.","course content":"## UNIT InnNumber systems and codes, Laws of Boolean algebra, Theorems of Boolean algebra, Switching functions, Realization of functions using logic gates. Electronic logic gates, Positive and negative logic, Logic families, Algebraic methods, Canonical forms of Boolean functions, Minimization of functions using Karnaugh maps , Minimization of functions using Quine-McClusky method.nnn## UNIT IInnCombinational Logic: Combinational circuits, analysis procedure, design procedure, binary adder- subtractor, decimal adder, Ripple carry adder and Carry look ahead adder, binary multiplier, magnitude comparator, decoders, encoders, multiplexers.nnn## UNIT IIInnSequential Circuit Elements: Latches –RS latch and JK latch, Flip-flops-RS, JK, T and D flip flops, Master-slave flip flops, Edge-triggered flip-flops. FSM – Moore machine and Mealy machine, Flip-flops, Next state equations, Next state maps, State table and State transition diagram, Design of sequential circuits – State transition diagram, State table, Next state maps, Output maps, Expressions for flip-flop inputs and Expressions for circuit outputs.nnn## UNIT IVnnMoore and Mealy state graphs for sequence detection, Methods for reduction of state tables, Methods for state assignment. Registers and counters: Shift registers, ripple counter, synchronous Counter, other counters. Memory and programmable logic: RAM, ROM, PLA, PAL.","reference books":"- M. Morris Mano and M. D. Ciletti, “Digital Design”, 4th Edition, Pearson Education.n- Hill & Peterson, “Switching Circuit & Logic Design”, Wiley.n- Mohammad A. Karim and Xinghao Chen, “Digital Design-Basic concepts and Principles”, CRC Press Taylor & Francis group, 2010.n- C. H. Roth, Fundamental s of Logic design, Jaico Publishers, 1998.n- V. P. Nelson, H.T. Nagle, E.D. Caroll and J.D. Irwin, Digital Logic Circuit Analysis and Design, Prentice Hall International, 1995.","course outcomes":"At the end of the course student will be able to…n- Understand the number systems and Laws of Boolean algebra.n- Learn the minimization of functions using Karnaugh maps and Quine-McClusky method.n- Understand the basics of digital design.n- Design the hardware of various arithmetic logics.n- Design the hardware using sequential circuit elementsn- Design various digital machines/circuitsto address the need of real world."}
