{"course code":"ECPC30","course title":"Electronic Devices and Circuits","number of credits":"04","prerequisites":"ECIR11, ECPC10","course type":"PC","branch":"ec","course learning objectives":"To enable the students to understand the working principle of diodes and transistors for circuit applications.","course content":"## UNIT InnReview of P-N JUNCTIONS: abrupt and linearly graded junctions. V-I characteristic, C-V characteristic, Zener and Avalanche Breakdown. Diode circuit model.nP-N junction applications: Rectifiers, Clipping and Clamping Circuits, Varactor, Varistor, Voltage Regulator, Demodulator, Solar cells.nnn## UNIT IInnBJT: Ideal and Real transistor, I-V Characteristics, Small signal equivalent circuits, High frequency and Switching Transistors. Power transistors. BJT as an amplifier – Biasing, small Signal analysis. Frequency response. BJT equivalent circuit models- DC model, h-parameter model, re-model and hybrid-π model.nnn## UNIT IIInnTheory of field effect transistors: Static characteristics of JFETs and MOSFETs; Analysis of MOS structure, I-V and C-V characteristics, Depletion width, Threshold voltage, Body bias. Short channel effects: SS, DIBL, surface mobility, CLM. Small signal model.nSingle stage Amplifiers, Load line, Biasing, Frequency Response.nnn## UNIT IVnnJFET and MOSFET single stage amplifiers: Biasing, Small signal analysis, Frequency Response. Feedback Amplifiers and Oscillators.","reference books":"- J. Millman and C. Halkias, Integrated Electronics, McGraw Hill, 2nd Edition, 2009.n- Behzad Razavi, Design of analog CMOS Integrated circuits, McGraw Hill, 2002.n- Tyagi M.S., “Introduction to Semiconductor Materials and Devices”, John Wiley & Sons, 1993.n- Streetman B.G., Banerjee, S.K, “Solid State Electronic Devices”, Pearson Education, 6th Edition 2006.n- A. Sedra and C. Smith, Microelectronic Circuits: Theory and Applications, Oxford University Press, 6th Edition, 2013.","course outcomes":"At the end of the course student will be able ton- Understand working principle of P-N junction diode, BJT, JFET, MOSFET.n- Understand the short channel effects in MOS devices.n- Understand the circuit applications of BJT, JFET, MOSFET.n- Learn small signal analysis of BJT and MOSFET.n- Design single stage amplifiers.n- Design and analyze feedback and oscillator circuits."}
