{"course code":"ECPC50","course title":"Information Theory And Coding","number of credits":"4","prerequisites":"ECPC12, ECPC35","course type":"PC","branch":"ec","course learning objectives":"To understand elements of information theory and source coding, Linear block codes, Cyclic codes, Convolutional codes","course content":"## UNIT InnELEMENTS OF INFORMATION THEORY AND SOURCE CODING:nIntroduction, information as a measure of uncertainty, Entropy & its properties, Entropy of continuous sources, Discrete memoryless channels, Mutual information & its properties, BSC, BEC. Channel capacity, Shanon’s theorem on coding for memoryless noisy channels, Shanon’s three fundamental theorems.nSeparable binary codes, Shanon–Fano encoding, Noiseless coding, Theorem of decodability, Average length of encoded message, Shanon’s binary encoding, Fundamental theorem of discrete noiseless coding, Huffman’s minimum redundancy codes, capacity of colored noise source, water filling algorithms.nnn## UNIT IInnLINEAR BLOCK CODES: Groups & fields, Galois fields & its construction, Minimal polynomial, Vector spaces, Dual spaces, Linear block codes, Syndrome & error detections, Minimum distance, Error detecting and correcting capabilities of a block code, Standard array & Syndrome decoding, Hamming code.nnn## UNIT IIInnCYCLIC CODES: Description of cyclic codes, Polynomial representation, Minimum degree code polynomial, Generator polynomial, Generator matrix, Systematic form, Parity check matrices, cyclic codes encoders, Syndrome computation and error detection, Cyclic Hamming codes, Decoding of cyclic codes.nnn## UNIT IVnnCONVOLUTIONAL CODES: Encoding of Convolution codes, Structural properties of Convolution codes, State diagram, Code tree, Trellis diagram, Free distance, Coding gain, Viterbi decoding, distance properties of binary convolutional codes, Burst error correcting convolutional codes.","reference books":"- F. M. Reza, Information Theory, McGraw Hill, 1st Ed..n- Das, Mullick and Chatterjee, Digital Communication, Wiley Eastern Ltd, 3rd Ed..n- Shu Lin and J. Costello, Error Control Coding, Prentice Hall, 3rd Ed..","course outcomes":"- Understand the concepts of Random variables and stochastic processes and their applications in communication engineering.n- To be able to perform the time and frequency domain analysis of the signals in a digital communication system.n- Understand and apply the Entropy function, source coding and the three Shannon's fundamental theorems.n- Design the linear block codes and cyclic codes.n- Understand and apply the convolutions codes state diagrams, code tree and trellis diagrams, decoding algorithms.n- Understand and evaluate the channel performance using Information theory."}
