{"course code":"ECPC31","course title":"Fields & Waves","number of credits":"4","prerequisites":"MAIR 11, MAIR12","course type":"PC","branch":"ec","course learning objectives":"To understand the electric and magnetic fields, time varying fields and Maxwell’s equations, the uniform plane wave, transmission lines and waveguides.","course content":"## UNIT InnREVIEW OF ELECTRIC AND MAGNETIC FIELDS: Coulomb’s law, electric field intensity, field due to a continuous volume charge distribution, field of a line charge, field of a sheet of charge, electric flux density, Gauss’s law and applications, electric potential, the dipole, current density, continuity of current, metallic conductors, conductor properties and boundary conditions, the method of images, the nature of dielectric materials, boundary conditions for perfect dielectric materials, capacitance of two wire line, Poisson’s and Laplace’s equations, uniqueness theorem.nBiot-Savart law, Ampere’s law, magnetic vector potentials, force on a moving charge, differential current element, force and torque on a closed circuit, the boundary conditions, the magnetic circuit, potential energy and forces on magnetic materials.nnn## UNIT IInnTIME VARYING FIELDS AND MAXWELL’S EQUATIONS: Faraday’s law, Maxwell’snequations in point form and integral form Maxwell’s equations for sinusoidal variations, retarded potentials.nnn## UNIT IIInnTHE UNIFORM PLANE WAVE: Wave motion in free space and perfect dielectrics, plane waves in lossy dielectrics, Poynting vector and power considerations, propagation in good conductors, skin effect, reflection of uniform plane waves, SWR.nnn## UNIT IVnnTRANSMISSION LINES AND WAVEGUIDES: The transmission line equations, graphical methods, Smith chart, Stub Matching, Time domain and frequency domain analysis. TE, TM and TEM waves, TE and TM modes in rectangular and Circular wave guides, cut-off and guide wavelength, wave impedance and characteristic impedance, dominant modes, power flow in wave guides, excitation of wave guides, dielectric waveguides.","reference books":"- E. C. Jordan and K. G. Balmain, Electromagnetic Waves and Radiating Systems, PHI, 3rd Ed..n- David & Chang, Field and Wave Electromagnetics, Addison Wesley, 3rd Ed..n- W. H. Hayt, Engineering Electromagnetics, JR. Tata Mc-Graw Hill Edition, Fifth edition.","course outcomes":"At the end of the course student will be able to…n- Review the basics of electromagnetic theory related to static electric and magnetic field along with basic theorems, boundary conditions and their effects.n- Comprehend the effects of sinusoidal time variation in both electric and magnetic fields using Maxwell equations and retarded potentials.n- Understand the propagation of electromagnetic waves through different media using the concept of uniform plane waves, their reflection and associated measurements.n- Apply the above knowledge to understand working of transmission lines and waveguides using graphical methods like Smith Chart. Learn various types, modes, excitation, power flow and characteristics of waveguides.n- Apply the above knowledge to understand working of waveguides using graphical methods like Smith Chart.n- To learn various types, modes, excitation, power flow and characteristics of waveguides."}
