{"course code":"ECPC40","course title":"Analog Electronics","number of credits":"04","prerequisites":"ECPC30","course type":"PC","branch":"ec","course learning objectives":"To enable the students to design multistage amplifiers, oscillators and OP-AMP based linear and non-linear circuits.","course content":"## UNIT InnAnalysis and design of single stage RC- coupled amplifier, Classification of amplifiers, Direct coupled amplifiers, Multistage amplifiers, Frequency response of amplifiers.nnn## UNIT IInnCurrent Mirrors, Differential Amplifiers (Balanced and Unbalanced output), frequency response. Introduction to OP-AMP.nnn## UNIT IIInnOP-AMP with Negatives Feedback and Frequency Response (Open loop and Closed loop) Compensating network, Circuit stability, slew rate. Operational Transconductance Amplifier.nnn## UNIT IVnnApplications: DC, AC amplifiers, peaking amplifier, summing, sealing, averaging and instrumentation amplifier, differential input output amplifier, V-I and I-V converter, integration and differential circuit, wave shaping circuit, active filters, oscillators.","reference books":"- A. Sedra and C. Smith, Microelectronic Circuits: Theory and Applications, Oxford University Press, 6th Edition, 2013.n- J. Millman and C. Halkias, Integrated Electronics, McGraw Hill, 2nd Edition, 2009.n- BehzadRazavi, Design of analog CMOS Integrated circuits, McGraw Hill, 2002.n- R. A. Gayakwaed, OP-amps and Linear Integrated circuits, Prentice Hall India Learning Private Limited, 4th Edition 2002.n- K. R. Botkar, Integrated circuits, Khanna Publishers, 2004.","course outcomes":"At the end of the course student will be able ton- Design single and multistage amplifiers.n- Understand the kay issues in the designing of differential amplifiers.n- Understand the design of current mirrorsn- Understand the terminal characteristics of op-amps and design /analyze fundamental circuits based on op-amps.n- Understand the use of op-amps in different types of applications.n- Design integration, differential circuit and wave shaping circuits."}
