{"course code":"ECPC11","course title":"Circuit Theory","number of credits":"04","prerequisites":"MAIR11","course type":"PC","branch":"ec","course learning objectives":"The aim of this course is to make student competent in analyzing electrical circuits, apply Kirchhoff’s current and voltage laws to circuits in order to determine voltage, current and power in branches of any circuits excited by DC voltages and current sources.","course content":"## UNIT InnBASIC CIRCUITS ANALYSISnOhm’s Law – Kirchoffs laws – DC and AC Circuits – Resistors in series and parallel circuits – Mesh current and node voltage method of analysis for D.C and A.C. circuits – Phasor Diagram – Power, Power Factor and Energy. Initial conditions.nnn## UNIT IInnNETWORK REDUCTION AND NETWORK THEOREMS FOR DC AND AC CIRCUITSnNetwork reduction: voltage and current division, source transformation – star delta conversion. Theorems: Thevenin’s and Norton’s, Superposition, Maximum power transfer, Substitution, and Reciprocity Theorems.nnn## UNIT IIInnRESONANCE AND COUPLED CIRCUITSnSeries and parallel resonance – their frequency response – Quality factor and Bandwidth – Self and mutual inductance – Coefficient of coupling – Tuned circuits – Single tuned circuits.nnn## UNIT IVnnTRANSIENT RESPONSE FOR DC CIRCUITSnTransient response of RL, RC and RLC Circuits using Laplace transform for DC input and A.C. with sinusoidal input.","reference books":"- William H. Hayt Jr, Jack E. Kemmerly and Steven M. Durbin, “Engineering Circuits Analysis”, Tata McGraw Hill publishers, 6 th edition, New Delhi, 2003.n- Joseph A. Edminister, Mahmood Nahri, “Electric circuits”, Schaum’s series, Tata McGraw- Hill, New Delhi, 2001. 4th ED","course outcomes":"On completion of this course you should be able to:n- Apply KCL and KVL in electrical circuits to calculate currents, voltages and powers in typical linear electric circuitsn- Apply circuit theoremsn- Analyze AC and DC Circuitsn- Reduce more complicated circuits into the Thevenin’s and Norton’s equivalent circuits.n- Describe circuit elements in phasor domain and perform steady-state analysis using phasors.n- Analyze resonance Circuits"}
