{"course code":"ECPE41","course title":"Network Analysis and Synthesis","number of credits":"03","prerequisites":"ECPC11, MAIR-11. MAIR-12","course type":"PE","branch":"ec","course learning objectives":"To make the students proficient in analyzing and synthesizing an electrical network from a given impedance/admittance function.","course content":"## UNIT InnNetwork Theorems: Superposition theorem, Thevenin’s theorem, Norton’s theorem,nNorton’s theorem, Maximum Power transfer theorem, Reciprocity theorem, Millman’s theorem, Compensation theorem, Tellegen’s theorem. Network solution methods: nodal and mesh analysis.nnn## UNIT IInnTransient Circuit Analysis: Steady state sinusoidal analysis using phasors; Time domain analysis of simple linear circuits; Solution of network equations using Laplace transform; Frequency domain analysis of RLC circuits.nnn## UNIT IIInnLinear 2‐port network parameters: Driving point and transfer functions, State equations for networks, Characterization of LTI 2-port networks: Z, Y, ABCD, A’B’C’D’, g and h parameters, Reciprocity and symmetry. Graph Theory: Tree, Co tree, Link, Basic loop and basic cut set, Incidence matrix, Cut set matrix, Tie set matrix, Duality, Loop and nodal methods of analysis.nnn## UNIT IVnnNetwork Synthesis: Properties of Hurwitz polynomial and Positive real function, one terminal pair network driving point synthesis with LC elements, RC elements, RL elements, Foster and Cauer form.","reference books":"- Hayt W.H., Kemmerly J.E. and S. M., Engineering Circuit Analysis, 6th Edition, Tata McGraw-Hill Publishing Company Ltd., 2008.n- Valkenberg V., Network Analysis, 3rd Edition, Prentice Hall International Edition, 2007.n- Kuo F. F., Network Analysis and Synthesis, 2nd Edition, Wiley India, 2008.","course outcomes":"At the end of the course student will be able to:n- Apply the knowledge of basic circuit law and simplify the network using reduction techniques.n- Understand the basics single & two-port networks and their different parameters.n- Classify various functions like transfer functions, driving point functions and synthesis of different network functions.n- Familiarize with different network topologies, graph metrics and analysis of network using graph theory.n- Apply various theorems for circuit solving.n- Analyze transient circuit."}
