{"course code":"ECPE82","course title":"Network Security","number of credits":"3","prerequisites":"ECPE-51","course type":"PE","branch":"ec","course learning objectives":"Extensive, detailed and critical understanding of the concepts, issues, principles and theories of network security","course content":"## UNIT InnFUNDAMENTAL OF DATA SECURITY: Introduction to security, classification of security attacks, security mechanisms and services, Historical Ciphers, Shannon's perfect security, Symmetric key encryption: stream ciphers: RC4, Block ciphers: DES, 3DES, AES, IDEA, Modes of operation, Symmetric-Key Distribution, Public Key Encryption Algorithms: RSA, elliptic curve cryptography, Primality Testing and Factoring, Public key distribution, Public Key Infrastructure. Attacks on symmetric key and asymmetric key ciphers.nnn## UNIT IInnAUTHENTICATION: Attacks on Public Key Schemes, Signature Scheme, MAC and Hash Functions, properties and requirements of digital signatures, MAC and HASH, Kerberos, Entity authentication: weak Authentication, Challenge-Response identification (strong authentication), and Zero knowledge proofs.nnn## UNIT IIInnKEY DISTRIBUTION: Key management, D-H key exchange algorithm, attacks on D-H algorithm, Key predistribution, MIT key agreement protocol, Key Agreement using self-certifying keys.nnn## UNIT IVnnPRACTICAL APPLICATIONS: E-MAIL security PKI, CA. X509 certificates, SSL/TLS, HTTPS, IPV6 and IPSEC, Proxies and Firewalls, Wireless network security.nTEXT BOOKS:n- “Network Security Essentials (Applications and Standards)”, by William Stallings, Pearson Education.n- “Hack Proofing your Network” by Ryan Russell, Dan Kaminsky, Rain Forest Puppy, Joe Grand, David Ahmad,Hal Flynn Ido Dubrawsky, Steve W.Manzuik and Ryan Permeh, Wiley Dremtechn- “Fundamentals of Network Security” by Eric Maiwald, Dreamtech Press.n- “Network Security–Private Communication in a Public World” by Charlie Kaufman, Radia Perlman and Mike Speciner, Pearson/PHI.n- “Cryptography and Network Security”, Third edition, Stallings, PHI/Pearson.n- “Network Security: The Complete reference”, Robert Bragg, Mark Rhodes, TMH.","course outcomes":"At the end of the course student will be able ton- Identify network security threats and their preventive measures.n- Analyze and design encryption and authentication mechanisms.n- Analyze and design network security protocols.n- Analyze security challenges in wireless networks and their preventive measures.n- Analyze and design network security protocols including TLS, SSL etc.n- Determine firewall requirements, and configure a firewall."}
