{"course code":"ECPE72","course title":"Multicarrier Communication","number of credits":"3","prerequisites":"ECPC12, ECPC52 and ECPC53","course type":"PE","branch":"ec","course learning objectives":"To understand various techniques used in multicarrier communication and analyse the performance of multicarrier communication systems under different conditions.","course content":"## UNIT InnBASICS OF MULTICARRIER COMMUNICATION: Orthogonal Frequency-Division Multiplexing, Frequency-Domain Spread Multicarrier CDMA, Single-Carrier Frequency-Division Multiple Access, Orthogonal Multicarrier DS-CDMA, Multitone DS-CDMA, Generalized Multicarrier DS-CDMA, Time-Hopping Multicarrier CDMA, Time-Frequency-Domain Spread Multicarrier DS-CDMAnnn## UNIT IInnPERFORMANCE ANALYSIS OVER GAUSSIAN CHANNELS: Performance of Orthogonal Frequency-Division Multiplexing over Gaussian channels, Performance of Single-User Frequency-Domain Spread Multicarrier CDMA, Performance of Single-User Multicarrier DS- CDMA, Single-User Time-Hopping Multicarrier CDMA and Time-Frequency-Domain Spread Multicarrier DS-CDMA Supporting Multiusers.nnn## UNIT IIInnPERFORMANCE ANALYSIS OVER FADING CHANNELS: Frequency-Selective Fading in Multicarrier Systems, Inter-symbol Interference Suppression: Cyclic-Prefixing and Zero-Padding, Generation of Fading Statistics for Multicarrier Signals, Performance of OFDM, Single-User Frequency-Domain Spread Multicarrier CDMA, Single-User Multicarrier DS-CDMA and Time- Hopping Multicarrier CDMA systems over fading channels.nnn## UNIT IVnnMULTIUSER DETECTION: Multiuser Detection in Frequency-Domain Spread Multicarrier CDMA and Multicarrier DS-CDMA, Multiuser Detection in Time-Frequency-Domain Spread Multicarrier DS-CDMA, Representation of Discrete Time-Hopping Multicarrier CDMA Signals,nNoncoherent Single-User Multiuser Detection, Optimum Posterior Noncoherent Multiuser Detection, Principles of Transmitter Preprocessing.","reference books":"- Multicarrier Communications, Lie-Liang Yang,Wiley, 2009.n- Multi-Carrier Communication Systems with examples in MATLAB, A new perspective: Emad S. Hassan, CRC Press, 2015.n- Multi-Carrier Digital Communications, Theory and Applications of OFDM, Ahmad R S Bahai, 2nd Ed, Springer, 2004.n- Multicarrier Technologies for Wireless Communication, Carl R. Nassar, B. Natarajan, Z. Wu D. Wiegandt, and S. A. Zekavat, Springer, 2002.","course outcomes":"At the end of the course student will be able to;n- Understand the basics of OFDM and multicarrier CDMA systems.n- Analyse the performance of multicarrier systems over Gaussian channels.n- Analyse the performance of multicarrier systems over fading channels.n- Apply the techniques of interference suppression in multicarrier communication systemsn- Understand the coherent multiuser detection techniques used in multicarrier communication systemsn- Understand the noncoherent multiuser detection techniques used in multicarrier communication systems"}
