{"course code":"ECPE51","course title":"Computer Networks","number of credits":"3","prerequisites":"None","course type":"PE","branch":"ec","course learning objectives":"The objective of this course is to provide an understanding of theoretical aspects of computer networks, including the protocols involved in the exchange of information between communicating devices.","course content":"## UNIT InnComputer Network Topologies, Network Hardware, Network Software, OSI Model and TCP/IP protocol stack, ATM, Data communication fundamentals, Wired physical layer, Wireless physical layer, Physical layer based on telephone line.nnn## UNIT IInnData Link layer design issues, Error detection & correction, Elementary Data Link protocols, Sliding Window Protocols, Example Data Link Protocols, Aloha Protocols, Wired MAC layer, IEEE 802.2: Logical Link control, Wireless MAC layer.nnn## UNIT IIInnNetwork layer services, Datagram and Virtual circuit services, Routing algorithms, Congestion control algorithms, Internetworking, Transport layer services, Elements of transport protocols, The Internet transport protocols: UDP & TCP.nnn## UNIT IVnnDomain Name System, World Wide Web and HTTP, Electronic mail system, File Transfer protocol, Network security, Cryptography.","reference books":"- Tanenbaum A.S, “Computer Networks”, Pearson, 4th ed., 2003.n- Forouzan B.A, “Data Communications and Networking”, Tata McGraw Hill, 4th ed. 2006.n- Stallings W, “Data and Computer Communications”, PHI, 9th ed., 2011.n- Kurose & Ross K. W., “Computer Networking: A Top-Down Approach featuring the Internet”, Pearson, 5th edition, 2010.","course outcomes":"At the end of the course, the student will be able to:n- Understand the computer network hardware and software.n- Compare the OSI and TCP/IP protocol stacks.n- Examine the protocols operating at different layers of network architecture.n- Categorize the services offered by all layers of network’s protocol stack.n- Assess the cryptographic techniques.n- Identify the sources of network security threats."}
