{"course code":"ECPE 77","course title":"Biomedical Electronics","number of credits":"03","prerequisites":"ECPC33, ECPC30nECPC42, ECPC52 and ECPE71","course type":"PE","branch":"ec","course objectives":"Course provides basic concepts of Bioelectric Potentials , Electrodes, general properties of transducers and sensors, Bioelectric Signal Acquisitions and Safety Measures. It will also familiarize the process of Bioelectric Signal Acquisitions of parameters such as displacement, motion, pressure and temperature measurement and biopotential electrodes. At the end it provides the understanding of microcontroller based biomedical applications of the above transducers and sensors.","course content":"## UNIT InnINTRODUCTION: Classification of Biomedical Instrumentation, Sources of Biomedical Signals, Components of the Biomedical Instrumentation system, Design Factors of Biomedical Instrumentation, Desirable Characteristics of Biomedical Instrumentation Systems.nnn## UNIT IInnTRANSDUCERS FOR BIOMEDICAL APPLICATIONS: Active Transducer, Passive Transducer, Sensors, Displacement Sensor, Strain Gauges, inductive Transducers, Capacitive Transducers, Piezoelectric Transducers, Temperature Measurements.nnn## UNIT IIInnBIOELECTRIC POTENTIALS & ELECTRODES: Resting& action Potential, Propagation of action Potential, Bioelectric Potential, Various Bioelectric Potentials and Their Waveforms Electrode Theory, Biopotential Electrodes. Microelectrodes, Skin Surface Electrodes Needle Electrodes, Biochemical Transducernnn## UNIT IVnnBIOELECTRIC SIGNAL ACQUISITIONS, BIOTELEMETRY & ELECTRICAL SAFETYnMEASURES: Bio-signal Amplifiers, Microprocessor/Microcontroller based Biomedical Instrumentation, Applications of. Computer in Biomedical Instrumentation, PhysiologicalnParameters Adaptable to Biotelemetry, Elements of Biotelemetry System, Requirements for a Biotelemetry System, Implantable Biotelemetry Units, Electrical Safety of Medical Equipment and Patients.","reference books":"- Biomedical Instrumentation and Measurements By Ananda Natarajan, R. (Prentice Hall Inc)n- Design of Micro- controller based Medical Instrumentation By J Tompkins & J G Webster (Prentice Hall Inc)n- L A Geddes & L E Baker :- Principles of Applied Biomedical Instrumentation (John Wiley & sons, NY)n- J H Milsum:- Biological Control Systems(Mc Graw Hill, NY)n- R Plonsey:- Bioelectric Phenomena (McGraw-Hill Co, NY)n- Biomedical Sensors-Fundamentals and applications by Harry N. Nortan (Plennum Press)n- Hand Book of Biomedical Instrumentation By R.S. Khandpur (Tata McGraw Hill)","course outcomes":"After completion of the course the student will be competent to:n- Clearly understand of generalized medical instrumentation system.n- Clearly understand Electrodes, Bioelectric Potentials and their waveforms.n- Clearly understand static and dynamic characteristics of transducers and sensors.n- Acquire practical knowledge of various transducers and sensors and use them in suitable microcontroller based biomedical applications.n- Handle Bioelectric Signal Acquisitions & Biotelemetry processes.n- Ensure the Electrical Safety measures of Medical Equipment and Patients."}
