{"course code":"ECPE85","course title":"Computer Vision","number of credits":"03","prerequisites":"ECPE71","course type":"PE","branch":"ec","course learning objectives":"The student should be able to understand and apply the various concepts of Computer Vision.","course content":"## UNIT InnINTRODUCTION: What is computer vision? A brief history , Image formation Geometric primitives and transformations, Photometric image formation, The digital camera, Point operators, Linear ﬁltering, More neighborhood operators, Fourier transforms, Pyramids and waveletsn,Geometric transformations, Global optimization.nnn## UNIT IInnFEATURE DETECTION AND MATCHING: Points and patches, Edges, Lines, Segmentationn: Active contours , Split and merge, Mean shift and mode ﬁnding, Normalized cuts ,Graph cuts and energy-based methods, Feature-based-alignment: 2D and 3D feature-based alignment ,Pose estimation, Geometric intrinsic calibration, Structure from motion: Triangulation, Two-frame structure from motion, Factorization ,Bundle adjustment ,Constrained structure and motion.nnn## UNIT –IIInnDENSE MOTION ESTIMATION: Translational alignment, Parametric motion, Spline-based motion , Optical ﬂow , Layered motion, Image stitching; Motion models, Global alignment, Compositing, Computational photography: Photometric calibration, High dynamic range imaging, Super-resolution and blur removal, Image matting and compositing, Texture analysis and synthesis.nnn## UNIT –IVnnSTEREO CORRESPONDENCE: Epipolar geometry, Sparse correspondence, Dense correspondence, Local methods, Global optimization, Multi-view stereo, 3D-reconstruction: Shape from X, Active range ﬁnding, Surface representations, Point-based representations, Volumetric representations, Model-based reconstruction, Recovering texture maps and albedos,nImage-based rendering: View interpolation, Layered depth images, Light ﬁelds and Lumigraphs, Environment mattes, Video-based rendering, Recognition: Object detection, Face recognition, Instance recognition, Category recognition, Context and scene understanding, Recognition databases and test sets.","reference books":"- Richard Szeliski, Computer Vision: Algorithms and Applications, Springer-Verlag London Limited, 2011.n- Simon J. D. Prince, Computer Vision: Models, learning and Interface, Cambridge University Press, NY, USA, 2012.","course outcomes":"At the end of the course student will be able to:n1 Develop the understanding about fundamentals of computer vision. 2 Find features of the given image.n- Apply matching techniques.n- Understand different motion techniques. 5 Apply super-resolution on images.n6 Construct 3D images from various image segments."}
