{"course code":"ECPE42","course title":"Computer Architecture","number of credits":"3","prerequisites":"None","course type":"PE","branch":"ec","course learning objectives":"The objective of this course is to provide students with the basic concepts and principles in computer architecture so that students have in-depth understanding of computer system designs.","course content":"## UNIT InnINTRODUCTION TO COMPUTER HARDWARE AND SOFTWARE: Functionalnnn## Units, Historical perspective, Performance of computer, Register transfer and micro- operations, Information representation, Instruction format, Instruction types, Addressing modes, Instruction set architectures- CISC and RISC, Super-scaler architecture, Fixed point and floating point operations.nnnn## UNIT IInnBASIC PROCESSING UNIT: Fundamental concepts, ALU, Control unit, Multiple bus organization, Hardwired control, Micro programmed control, Pipelining, Data hazards, Instruction hazards, Influence on instruction sets, Data path and control considerations, Performance considerations.nnn## UNIT IIInnMEMORY ORGANIZATION: Basic concepts, Semiconductor RAM memories, Read- Only Memories, Speed, Size and Cost, Cache Memories, Performance considerations, Cache Coherency in Multiprocessor, Virtual Memories, Memory Management Requirements, Secondary Storage devices.nnn## UNIT IVnnI/O ORGANIZATION: Accessing I/O Devices, Programmed I/O, Interrupt-driven I/O, Direct Memory Access, Buses, Interface Circuits: Serial port, Parallel port, PCI Bus, SCSI Bus, USB, The External Interface-FireWire and InfiniBand.","reference books":"- C.Hamacher Z. Vranesic and S. Zaky, “Computer Organization”, McGraw-Hill, 5th ed., 2002.n- W. Stallings, “Computer Organization and Architecture - Designing for Performance”, Pearson, 7th ed.,2006.n- M.M. Mano, “Computer System Architecture”, PHI.n- J.P.Hayes, “Computer Architecture and Organization”, McGraw-Hill.","course outcomes":"At the end of the course the student will be able to:n- Comprehend the basic knowledge of functional components of computer system.n- Provide an overview of computer system software and understand basic aspects of performance evaluation.n- Analyze concept of various addressing modes including design instruction set architecture.n- Identify the function of building blocks within CPU of a computer system.n- Explain memory system design including Cache and Virtual-memory systems.n- Familiarize with the basic knowledge of I/O devices and interface circuits."}
