{"course code":"ECPE74","course title":"Advanced DSP","number of credits":"3","prerequisites":"ECPC12, ECPC52, ECLR51","course type":"PE","branch":"ec","course learning objectives":"To understand Adaptive Filter, Multirate DSP, Optimum Linear Filters, Cepstrum Analysis and Homomorphic Deconvolution.","course content":"## UNIT InnADAPTIVE FILTER: System identification of system modeling, adaptive channel equalization, echo cancellation in data transmission over telephone channels, suppression of narrowband interference in a wide band signal, adaptive line enhancer, adaptive noise cancelling, minimum mean square error criterion, the LMS algorithm, related stochastic gradient algorithm, properties of LMS algorithm, RLS algorithm, the LDU factorization and square root algorithm, fast RLS algorithm.nnn## UNIT IInnMULTIRATE DSP: Decimation and interpolation, digital filter banks, interconnection of building blocks, noble identities, polyphase representation, polyphase implementation of uniform DFT filter banks, fractional decimation, PR systems, multirate implementation, applications of multirate systems, PR QMF bank, two channel and m-channel QMF banks and polyphase representations, tree structured filter banks.nnn## UNIT IIInnOPTIMUM LINEAR FILTERS: Innovation representation of stationary random process, forward and backward linear prediction, optimum reflection coefficients for lattice forward and backward predictors. Levinson Durbin algorithm, AR lattice and ARMA lattice ladder filters, FIR and IIR wiener filter for filtering and prediction.nnn## UNIT IVnnCEPSTRUM ANALYSIS AND HOMOMORPHIC DECONVOLUTION: Complex cepstrumnand its properties, complex and real cepstrum for exponential, periodic, minimum phase and maximum phase sequences, computation of complex cepstrum, homomorphic systems deconvolution, homomorphic deconvolution, complex cepstrum of simple multipath model and speech model.","reference books":"- J.G. Proakis and D.G. Manolakis: Digital Signal Processing, 3rd Ed.n- A.V. Oppenheim and R.W. Schafer: Discrete Time Signal Processing, 3rd Ed.","course outcomes":"- Compute the use of FFT and DFT.n- Design and implement FIR and IIR filtersn- Apply the concepts of multirate digital signal processingn- Understand and apply concepts of adaptive filters in various applicationsn- Understand the complex cepstrum of simple multipath model and speech model.n- Understand and apply the knowledge of Levinson Durbin algorithm, AR lattice and ARMA lattice ladder filters for prediction."}
