{"course code":"ECPE54","course title":"Embedded System Design","number of credits":"3","prerequisites":"ECPC42, ECLR42","course type":"PE","branch":"ec","course learning objectives":"To familiarize the students with the basic design concepts for designing an embedded systems and design the embedded system solution to the problem.","course content":"## UNIT InnAN INTRODUCTION TO EMBEDDED SYSTEMS: An Embedded System, Processor in the System, Other Hardware Units, and Software Embedded into a System, Exemplary Embedded Systems, Embedded System – On- Chip (SOC) and in VLSI Circuit.nProcessor and Memory Organization: Structural Units in a Processor, Processor Selection for an Embedded System, Memory Devices, Memory Selection for an Embedded Systems, Allocation of Memory to Program Cache and Memory Management Links, Segments and Blocks and Memory Map of a System, DMA, Interfacing Processors, Memories and Input Output Devices.nnn## UNIT IInnDEVICES AND BUSES FOR DEVICE NETWORKS: I/O Devices, Timer and Counting Devices, Serial Communication Using the “I2C” (Inter IC) CAN (controller area network), Profibus Foundation Field Bus and Advanced I/O Buses Between the Network Multiple Devices. Host Systems or Computer Parallel Communication between the Networked I/O Multiple Devices using the ISA, PCI, PCI-X and Advanced Buses.nnn## UNIT IIInnDEVICE DRIVERS AND INTERRUPTS SERVICING MECHANICS: Device Drivers,nParallel Port and Serial Prot Device Drives in a System, Device Drovers for Internal Programmable Timing Devices, Interrupt Servicing Mechanism.nnn## UNIT IVnnHARDWARE-SOFTWARE CO-DESIGN IN AN EMBEDDED SYSTEM: EmbeddednSystem Project Management Embedded System Design and Co-Design issues in System Development Process.nDesign Cycle in the Development Phase for an Embedded System: Use of Target Systems, Use of Software Tools for Development of an Embedded System, Use of Scopes and Logic Analysis for System, Hardware Tests, Issues in Embedded System Design.","reference books":"- Raj Kamal, “Embedded Systems: Architecture, Programming and Design”, TMH.n- David Simon, “An Embedded Software Primer”, Pearson Education.","course outcomes":"At the end of the course student will be able to…n- Define a real life problem in terms of technical specification of relevant embedded system.n- Understand the processor and memory organization.n- Learn different types of I/O Devices, timer and counting devices.n- Understand the interrupts servicing mechanics.n- Design the embedded system as per the specification.n- Understand the importance of Hardware-Software Co-design in an Embedded System."}
