{"course code":"ECPE86","course title":"Memory Design","number of credits":"03","prerequisites":"ECPC10 ECPC30nECPC34","course type":"PE","branch":"ec","course objectives":"Course provides basic concepts of different types of Memories. It provides understanding of transistor based design of Memory cell and associated circuits like sense amplifiers and decoders. Electromagnetic compatibility of memory devices when working in high speed systems will be introduced.","course content":"## UNIT InnINTRODUCTION TO SEMICONDUCTOR MEMORIES AND TECHNOLOGIES:nInternal organization of memory chips, basic memory elements, memory types, trends in SRAM and DRAM design, Non-volatile memory technologies. Radiation Effects-radiation types effecting the memory, radiation hardening techniques (EMC).nnn## UNIT IInnSRAM AND DRAM CELL DESIGN: basic structures-NMOS static/dynamic circuits,CMOS circuits, Cell design, Design parameters, read write operations.nnn## UNIT IIInnSENSE AMPLIFIERS: Voltage and Current Sense Amplifiers; Reference VoltageGeneration; Voltage Converters.nnn## UNIT IVnnCACHE MEMORY DESIGN: Concept of locality in space and time, interfacing cachememory with CPU, associated problems-parasitic capacitances, critical timing paths,","reference books":"- K. Itoh, VLSI Memory Chip Design, Springer-Verlag, 2001.n- B. Keeth and R. J. Baker, DRAM Circuit Design : A Tutorial, Wiley/IEEE, 2000.n- B. Prince, Semiconductor Memories : A Handbook of Design, Manufacture andApplication, Second Edition, Wiley, 1996.n- A. K. Sharma, Advanced Semiconductor Memories : Architectures, Designs andApplications, Wiley/IEEE, 2002.n- T. P. Haraszti, CMOS Memory Circuits, Kluwer, 2000.n- J. Handy, The Cache Memory Book, Second Edition, AP, 1998.","course outcomes":"After the completion of course, the student will be competent to:n- Clearly understand different types of memory devices.n- Clearly understand transistor based design of Memory cell and associated circuits like sense amplifiers and decoders.n- Clearly understand the concept of cache memory.n- Clearly understand the concept of EMC of memory devices.n- Acquire practical knowledge of memory devices used in industry.n- Design and analyze memory cells for optimize performance."}
