{"course code":"ECPE84","course title":"Artificial Intelligence and ExpertnSystems","number of credits":"3","prerequisites":"MAIR11, ECPC32","course type":"PE","branch":"ec","course learning objectives":"To present the concepts of intelligent agents, searching, knowledge and reasoning, planning, learning neural networks and expert systems.","course content":"## UNIT InnINTRODUCTION: Introduction to AI: Intelligent agents, Perception, Natural language processing, Problem Solving agents, Searching for solutions: Uniformed search strategies, Informed search strategies.nnn## UNIT 1InnKNOWLEDGE AND REASONING: Adversarial search, Optimal and imperfect decisions, Alpha, Beta pruning, Logical agents: Propositional logic, First order logic, Syntax and semantics, Using first order logic, Inference in first order logic. Uncertainty, acting under uncertainty, Basic probability notation, Axioms of probability, Baye’s rule, Probabilistic reasoning, Making simple decisions.nnn## UNIT 1IInnPLANNING AND LEARNING: Planning: Planning problem, Partial order planning, Planning and acting in non-deterministic domains. Learning: Learning decision trees, Knowledge in learning, Neural networks, Reinforcement learning, Passive and active.nnn## UNIT 1VnnEXPERT SYSTEMS: Definition, Features of an expert system, Organization, Characteristics, Prospector, Knowledge Representation in expert systems. Expert system tools, MYCIN.","reference books":"- Stuart Russel and Peter Norvig, Artificial Intelligence A Modern Approach, Pearson Education, 2nd Edition, 2003.n- Donald A. Waterman, A Guide to Expert Systems, Pearson Education.n- George F. Luger, “Artificial Intelligence – Structures and Strategies for Complex Problem Solving, Pearson Education, 4th Edition, 2002.n- Elain Rich and Kevin Knight, “Artificial Intelligence, Tata McGraw Hill, 2nd Edition, 1995.n- W. Patterson, “Introduction to Artificial Intelligence and Expert Systems, Prentice Hall of India, 2003.","course outcomes":"At the end of the course student will be able to:n- Explain Artificial Intelligence for solving problems.n- Understand axioms of probability.n- Explain the principles, concepts and operation certain and uncertain knowledge and reasoning.n- Explain the principles, concepts of planning and learning for neural networks.n- Explain the concepts expert systems.n- Use expert system tools like MYCIN, EMYCIN."}
