{"course code":"ECPE 79","course title":"Digital IC Design","number of credits":"03","prerequisites":"ECPC10 ECPC30 ECPC34","course type":"PE","branch":"ec","course objectives":"Course provides basic concepts of CMOS Inverter and its applications in the design of Combinational & Sequential Circuits, effects of Parasitics in circuit design, performance and power optimization in circuit design.","course content":"## UNIT InnCMOS INVERTER: Static and Dynamic Behavior, Power, Energy and Energy Delay, Technology scaling and its impact.nINTERCONNECTS: Interconnect parameters, wire models, wires.Effects of Interconnect Parasitics, AdvancedInterconnect techniques.nnn## UNIT IInnDESIGN OF CMOS COMBINATIONAL & SEQUENTIAL CIRCUITS:nCOMBINATIONAL CIRCUITS- Static and dynamic CMOSDesign, Speed and power dissipation in dynamic circuits, cascading of gates, designing logic for reduced supply voltages.nSEQUENTIAL CIRCUITS- Static and dynamic latches andregisters, alternative register styles, pipelined sequential circuits, non-bistable sequential circuits.nnn## UNIT IIInnTIMING ISSUES IN DIGITAL CIRCUITS: Timing classification, synchronous timingbasics, sources of skew and jitter, clock distribution techniques, Self-timed circuit design, synchronizers and arbiters, clock synchronization using PLL.nnn## UNIT IVnnDESIGN OF ALU: data paths, adder, multiplier, shifter, power andspeed trade-off in data path structures, power management.","reference books":"- N. Weste, K. Eshraghian and M. J. S. Smith, Principles of CMOS VLSI Design : ASystems Perspective, Second Edition (Expanded), AW/Pearson, 2001.n- J. P. Uyemura, Introduction to VLSI Circuits and System, Wiley, 2002.n- J. M. Rabaey, A. P. Chandrakasan and B. Nikolic, Digital Integrated Circuits : A Design Perspective, Second Edition, PH/Pearson, 2003.n- S. M. Kang and Y. Leblebici, CMOS Digital Integrated Circuits : Analysis andDesign, Third Edition, MH, 2002.n- R. J. Baker, H. W. Li and D. E. Boyce, CMOS Circuit Design, Layout andSimulation, PH, 1997.","course outcomes":"After completion of the course the student will be competent to:n- Clearly understand of CMOS Inverter design.n- Clearly understand of CMOS based Combinational & Sequential Circuitsn- Acquire knowledge of Timing issues in Digital Circuits.n- Acquire knowledge of various delays introduced by interconnects.n- Design clock distribution network in complex digital circuits.n- Design of ALU for different applications."}
