{"course code":"ECPE52","course title":"Neuro-Fuzzy Systems","number of credits":"3","prerequisites":"ECPC12","course type":"PE","branch":"ec","course learning objectives":"To learn about neural network structures and learning strategies; understand the concept of fuzzy systems and design them for practical applications.","course content":"## UNIT InnINTRODUCTION TO NEURAL NETWORKS: Introduction: The Human Brain and Biological Neuron, Artificial Neuron Models, Types of Neuron Activation Function, ANN Architectures Characteristics of ANN, Mc Culloch-Pitts Model, Historical Developments, Potential Applications of ANN.nnn## UNIT IInnESSENTIALS OF ARTIFICIAL NEURAL NETWORKS: Classification Taxonomy of ANN – Connectivity, Learning Strategy (Supervised, Unsupervised, Reinforcement), Learning Rules. Back Propagation Algorithm Feed Forward Neural Networks: Single Layer and Multilayer. Radial Basis function networks(RBFN), Self-organizing feature map.nnn## UNIT IIInnINTRODUCTION TO FUZZY SYSTEMS: Introduction: Fuzzy and Neurofuzzy system and their merits. Introduction to Architecture of a fuzzy system. Fuzzzification Rule Base, Inference engine, Defuzzification.nFuzzy Mathematics: Fuzzy sets & operation of fuzzy sets. Properties of fuzzy sets. Fuzzy relations. Fuzzy graphs & Fuzzy Arithmetic.nnn## UNIT IVnnARCHITECTURE & DESIGN ISSUES: Fuzzification. Fuzzy Rule based Models. Implication process, Defuzzification Techniques.nFuzzy Logic in Control Applications: Selection of Design Methodology, Technical Design objectives, Mamdani & Sugeno – Takagi Architectures.nAdaptive Neuro Fuzzy Interference Systems (ANFIS), Functional equivalence between RBFN and FIS","reference books":"- Simon Haykin, “Neural Networks- A comprehensive foundation”, Pearson Education, 2001.n- Jang, Sun, Mizutani, “ Neuro- Fuzzy and soft computing”, Pearson, 1997.n- KLIR & YAUN : Fuzzy Sets and Fuzzy Logic, Prentice Hall of Indian- T.J.Ross,” Fuzzy Logic with Engineering Applications”, McGraw Hill.","course outcomes":"At the end of the course student will be able to:n- Understand the basic principles of neural networksn- Apply the supervised and unsupervised methods for training of neural networksn- Use neural networks for practical applicationsn- Understand the elements of fuzzy systemsn- Design fuzzy systems based on Mamdani and Sugeno-Takagi modelsn- Use the concept of adaptive neuro fuzzy systems (ANFIS) for practical applications"}
