{"course code":"ECPE80","course title":"Computer Crime Investigation andnForensics","number of credits":"3","prerequisites":"CSIR11, ECPE51","course type":"PE","branch":"ec","course learning objectives":"To understand computer crimes and why computer forensics is an integral part of information security.","course content":"## UNIT InnAuctions and Trading Mechanisms, safe exchange, payment mechanisms and protocols, Searching hyperlinked structures, data mining, copyright protection and security, web software infrastructure, personalization and tracking, integration of catalogues and other trading information.nnn## UNIT IInnIndustrial espionage and cyber-terrorism, principles of criminal law, computer forensic investigation, elements of personnel security and investigations, principles of risk and security management, conspiracy in computer crime, and computer fraud investigation.nnn## UNIT IIInnForensics Overview-Computer Forensics Fundamentals, Benefits of Computer Forensics, Computer Crimes, Computer Forensics Evidence and the Courts, Legal Concerns and Privacy Issues. Forensics Process-Forensics Investigation Process, Securing the Evidence and Crime Scene, Chain of Custody, Law Enforcement Methodologiesnnn## UNIT IVnnForensics Evidence-Evidence Sources, Evidence Duplication, Preservation, Handling, and Security, Forensics Soundness, Order of Volatility of Evidence, Collection of Evidence on a Live System, Court Admissibility of Volatile Evidence, Forensics Readiness-Benefits of Forensic Readiness, Preparing an Organization for Forensics Investigations, Managing an Investigation, Internet Forensics-Reconstructing Past Internet Activities and Events, E-mail Analysis, Messenger Analysis: AOL, Yahoo, MSN, and Chat","reference books":"- Sherri Davidoff, Jonathan Ham. Network Forensics: Tracking Hackers Through Cyberspace, Prentice Hall, 2012.n- Clint P Garrison. Digital Forensics for Network, Internet, and Cloud Computing: A Forensic Evidence Guide for Moving Targets and Data, Syngress, 2010. ISBN 1597495387, 9781597495387.n- Vacca, J, Computer Forensics, Computer Crime Scene Investigation, 2nd Ed, Charles River Media, 2005.n- Gallegos F, Computer Forensics: An Overview, Volume 6, 2005, Located at: Computer Forensics: An Overview (last visited Dec. 26, 2006)","course outcomes":"At the end of the course student will be able to…n- Understand computer forensics, prepare for computer investigationsn- Understand enforcement agency investigations and corporate investigationsn- Maintain professional conductn- Understand how to identify needs for computer forensics toolsn- Evaluate the requirements and expectations for computer forensics toolsn- Understand how computer forensics hardware and software tools are integrated and validatednPATTERN RECOGNITION AND MACHINE LEARNING"}
