{"course code":"ECPE88","course title":"RF Circuit Design","number of credits":"3","prerequisites":"ECPC30, ECPC40","course type":"PE","branch":"ec","course learning objectives":"To familiarize students with the importance of RF circuit design techniques and their potential application areas.","course content":"## UNIT InnRF systems architectures: Transmission media and reflections, Passive RLC Networks: matching, Passive IC Components, Interconnects and skin effect, Review of MOS Device Physics, Distributed Systems: Transmission lines, reflection coefficient.nnn## UNIT IInnHigh Frequency Amplifier Design: Bandwidth estimation,Rise-time, delay and bandwidth - Zeros to enhance bandwidth - Shunt-series amplifiers, tuned amplifiers - Cascaded amplifiersnNoise : Thermal noise, flicker noise review - Noise figure.nnn## UNIT IIInnLNA Design: Intrinsic MOS noise parameters, design examples & Multiplier based mixers, Mixer Design: Subsampling mixers.RF Power Amplifiers: Class A, AB, B, C amplifiers - Class D, E, F amplifiers - RF Power amplifier design examples, Voltage controlled oscillators: Resonators - Negative resistance oscillators.nnn## UNIT IVnnPhase locked loops: Linearized PLL models - Phase detectors, charge pumps - Loop filters, PLL design examples, Frequency synthesis and oscillators, Phase noise: General considerations - Circuit examples, Radio architectures: GSM radio architectures - CDMA, UMTS radio architectures.","reference books":"- Thomas H. Lee, The Design of CMOS Radio-Frequency Integrated Circuits, Cambridge University Press, 2004.n- Behzad Razavi, RF Microelectronics, Prentice Hall, 1997.","course outcomes":"At the end of the course student will be able ton- Understand the basics of RF circuit design.n- Understand the key design challenges in RF circuit design.n- Understand the key challenges in the designing of LNA.n- Design the various RF power amplifiers.n- Design voltage controlled oscillators.n- Design phase locked loops and Radio architectures."}
