{"course code":"ECPE50","course title":"Data Structure","number of credits":"3","prerequisites":"CSIR11, ECPE40","course type":"PE","branch":"ec","course learning objectives":"To learn the efficient storage mechanisms of data for an easy access and implementation of various basic and advanced data structures. Also, understand the various techniques for representation of the data in the real world with the concepts of protection and management of data.","course content":"## UNIT InnINTRODUCTION: Understanding pointers, usage of pointers, arithmetic on pointers, memory allocation, memory management functions and operators, debugging pointers dangling pointers, memory leaks, etc. The Concept of data type, definition and brief description of various data structures, data structures versus data types, operations on data structures, algorithm complexity, Big O notation.nnn## UNIT IInnLINKED LIST, STACKS AND QUEUES: Linear and multi-dimensional arrays and their representation, operations on arrays, sparse matrices and their storage. Linear linked list, operations on linear linked list, doubly linked list, operations on doubly linked list, application of linked lists. Sequential and linked representations, operations on stacks, application of stacks such as parenthesis checker, evaluation of postfix expressions, conversion from infix to postfix representation, implementing recursive functions. Sequential representation of queue, linear queue, circular queue, operations on linear and circular queue, linked representation of a queue and operations on it, deque, priority queue, applications of queues.nnn## UNIT IIInnTREE AND HEAP: Basic terminology, sequential and linked representations of trees, traversing a binary tree using recursive and non-recursive procedures, inserting a node, deleting a node, briefnintroduction to threaded binary trees, AVL trees and B-trees. Representing a heap in memory, operations on heaps, application of heap in implementing priority queue and heap sort algorithm.nnn## UNIT IVnnGRAPHS, SORTING AND SEARCHING: Basic terminology of Graphs, representation of graphs (adjacency matrix, adjacency list), traversal of a graph (breadth-first search and depth-first search), and applications of graphs. Comparing direct address tables with hash tables, hash functions, concept of collision and its resolution using open addressing and separate chaining, double hashing, rehashing. Searching an element using linear search and binary search techniques, Sorting arrays using bubble sort, selection sort, insertion sort, quick sort, merge sort, heap sort, shell sort and radix sort, complexities of searching & sorting algorithms.","reference books":"- Sartaj Sahni, Data Structures, Algorithms and Applications in C++, Tata McGraw Hill.n- Tenenbaum, Augenstein, & Langsam, Data Structures using C and C++, Prentice Hall of India.n- R. S. Salaria, Data Structures & Algorithms Using C++, Khanna Book Publishing Co. (P) Ltd.n- Seymour Lipschutz, Data Structures, Schaum's Outline Series, Tata McGraw Hilln- Kruse, Data Structures & Program Design, Prentice Hall of India.n- R. S. Salaria, Test Your Skills in Data Structures","course outcomes":"At the end of the course student will be able to…n- Understand the efficient storage mechanisms of data for an easy access.n- Design and implementation of various basic and advanced data structures.n- Comprehend various techniques for representation of the data in the real world.n- Develop application using data structures.n- Understand the concept of protection and management of data.n- Implement various techniques for efficient storage and access of data."}
