{"course code":"ECPE43","course title":"Digital Design Using Verilog","number of credits":"03","prerequisites":"ECPC34","course type":"PE","branch":"ec","course learning objectives":"This course aims to provide students with the understanding of the different technologies related to HDLs, construct, compile and execute Verilog HDL programs using provided software tools. Design digital components and circuits that are testable, reusable, and synthesizable.Students are provided with access to the CAD tools to use hardware description language to model, analyze and design various digital circuits/systems.","course content":"## UNIT InnINTRODUCTION TO LOGIC DESIGN WITH VERILOG HDL: Evolution of CAD,nemergence of HDLs, typical HDL-based design flow, why Verilog HDL?, trends in HDLs. Evolution of CAD, emergence of HDLs, typical HDL-based design flow, why Verilog HDL?,nLANGUAGE CONSTRUCTS AND CONVENTIONS: Lexical conventions, data types, system tasks, compiler directives. Module definition, port declaration, connecting ports, hierarchical name referencing.nnn## UNIT IInnGATE LEVEL MODELING: AND Gate Primitive, Module Structure, Tri-State Gates, Array of Instances of Primitives, Design of Flip-flops with Gate Primitives, Delays, Strengths and Construction Resolution, Net Types, Design of Basic Circuits.nDATAFLOW MODELING: Continuous Assignment Structure, Delays and Continuous Assignments, operators, operands, operator types.nnn## UNIT IIInnBEHAVIORAL MODELING: Structured procedures, initial and always, blocking and nonblocking statements, delay control, generate statement, event control, conditional statements, multiway branching, loops, sequential and parallel blocks, Differences between tasks and functions, declaration, invocation, automatic tasks and functions.nVERILOG FOR FINITE STATE MACHINES: System Design using ASM Chart, Design and Synthesis of Datapath Controllers. Clocked Sequential Finite State Machines, Asynchronous Sequential Finite State Machines, Sequential Design using LSI & MSI circuits.nnn## UNIT IVnnADVANCED VERILOG TOPICS: Switch Level Modeling, User-Defined Primitives, Programming Language Interface, Advanced Verification Techniques.","reference books":"- Verilog HDL - Samir Palnitkar, 2nd Edition, Pearson Education, 2009.n- T.R. Padmanabhan, B Bala Tripura Sundari, Design Through Verilog HDL, Wiley 2009.n- Fundamentals of Digital Logic with Verilog Design - Stephen Brown, Zvonkoc Vranesic, TMH, 2nd Edition.n- Advanced Digital Design with Verilog HDL - Michel D. Ciletti, PHI,2009.n- Digital Design, 2/e, Frank Vahid, Wiley, 2011","course outcomes":"At the end of the course student will be able ton- Understand various programmable logic devices and EDA tools.n- Analyze various modeling styles in Verilog HDL and to design digital systems.n- Write Register Transfer Level (RTL) models of Digital Circuits.n- Understand advanced topic, testing strategies and construct test-benches in Verilog.n- Design combinational logic circuits using VHDL.n- Design sequential logic circuits using VHDL."}
