{"course code":"ECPE78","course title":"Nano Electronics","number of credits":"3","prerequisites":"PHIR11, PHIR13, ECIR11","course type":"PE","branch":"ec","course learning objectives":"The major goals and objectives are to provide the students with knowledge and understanding of nano-electronics and their applications in nanotechnology","course content":"## UNIT InnSurvey of modern electronics and trends towards nanoelectronics. Discussion of the International Technology Roadmap characteristics: Need for new concepts in electronics. From microelectronics towards biomolecule electronics. Introduction to particles and waves, Classical particles, Classical waves, Wave-particle duality.nnn## UNIT IInnIntroduction to Wave mechanics, Schrodinger wave equation, Wave mechanics of particles, Atoms and atomic orbitals. Introduction to Materials for nanoelectronics, Semiconductors, Crystal lattices: Bonding in crystals, Electron energy bands, Semiconductor heterostructures, Lattice- matched and pseudomorphicheterostructures, Inorganic-organic heterostructures, Carbon nanomaterials: nanotubes and fullerenes.nnn## UNIT IIInnIntroduction to Growth, fabrication, and measurement techniques for nanostructures, Bulk crystal and heterostructure growth, Nanolithography, etching, and other means for fabrication of nanostructures and nanodevices, Techniques for characterization of nanostructures, Spontaneous formation and ordering of nanostructures, Clusters and nanocrystals, Methods of nanotube growth, Chemical and biological methods for nanoscale fabrication, Fabrication of nano-electromechanical systems, Electron transport in semiconductors and nanostructures, Time and length scales of the electrons in solids, Statistics of the electrons in solids and nanostructures, Density of states of electrons in nanostructures, Electron transport in nanostructures.nnn## UNIT IVnnElectrons in traditional low-dimensional structures, Electrons in quantum wells, Electrons in quantum wires, Electrons in quantum dots, Closing remarks, Nanostructure devices, Resonant- tunneling diodes, Field-effect transistors, Single-electron-transfer devices, Potential-effect transistors, Light-emitting diodes and lasers, Nano-electromechanical system devices, Quantum- dot cellular automata.","reference books":"- C. P. Poole and F. J. Owens, Introduction to nanotechnology, John Wiley & Sons, 2003.n- C. Dupas, P. Houdy, M. Lahmani Nanoscience: Nanotechnologies and Nanophysics, Springer, 2004.n- Nanometer structures: theory, modeling, and simulation, Editor: AkhleshLakhtakia, ASME Press, 2004.n- S. E. Lyshevski, Nano- and micro-electromechanical systems fundamentals of nano and microengineering, 2nd Edition, CRC Press, 2004.n- http://idol.union.edu/~malekis/ESC24/ESC24MainPage/NanoMainPage.htmn- http://mrsec.wisc.edu/edetc/index.htmln- www.nanohub.org (SupriyoDatta and Mark Ludstrom lectures)","course outcomes":"At the end of the course student will be able ton- Understand basic and advanced concepts of nano-electronic devices.n- Understand the energy band structures of semiconductors.n- Understand the wave mechanics of semiconductor and nano-materials.n- Understand various Materials in the field nanoelectronics.n- Understand the techniques for characterization of nanostructures.n- Understand sensors, transducers, and their applications in nanotechnology."}
