{"course code":"ECPE76","course title":"Optical Communication","number of credits":"3","prerequisites":"PHIR 11, ECPC35, ECPC53","course type":"PE","branch":"ec","course learning objectives":"To provide good understanding of optical fiber and wireless optical communication systems.","course content":"## UNIT-InnBASICS OF OPTICAL FIBRE: Overview of optical fibers: basic optical laws and definitions, classifications of optical fibers. Modes in optical fibers, Single mode and multimode fibers. Fiber splices, connectors, and Couplers. Attenuation in optical fibers: Absorption losses, Scattering losses, Mode coupling loss, Leaky modes, and fiber bend losses. Dispersion in optical fibers: Effect of dispersion on pulse transmission and transmission rate, Material dispersion, Wave guide dispersion, Intermodal dispersion, Total dispersion.nnn## UNIT-IInnOPTICAL SOURCES AND DETECTORS: Light emitting diodes: Introduction, LED power and efficiency. LED structures- SLED, ELED, and SLD. LED optical output power, output spectrum and modulation bandwidth.nLASERs: LASER action in semiconductor LASERs, Semiconductor LASERs for optical communications. Optical Receivers: Principle of photodiodes, Photo detector responsivity, rise time and bandwidth. p – n photodiode, p-i-n photodiode, and MSM and Avalanche photo detectors. Photo detector noise, Avalanche multiplication noise. Comparison of photo detectors.nnn## UNIT-IIInnINTRODUCTION TO OPTICAL WIRELESS COMMUNICAION SYSTEMS: Wireless accessnschemes, brief history of OWC, OWC/Radio comparison, OWC application areas, OWC challenges. Indoor and outdoor OWC channels. Modulation techniques for OWC: Analog Intensity modulation, Pulse position modulation, Pulse interval modulation, Dual header PIM, Multilevel DPIM, Subcarrier Intensity modulation, optical polarization shift keying and orthogonal frequency division multiplexing (OFDM).nnn## UNIT-IVnnOWC LINK PERFORMANCE ANALYSIS: Indoor OWC link performance analysis, FSO link performance under the effect of atmospheric turbulence, outdoor OWC link with diversity techniques.","reference books":"- John M. Senior, “Optical Fiber Communications: Principles and Practice”, Pearson Education.n- G. P. Agrawal, “Fiber Optical Communication Systems,” Wiley Publication.n- Steve Hranilovic, “Wireless Optical Communication Systems,” Springern- Z. Ghassemlooy, W. P., S. Rajbhandari “Optical Wireless Communications,” CRC Presss, 2013.","course outcomes":"On successful completion of this course, students will be able to:n- Explain basics of optical fibre.n- Explain the principles, concepts and operation optical communication.n- Understand light propagation and different losses in optical fibre.n- Explain the concepts and operation of different optical sources.n- Explain the principles, concepts and operation of optical wireless communication.n- Analyze OWC link design and effect of atmosphere on it."}
