{"course code":"ECPE71","course title":"Digital Image Processing","number of credits":"03","prerequisites":"ECPC32","course type":"PE","branch":"ec","course learning objectives":"The student should be able to understand and apply the various concepts of Digital Image Processing.","course content":"## UNIT InnDIGITAL IMAGE FUNDAMENTALS: Elements of digital image processing systems, Elements of visual perception, brightness, contrast, hue, saturation, mach band effect, Color image fundamentals - RGB, HSI models, Image sampling, Quantization, dither, Two-dimensional mathematical preliminaries, 2D transforms - DFT, DCT, KLT, SVD, etc.nnn## UNIT IInnIMAGE ENHANCEMENT: Histogram equalization and specification techniques, Noise distributions, Spatial averaging, Directional Smoothing, Median, Geometric mean, Harmonic mean, Contraharmonic mean filters, Homomorphic filtering, Color image processing: basic concepts.nnn## UNIT IIInnIMAGE RESTORATION: Degradation model, Unconstrained restoration - Lagrange multiplier and Constrained restoration, Inverse filtering-removal of blur caused by uniform linear motion, Wiener filtering, Geometric transformations-spatial transformations, Image reconstruction from projection, Image compression; Huffman coding, Golomb coding, Arithmetic coding, LZW coding, etc, Digital watermarking.nnn## UNIT IVnnIMAGE SEGMENTATION: Edge detection, Edge linking via Hough transform, Thresholding, Region based segmentation ,Region growing , Region splitting and Merging , morphological image processing: basic concepts, Image representation and description.","reference books":"- Rafael C. Gonzalez, Richard E. Woods, Digital Image Processing, Pearson, 3rd Edition, 2009.n- Anil K. Jain, Fundamentals of Digital Image Processing, Pearson 2002.n- Kenneth R. Castleman, Digital Image Processing, Pearson, 2006.n- Rafael C. Gonzalez, Richard E. Woods, Steven Eddins, 'Digital Image Processing using MATLAB', Pearson Education, Inc., 2000.","course outcomes":"At the end of the course student will be able to:n1 Develop the understanding about digital image, HVS and its limitations. 2 Understand and apply the filtering.n- Apply the ‘Restoration Operation’.n- Understand and apply 2D mathematics to analyze the processing. 5 Apply the vector approach to handle the color images.n6 Apply the ‘Morphological operation’ for shape detection."}
