{"course code":"ECPE73","course title":"Satellite and Radar Engg.","number of credits":"3","prerequisites":"ECPC31, ECLR52 and ECPC51","course type":"PE","branch":"ec","course learning objectives":"To provide good understanding of radar systems, radar signal processing, radar target tracking, electronic navigational systems, and Satellite Communication systems.","course content":"## UNIT InnINTRODUCTION: Introduction to radar, radar block diagram and operation, radar frequencies, Applications of radar, Prediction of range performance, minimum detectable signal, receiver noise, probability density function, SNR, Integration of radar pulses, radar cross-section of targets, PRF and range ambiguities, transmitter power, system losses.nnn## UNIT IInnRADAR SYSTEMS AND TRAKING: Doppler Effect, CW radar, FM CW radar, multiple frequency CW radar. MTI radar, delay line canceller, range gated MTI radar, blind speeds, staggered PRF, limitations to the performance of MTI radar, non-coherent MTI radar.nTracking radar: sequential lobing, conical scan, monopulse: amplitude comparison and phase comparison methods, Radar antennas. Radar displays. Duplexer.nnn## UNIT IIInnINTRODUCTION TO SATELLITE AND THEIR ORBITS: Orbital aspects of Satellite Communication: Introduction to geo-synchronous and geo-stationary satellites, Kepler’s laws, locating the satellite with respect to the earth, sub-satellite point, look angles, mechanics of launching a synchronous satellite, Orbital effects, Indian scenario in communication satellites.nnn## UNIT IVnnTELEMETRY, TRACKING, CONTROL AND LINK DESIGN: Satellite sub-systems:nAttitude and Orbit control systems, Telemetry, Tracking and command control system, Powernsupply system, Space craft antennas, and multiple access techniques, comparison of FDMA, TDMA, and CDMA.nIntroduction to satellite link design, basic transmission theory, system noise temperature and G/T ratio, design of down link and uplink, design of satellite links for specified C/N, satellite data communication protocols.","reference books":"- Merril. I. Skolnik, Introduction to Radar Systems, MGraw Hill, 2nd Edition, 1981.n- Mark A. Richards, James A. Scheer and William A. Holm, Principles of Modern Radar: Basic Principles, Yes Dee Publishing Pvt. Ltd., India, 2012.n- Dennis Roddy, Satellite Communications, MGraw Hill, Millan, 4th Edition, 2013.n- Byron Edde, Radar: Principles, Technology, Applications, Pearson, 2008.n- D. C. Agarwal, Satellite Communications, Khanna Publications, Delhi.","course outcomes":"At the end of the course student will be able to:n- Explain radar and radar range equation.n- Explain the principles, concepts and operation of radar system.n- Understand CW, FMCW, MTI and tracking radar systems.n- Explain the principles, concepts and operation of satellite communication.n- Explain the concepts and operation of telemetry and command control for satellite communication.n- Describe the concepts of signal propagation affects, link design, rain fading and link availability and perform interference calculations"}
