{"course code":"EEIR 11","course title":"Familiarization to Electrical Engineering","number of credits":"02-0-0=02","prerequisites":"_","course type":"EIR","branch":"ee","course learning objectives":"- To provide basic knowledge of the different elements of electrical engineering field.n- To understand basic concepts of electrical engineering.","course content":"## UNIT-InnBasic Circuits & Measurements:nBasics of circuit theory, phasor representation of signals, properties of signal, Series and parallel circuit analysis with resonance, Three-phase systems, analysis of three phase circuits and their properties, Two wattmeter method. Magnetic circuits and their properties.nnn## UNIT-IInnElectrical Machines:nPrinciple and working of transformers, equivalent circuit, open circuit and short circuits tests, losses and efficiency. Principle and working of DC motors, DC generators, and induction motors (three phase and single phase), Basic calculations of these motors and generators, Characteristic curves, speed control of dc shunt motor, application of dc generators and motors.nnn## UNIT-IIInnPower Electronics and Power systems:nStructure of power system, Generation, Transmission and Distribution, , Single-line diagrams, Basics protection of power systems.nBasic Functions of Static Converters, Semiconductor switches.nnn## UNIT-IVnnControl SystemnConcept of control, control system terminology, classification of Control Systems, Open and closed loop systems.nReferences:n- V. Del Toro, “Principles of Electrical engineering”, PHI.n- E. Huges, “Electrical Technology”, ELBS.n- A. E. Fitzerald, D. E. Higginbotham and A. Grabel, “Basic Electrical Engineering”, MGH.n- PS Bhimbra.Power Electronics, Khanna Publishers.n- Klemens Heumann, Basic Principles of Power Electronics, Springer-Verlag Berlin Heidelberg.n- Nagrath and Gopal, Control System Engg, TMH.n- IJ Nagrath and DP Kothari,”Power System Engineering” Tata McGraw-Hill.","course outcomes":"Students who successfully complete the course will be able to:n- Understand basic principle and operation of electric circuits and machines.n- Solve basic problems related to electrical circuits and machines.n- Explain the operation of different electrical technologies.n- Demonstrate an understanding of the control systems."}
