{"course code":"EELR26","course title":"Electrical Machines-II Lab","number of credits":"0-0-2=1","prerequisites":"EEPC 23","course type":"PC","branch":"ee","course outcomes":"Course Learning Outcomes:nThe main objective of the course is to:n1. Understand the concepts of induction machines and synchronous machines by performing various experiments and tests in the laboratory.nList of Experimentsn- (a) To conduct running light test on a three phase squirrel cage induction motor and measure and plot input current , power, power factor at different values of applied voltage.n- To conduct blocked rotor test and measure stator winding resistance.n- Draw equivalent circuit diagram of the motor and compute the performance at slip of 5%.n- To conduct direct load test on three phase squirrel cage induction motor and plot input current, torque, power factor, speed and efficiency Vs output power.n- Quadrature axis reactance of a synchronous machine:nConduct the maximum lagging current test on the machine running as motor and plot variation of armature current Vs field current (reduced to zero, reversed and then increased). Estimate the values of Xqn- Synchronous impedance of a synchronous machine:nnnnObtain O.C.C and S.C.C at rated speednnnDraw the variation of synchronous impedance with field current and determine the value of SCR.nnnEstimate the full load regulation at 0.8 pf (lagging and leading) by E.M.F and M.M.F methods. Compare the results.n- Obtain O.C.C and S.C.C at rated speedn- Draw the variation of synchronous impedance with field current and determine the value of SCR.n- Estimate the full load regulation at 0.8 pf (lagging and leading) by E.M.F and M.M.F methods. Compare the results.n- Zero pf characteristics of synchronous machine:nnnnObtain full load ZPF lagging characteristics of a synchronous machine.nnnObtain O.C.C. and field excitation to circulate the rated current during short circuit test.nnnDraw the Potier triangle and estimate the full load regulation using Potier method at 0.8 pf (lagging and leading).n- Obtain full load ZPF lagging characteristics of a synchronous machine.n- Obtain O.C.C. and field excitation to circulate the rated current during short circuit test.n- Draw the Potier triangle and estimate the full load regulation using Potier method at 0.8 pf (lagging and leading).n- V-curves for synchronous machines:nRun the machine as the motor and plot the variation of armature current Vs excitation at different loads.n- Slip test on salient pole machines:nConduct the test at different values of slip not exceeding 5 %and find out Xd and Xq using recorded data.n- To run the induction machine as a self-excited induction generator and plot the variation of terminal voltage and frequency Vs speed for different excitation capacitances.n- To determine the rotor resistance of a three phase squirrel cage induction motor by performing variable frequency blocked rotor test.n- To start, run and reverse a single phase capacitor start induction motor. Perform running light and block rotor tests to determine its equivalent circuit parameters. Compute its performance at a slip of 5%.nAfter the completion of the course the student will be able to,n- Understand the constructional details and principle of operation of AC Induction and Synchronous Machines.n- Perform various tests on induction synchronous machines to determine their parameters practically.n- Analyze the performance of the AC Induction and Synchronous Machines using the phasor diagrams and equivalent circuits.n- Select appropriate AC machine for any application and appraise its significance."}
