{"course code":"EELR21","course title":"Electrical Machines-I Lab","number of credits":"0-0-2=1","prerequisites":"EEPC 10","course type":"PC","branch":"ee","course learning objectives":"The main objective of the course is to:n- Understand the concepts of DC machines and transformers by performing various experiments and tests in the laboratory.nList of Experimentsn- To separate hysteresis and eddy current losses of a single phase transformer at rated voltage and frequency by conducting no load test at different frequencies keeping v/f ratio constant.n- To operate two single phase transformer of different KVA rating in parallel and plot the variation of current shared by each transformer vs load currentn- To conduct Sumpner’s test on two identical single phase transformer. Also to determine and plot the efficiency with pf 0.9 lagging load.n- To perform direct load test on dc shunt motor and plot variation of input current, speed, torque and efficiency against output power.n- To obtain magnetization characteristics of DC m/c. determine the critical field resistance of DC shunt generator, measure field and armature winding resistance. Derive external characteristics of shunt generator using experimental data as obtained above.n- To make Scott connection of two single phase transformer and to verify the current relation by drawing phasor diagram for balanced and unbalanced resistive loads.n- To conduct open and short circuit test on 3-phase transformer and determine the equivalent circuit parameters in per unit.n- To conduct Swinburne test on DC shunt motor. Compute and plot efficiency as motor for various loads.n- To conduct load test on DC compound generator withnnnnShunt field alonennnCumulative and differential connections Plot the resultsn- Shunt field alonen- Cumulative and differential connections Plot the resultsn- To study the three point starter DC m/c. speed control of DC shunt motor using armature and field control. Plot the variation of speed with added resistance.","course outcomes":"After the completion of the course the student will be able to,n- Evaluate the performance of transformers using the parameters calculated experimentally.n- Analyze the performance of the DC Machines under various operating conditions by obtaining their characteristics.n- Understand various speed control methods for DC machines."}
