{"course code":"EELR35","course title":"Special Machines and Drives Lab","number of credits":"0-0-2=1","prerequisites":"EEPC 23, EEPC 29, EEPC 26, EEPC 28","course type":"PC","branch":"ee","course learning objectives":"The main objective of the course is to:n- Analyze most of the widely used converters for dc motorsn- Understand the performance of various motors and their characteristics.n- Learn various control methods for dc and ac drivesn- Learn the modeling and simulation of drives.nList of Experimentsn- To perform electrical breaking of DC shunt motor. Discuss the results of various types of electrical breaking.n- Variable frequency control of three phase induction motor. Plot variation of speed and input power with frequency for constant voltage and constant (voltage/frequency) modes. Discuss the results.n- To study the effect of injected EMF in electrical machines. Plot the variation of speed with injected EMF in case of Schrage motor and discuss the results.n- Inrush current simulation for squirrel cage induction motor using MATLAB.n- Performance of chopper fed DC motor drive using PSIM .n- To perform electrical breaking of three phase induction motor. Discuss the results for various types of electrical breaking.n- Performance of unbalanced supply operation of three phase induction motor using MATLAB.n- Performance of voltage controlled induction motor using PSIM.n- Rotor resistance control of three-phase slip-ring induction motor. Plot the variation of speed and starting current with external resistance in the rotor circuit. Discuss static rotor resistance control for such motors.n- To plot load characteristics of DC series motor. Discuss the results and applications of this machine. Explain static control of this motor.","course outcomes":"After the completion of the course the student will be able to,n- Describe the operation of different speed control techniques of ac and dc motorsn- Explain the characteristics of ac and dc drives.n- Analyse the performance of a drive."}
