{"course code":"EELR28","course title":"Power Electronics-II Lab","number of credits":"0-0-2=1","prerequisites":"EEPC-24, EEPC-23, EEPC-26","course type":"PC","branch":"ee","course learning objectives":"The main objective of the course is to:n- Understand the operation of power electronic converters by performing various experiments and tests in the laboratory.nList of Experimentsn- To study the performance of single-phase half-wave and full-wave uncontrolled rectifiers.n- To study different firing circuits and Commutation of SCR.n- To study following protection circuits of SCR (i) dv/dt, (ii) di/dt, (iii) Over voltage, (iv) Over currentn- To study the characteristics of a Thyristor and a Triac.n- To study firing circuit of SCR using (a) ramp-comparator scheme, (b) cosine-wave scheme,n(c) Op-amps and Gates.n- To study digital firing circuit of SCR.n- To study operation of Triac in all four modes and study AC phase control using Triac.n- To study the operation of full-wave phase control of an A.C. load using parallel – connected SCR’s.n- To study the operation of single-phase full- wave phase control of a D.C. load usingnnnna fully-controlled full-wave rectifier.nnna half-controlled full-wave rectifier.n- a fully-controlled full-wave rectifier.n- a half-controlled full-wave rectifier.n- To study the D.C. circuit breaker.n- To study the zero voltage switching.n- To study the UJT Chracteristics and relaxation Oscillator.n- To study (i) the U J T trigger circuit of S C R ii ) the P U T trigger circuit of S C Rn- To study speed control of a D.C. motor using single-phase half and fully controlled bridge converters.n- To study speed control of a D.C. motor using three-phase half and fully controlled bridge converters.n- To study speed control of a D.C. motor by thyristor chopper.n- To study cycloconverter based speed control of a 3-phase induction motor.","course outcomes":"After the completion of the course the student will be able to,n- Explain the operation of different power electronic devicesn- Show the operation by performing experiments."}
