{"course code":"EEPC21","course title":"Control Systems - I","number of credits":"3-1-0=04","prerequisites":"EEPC10; EEPC14","course type":"PC","branch":"ee","course learning objectives":"- To study the fundamental concepts of control system problems and their solution possibilities,n- To study about the mathematical modelling of the various physical systems,n- To study the concept of time-domain response (transient and steady-state response) and frequency-domain analysis of the systems,n- To study the basics of stability analysis of the systems,n- To study about the specifications of controller and compensator design and its implementations.","course content":"## UNIT-InnMOTIVATION, MODELS AND PHYSICAL SYSTEMSnIntroduction to Control System: The control problem and solution possibilities, the notion objectives/ specifications, feedback as natural strategy, regulation, set-point and tracking problems, concept of stability.nTransfer Function: Definition, examples with mechanical, electrical, hydraulic, pneumatic systems and systems with dead zone.nDescription of Control System Components: Error detectors, gears, gyroscope, DC motors, servomotors, techo-generators, servo amplifiers, synchros; block diagram and reduction techniques, signal flow graphs, mason’s gain formulae, performance of feedback Systems.nnn## UNIT-IInnTIME-DOMAIN ANALYSISnTransient Response Analysis: Transient and steady-state response analysis for first and second order systems and their qualitative analysis; impact of close looping on system parameters and their sensitivity, error analysis and error constants.nRoot Locus Analysis: Development of root loci, root motions under close-looping, effects of pole/zero on loci, effect of rate and reset times, stability, relative stability and time-domain specification using root locus.nnn## UNIT-IIInnFREQUENCY-DOMAIN ANALYSISnStability Analysis: Routh’s array analysis; Routh-Hurwitz stability criterion, relative stability and frequency-domain specifications analysis using Bode plots, Nichols plot, Polar plots, Nyquist plot; M and N circles.nnn## UNIT-IVnnCONTROLLER/ COMPENSATOR DESIGNnController Design: Specifications of time-domain and frequency domain and interrelation between them; design of P, PD, PI, PID error control strategies; impact on transient response and steady-state response.nCompensator Design: Lead, lag and lag-lead compensation, compensator design using root-locus and frequency response methods; role of gains; role of phase.nReferences:n- D’ Azzo and Houpis, Linear Control Systems Analysis and Design, McGrow Hill, Edition No. 05, 2003.n- Katsuhiko Ogata, Modern Control Engineering, Pearson Education, Edition No. 05, 2010.n- M. Gopal, Control Systems Principles and Design, Tata McGrow Hill, Edition No. 04, 2010.n- N. S. Nise, Control Systems Engineering , Wiley, Edition No. 07, 2015.n- Dorf and Bishop, Modern Control Systems, Addison Wesley,Edition No. 13, 2017.n- Nagrath& Gopal, Modern Control Engineering, New Ages International, Edition No. 05, 2010.n- Raymond T. Stephani, Design of Feedback Control Systems, Oxford University Press, Edition No. 04, 2002.","course outcomes":"At the end of the course student will haven- Fundamental knowledge of control system, mathematical modelling of various physical systems,n- Determine the response of first and second order systems for various inputs,n- Analyze the transient and steady-state response open-loop and closed-loop systems,n- Analyze the stability of the in time-domain as well as in frequency-domain,n- Design and implementation of P, PD, PI, PID controllers and lead, lag and lag-lead compensators."}
