{"course code":"EEPC26","course title":"Electrical Machines-II","number of credits":"3-1-0=4","prerequisites":"EEPC 23","course type":"PC","branch":"ee","course learning objectives":"The objective of the course is to impart knowledge of the constructional features and principle of operation of different types of induction and synchronous machines. The course also deals with the methods of starting and speed control of induction motors.","course content":"## UNIT-InnBasic Concepts in A.C. Machines: Classification of A.C. Machines, principle of operation and constructional features of synchronous and induction machines, rotating mmf waves in A.C. Machines.nArmature Windings: Introduction, ac machine windings, winding factors, the emf equation, harmonics in generated emf, causes of harmonics and their suppressions.nnn## UNIT-IInnSynchronous Machines: Construction, types, armature reaction, circuit model of synchronous machine, determination of synchronous reactance, phasor diagram, power angle characteristics, parallel operation of synchronous generators, synchronizing to infinite bus bars, synchronous motor operation, characteristic curves, synchronous condenser.nnn## UNIT-IIInnThree phase Induction (Asynchronous) Motor: Types of induction motor, flux and mmf waves, development of circuit model, power across air gap, torque and power output, oc and sc tests, circle diagram, starting methods, cogging and crawling, speed control, deep bar/ double cage rotor, induction generator, induction machine dynamics, high efficiency induction motors.nnn## UNIT-IVnnFractional Kilowatt Motors: Introduction, single phase induction motors, double revolving field theory, circuit model of single phase induction motor, determination of circuit parametersnReferences:n- Arthur Eugene Fitzgerald and Charles Kingsley, ‘Electric Machinery’, Tata McGraw Hill Education Publicationsn- Miller, T.J.E., ‘Brushless Permanent Magnet and Reluctance Motor Drives’, Clarendon Press.n- P.S. Bhimbra, ‘Electrical Machinery’, Khanna Publications.n- Nagrath, I.J. and Kothari, D.P., ‘Electrical Machines’, Tata McGraw Hill Education Private Limited Publishing Company Ltd.n- M. G. Say, ‘Performance and Design of Alternating Current Machines’, CBS Publishers & Distributors Pvt. Ltd., New Delhi.","course outcomes":"Upon completion of the course, the students will be able ton- Understand the constructional details and principle of operation of AC Induction and Synchronous Machines.n- Analyze the performance of the AC Induction and Synchronous Machines using the phasor diagrams and equivalent circuits.n- Select appropriate AC machine for any application and appraise its significance."}
