{"course code":"EEPC22","course title":"Network Synthesis and Filters","number of credits":"3-1-0=4","prerequisites":"EEPC10","course type":"PC","branch":"ee","course learning objectives":"The course is aimed at imparting talent into the student for transforming mathematical equations into physical electrical networks, impart fundamentals of the magnitude and phase considerations of electrical circuits followed by the design of electric filters to achieve desired magnitude and phase over pre-specified band of frequencies. The learner will learn the behavior of impedance matching and phase shifting networks.","course content":"## UNIT-InnFundamental Concepts: Energy considerations, positive real condition, Hurwitz polynomials,nBounded realness, scattering description of networks.nnn## UNIT-IInnLossless one port network functions, Foster reactance functions and theorem, canonical forms: Cauer’s and Foster’s, Synthesis of lossless LC Immitance functions, Synthesis of lossyRL and RC functions, Certain RLC function realizations. Fundamentals of two port network synthesis.nnn## UNIT-IIInnPassive Filter Design: Analysis and Design of Constant K and m-derived filters,nActive Filter Design: Amplitude and phase functions, amplitude approximations, phase approximations, simultaneous amplitude and phase approximations, Group delay response, equi- distant linear phase approximations.nnn## UNIT-IVnnMaximally flat and Equi-ripple filters, Magnitude and frequency normalizations, frequency transformations; High Pass, Band-Pass, Band-stop filters,nImpedance matching networks, Phase shift networks.nReferences:n- H. Baher, “Synthesis of Electrical Networks”, John Wiley & Sons, 1984.n- Franklin Kuo, “Network Analysis and Synthesis”, Second Edition, Wiley, 2009.n- Steve Winder, “Analog and Digital Filter Design”,Newnes, Elsevier Science, 2002.","course outcomes":"The students shall be able ton- Transform the mathematical driving point or transfer relations into realizable electrical circuits.n- Think and design analog electric filters."}
