{"course code":"EEPC31","course title":"Power Engineering-III","number of credits":"3-1-0=4","prerequisites":"EEPC10, EEPC27","course type":"PC","branch":"ee","course learning objectives":"To model various power system components and carry out load flow, short circuit and stability studies","course content":"## UNIT InnModeling of power system components - single line diagram –per unit quantities – bus impedance and admittance matrix, network matrices using graph theory, primitive networks, singular and non- singular transformation.nnn## UNIT IInnPower flow analysis methods -Ybus formulation, Gauss- Seidel, Newton-Raphson and Fast decoupled methods of load flow analysisnnn## UNIT IIInnFault studies - Symmetrical fault analysis, Analysis through impedance matrix, Current limiting Reactors, Fault analysis – Symmetrical components theory, Transformation matrix, Unsymmetrical short circuit analysis- LG, LL, LLG using matrix method,n– Algorithm for Zbus formulation. Analysis of symmetrical and un-symmetrical faults through Zbus matrixnnn## UNIT IVnnStability studies - Steady state and transient stability – Swing equation - Equal area criterion, Transient stability algorithm using modified Euler‘s method and fourth order RungeKutta method,– multi-machine stability analysisnReferences:n- John .J.Grainger&Stevenson.W.D., ' Power System Analysis', McGraw Hill, 1st Edition 2003.n- D P Kothari, I J Nagrath‘Modern Power System Analysis’, 3rd Edition, 2011.n- HadiSaadat, ‘Power System Analysis ’, Tata McGraw - Hill Education, 2nd Edition, 2002.n- Stagg and El Abiad, Computer Methods in Power Systems Analysis, McGraw Hill ISE, 1986.n- M.A.Pai: Computer Techniques in Power System Analysis, Tata McGraw-Hill Education- 2005. 3. 6. K.U.Rao: Computer Methods and Models in Power Systems, I.K.InternationalPvt.Ltd.2009.n- J. Duncan Glover, M.S.Sarma& Thomas J. overbye, ‘Power system analysis and design’, 5th Edition, 2011.n- J.C.Das, ‘Power System Analysis’, Short-Circuit Load Flow and Harmonics’, 1st Edition, 2002.n- Arthur R. Bergen, ‘Power System Analysis’, Peterson Education India, 2nd Edition, 2009.","course outcomes":"Upon completion of this course, students will be able ton- Carry out load flow study of a practical systemn- Simulate and analyze faultn- Study the stability of power systems"}
