{"course code":"EEPC 23","course title":"Electrical Machines-I","number of credits":"3-1-0=4","prerequisites":"EEPC 10","course type":"PC","branch":"ee","course learning objectives":"- Understanding basic principles of energy conversion in electromechanical systems, construction and operation of dc machines in motoring and generating modes.n- Comprehend the magnetizing characteristics and operation of single phase as well as the three-phase transformers.","course content":"## UNIT-InnElectromechanical Energy Conversion PrinciplesnEnergy in a magnetic systems, field energy and mechanical force, energy in singly and multiply excited magnetic systems, determination of magnetic force and torque from energy and co-energy, Forces and torques in magnetic field systems, dynamic equations of electromechanical systems and analytical techniques.nSingle Phase TransformernTransformer construction, Ideal and practical trans former, exact and approximate equivalent circuits, no load and on load operation, phasor diagrams, power and energy efficiency, voltage regulation, parallel operation, effect of load on power factor, Per Unit system, excitation phenomenon in transformers, switching transients, Auto transformers, Variable frequency transformer, voltage and current transformers, welding transformers, Pulse transformer and applications.nnn## UNIT-IInnThree Phase TransformersnConstructional features of three phase transformers, Cooling methodology, Standard and special transformer connections, Phase conversion, Parallel operation of three phase transformers, three winding transformers and its equivalent circuit, On load tap changing of transformers, Modern trends in transformers, Type and routine tests, Standards.nnn## UNIT-IIInnDC GeneratorsnConstruction of armature and field systems, Working, types, emf equation, self- excitation build up, Armature windings, Characteristics and applications, Armature reaction - Demagnetizing and Cross magnetizing mmfs and their estimation; Remedies to overcome the armature reaction; Commutation process, Causes of bad commutation and remedies.nnn## UNIT-IVnnD.C. Motors:nPrinciples of working, Significance of back emf, Torque Equation, Types and Characteristics of DC Motors, Starting of DC Motors, Speed Control, Losses and Efficiency, Braking of DC Motors, Effect of saturation and armature reaction on losses; Applications.nReferences:n- A.E. Fitzgerald and Charles Kingsley, ‘Electric Machinery’, Tata McGraw-Hill Education Publications.n- Vincent Del Toro, ‘Electrical Engineering Fundamentals’, 2nd Edition, Prentice Hall Publications.n- P.S. Bhimbra, ‘Electrical Machinery’, Khanna Publications.n- Nagrath, I.J. and Kothari, D.P., ‘Electrical Machines’, Tata McGraw-Hill Education Private Limited Publishing Company Ltd.","course outcomes":"Upon the completion of the course, the student will be able ton- Understand the constructional details and principle of operation of DC machines and transformers.n- Analyze the performance of the DC Machines under various operating conditions using their various characteristics.n- Evaluate the performance of Transformers using phasor diagrams and equivalent circuits.n- Select appropriate DC motor as well as to choose an appropriate method of speed control for any industrial application."}
