{"course code":"EEPC24","course title":"Power Engineering-II","number of credits":"3-1-0=4","prerequisites":"EEPC27","course type":"PC","branch":"ee","course learning objectives":"To give a broad coverage on all types of protective relays, circuit breakers and provide a strong background for working in a practical power system protection system.","course content":"## UNIT InnIntroduction, arcing in circuit breakers, arc interruption theories, re-striking and recovery voltage, resistance switching, current chopping, interruption of capacitive current, oil circuit breaker, air blast circuit breakers, SF6 circuit breaker, vacuum CBs, operating mechanism, selection of circuit breakers, high voltage d.c. breakers, ratings of circuit breakers, testing of circuit breakers.nnn## UNIT IInnRelays – General classification, Principle of operation, types, characteristics, Torque equation, Relaying Schemes, Relay Co- ordination.nApparatus and line protection – Line Protection – Distance, Differential protection and Carrier current protection. Generator protection – protection against abnormal condition, stator and Rotor protection. Transformer Protection – Incipient fault – Differential protection,nFeeder and Bus bar protection.nnn## UNIT IIInnProtection against over voltages – Causes of over voltage Ground wires, Surge absorbers and Diverters, Earthling – types, Insulation coordination.nnn## UNIT IVnnStatic relays – Digital relays - Microprocessor based relays – Apparatus and line protection – Basics of Numerical relays.nReferences:n- Badri Ram and Vishwakarma, D.N., 'Power System Protection and Switchgear', Tata- McGraw Hill publishing company Ltd., 2nd Edition, 2011.n- Ravindranath B., and Chander, N., ‘Power Systems Protection and Switch Gear', Wiley Eastern Ltd., 1st Edition, 1977.n- Sunil S.Rao, 'Protective Switch Gear', Khanna Publishers, New Delhi, 13th Edition, 2008.n- Y. G. Paithangar, ‘Fundamentals of power system protection’, PHI Learning Private Limited, 2nd Edition, 2010.","course outcomes":"Upon completion of the course the students would be able ton- Classify and describe the working of various relaying schemes.n- Identify and implement an appropriate relaying schemes for different power apparatus.n- Illustrate the function of various CBs and related switching issues.n- Describe the causes of overvoltage and protection against overvoltage."}
