{"course code":"EEPC12","course title":"Measurement and instrumentation","number of credits":"3-0-0=3","prerequisites":"--","course type":"PC","branch":"ee","course learning objectives":"- To develop an understanding of the fundamentals of measurements.n- To be able to make measurement of voltage, current phase and frequency by analog and digital techniques.n- To know about the function of construction and synchronization of C.R.O.n- To understand the recorders and Telemetry and data acquisition.n- To make studies about the various transducers for measurement of position, force, pressure, temperature, torque, flow, velocity etc.","course content":"## UNIT-InnError analysis, Concepts and introduction to analog measurement of voltage, current, energy, phase and frequency, CRO.nnn## UNIT-IInnMeasurement of low, medium and high resistances, Concept of AC bridges for measurement of inductance and capacitance, Instrument transformers; Current transformer and potential transformer, their performance characteristics.nnn## UNIT-IIInnDigital Instruments, Analog to digital (A/D) and digital to analog (D/A) conversion, digital voltmeter and ammeter, digital frequency meter, digital energy meter, and digital wattmeter, Data acquisition (Analog and digital), Telemetry and recordersnnn## UNIT-IVnnTransducers: Classification, transducers for measurement of position, force, pressure, temperature, torque, flow, velocity (linear and angular) strains, humidity, vibrations and pH value.nReferences:n- AK Sawhney, “Electrical and Electronic Measurements &amp;Instrumentation”,Dhanpat Rai, Delhi.n- C.T. Baldwin , “Fundamentals of Electrical Measurement”, Lyall Book Depot.n- E.W. Golding, “Electrical Measurement”.n- W.D. Cooper- “Electronics Instrumentation and Measurement Techniques”, Prentice Hall India.n- B.C. Nakra and K.K. Chaudhry- “Instrumentation Measurement and Analysis”, Tata Mc-Graw- Hill Publishing Company Limited, New Delhi.","course outcomes":"On successful completion of this course students will able ton- Measure voltages and current.n- Know the properties of digital instruments.n- Measurement with C.R.O and its synchronization.n- Measurement of phase and frequency.n- Transducers and its applicationsn- Knowledge of data acquisition system."}
