{"course code":"EEPC33","course title":"Microprocessors and Microcontrollers","number of credits":"3-1-0=4","prerequisites":"EEPC25","course type":"PC","branch":"ee","course learning objectives":"- To study the Architecture of 8085 & 8086, 8051n- To study the addressing modes & instruction set of 8085 & 8051.n- To introduce the need & use of Interrupt structure 8085 & 8051.n- To develop skill in program writing for 8051 & 8085 and applicationsn- To introduce commonly used peripheral / interfacing ICs","course content":"## UNIT-InnMicroprocessor Architecture:n8085 microprocessor architecture, timing and control unit, machine cycles, interrupt diagram.Programming:nAddressing modes, instruction set, assembly language programming, program for multibyte addition/subtraction, multiplication, division, block transfer.nnn## UNIT-IInnInterfacing:nBasic principles of interfacing memory and I /O devices. Data transfer techniquesn- programmed interrupt and DMA.Details of interfacing devices 8255 and 8253.Interfacing of D/A and A/D converter.nnn## UNIT-IIInnMicrocontroller:nArchitecture of 8051 microcontroller. Interrupt, serial and timer control. Instruction set and programming. Interfacing with D/A and A/D converter.nnn## UNIT-IVnnSemi-Conductor Memory:nRead only memories, random access memories. Interfacing of memories with 8085.Architecture of 8086 microprocessor.nReferences:n- R.S. Gaonkar, “Microprocessor Architecture, Programming andApplications”, Penram International.n- A.P. Mathur, “Introduction to Microprocessor”.n- K.J. Ayala, “8051 Microcontroller”, Penram International.n- D.V. Hall, “Advanced Microprocessor”.n- Muhammad Ali Mazidi and Mazidi: The 8051 Microcontrollers and Embedded systems, PHI, 2008nCourse OutcomenAt the end of the course, student will be able to:n- Develop basic understanding of microprocessor architecture.n- The students will be able to design and implement programs on 8085 microprocessor and 8051 microcontrollern- Understand concept of interfacing of peripheral devices and their applications"}
