{"course code":"EEPC 37","course title":"Special Machines and Drives","number of credits":"3-1-0=4","prerequisites":"EEPC 23, EEPC 29, EEPC 26, EEPC 28","course type":"PC","branch":"ee","course learning objectives":"Main Objective of the course is to make the students familiar with Industrial motors and application of various static devices for the control of electrical machines.","course content":"## UNIT-InnElectrical Machines: Construction, working, characteristics and applications of following electrical machines;nStepper Motor, Brushless DC motor, Servomotors, Shaded Pole Motor, Reluctance Motor, Hysteresis Motor, Single Phase Series Motor, Repulsion Motor, Schrage Motor, Linear Induction Motor.nnn## UNIT-IInnEnergy Efficient Machines, Nonrated Voltage Operation of Induction Motors, Induction Regulators Asynchronous Generators: Comparison with Conventional Generators, Operating Modes, Modelling of Magnetization Curve, Steady State Analysis, Applicationsnnn## UNIT-IIInnElectrical Drives:Introduction, Torque Equation, Multi-quadrant Operation of Electrical Drives, Duty Cycles, Selection of Rating of Electrical Motor, Electrical Braking of Machines, Constant Torque and Constant Power Drives, Rotor Energy Loss of Cage Induction Motors: During Acceleration, Stop and Reversal of Speed, Time taken during accelerationnnn## UNIT-IVnnSlip Power Recovery Drives: Concept of Slip Power in Induction Motors, Static Kramer and Sherbius Drives, Static Rheostatic Control of Induction motors, Voltage and Frequency Controlled Induction Motor DrivesnReferences:n- M G Say, Theory Performance and Design of AC Machines, CBS Publishers.n- Alexander S Lansdorf, AC Machines, CBS Publishers.n- Ashfaq Hussain, Electric Machines ,Dhanpat Rai & Co.n- Nagtarth andKothari, Electric Machines, Tata Mc-Graw Hill Publication.n- Syed A Nasar, Electric Machines and Power Systems, Tata McGraw Hill Publication.n- Bimal K Bose, Modern Power Electronics and AC Drives. PHI Publicationn- G K Dubey, Fundamentals of Electrical Drives, Narosa Publication.","course outcomes":"After the completion of the course students will be able to,n- Describe various industrial motors and drive systems.n- Apply knowledge of power electronics to drive systems.n- Learn speed control of induction motor drives in an energy efficient manner using power electronics."}
