{"course code":"EEPC 10","course title":"Electrical Circuits and Networks","number of credits":"3-1-0=4","prerequisites":"--","course type":"PC","branch":"ee","course learning objectives":"- Understand about the network elements, network theoremsn- Understand the fundamentals of non-linear circuits, transient response, and resonance concept.n- Gain knowledge about the two-port networks.n- Gain knowledge about synthesis of RL,RC & RLC networks","course content":"## UNIT-InnClassification of circuits, sources and signals, standard signals, source transformations, Network topology, graph matrices, formulation and solution of circuit equations based on graph theory using different analysis techniques- circuit, cut set and mixed. Concept of duality, Network theorems and their applications- Superposition, reciprocity, Thevenin, Norton, Maximum power transfer, Millman, Substitution, Compensation and Tellegan’s theorem.nnn## UNIT-IInnIntroduction to non-linear circuits and their analysis. Analysis of circuits with dependent sources, Time constants and Transient response under d.c. and a.c. excitation. Analysis of magnetically coupled circuits, Series and parallel resonance circuits, bandwidth and Q-factor, response with variation in parameters and frequency.nnn## UNIT-IIInnConcept of one port, two-port networks, characteristics and parameters, interrelationships of parameters, image & iterative impedance, concept of characteristic impedance, scattering parameters, insertion loss, interconnection of 2-port networks, analysis of terminated 2-port networks, extensions to multiport networks.nnn## UNIT-IVnnGeneralized network functions (Driving point and Transfer), concepts of poles and zeros, determination of free and forced response from poles and zeros, concept of minimum phase networks, analysis of ladder, lattice, T and bridged-T networks.Network synthesis- Synthesis problem formulation, properties of positive real functions, hurwitz polynomials, properties of RC, LC and RL driving point functions, Foster and Cauer synthesis of LC and RC circuits.nReferences:n- Vanvalkenburg. M.E, ”Network Analysis”, PHI, 3rd Edition, 2014.n- Franklin. F, Kuo, ”Network Analysis and Synthesis”, 2nd Edition, Wiley India Ltd., 2006n- Ghosh &. S.P, Chakraborthy. A.K “Network Analysis and Synthesis” McGraw Hill, 2010","course outcomes":"At the end of the course student will be able ton- Understand the fundamental of network theorems.n- Apply the knowledge of network analysis in technical problem solvingn- Understand the impact of network synthesis and can apply in various engineering problem"}
