{"course code":"EEPC27","course title":"Power Engineering-I","number of credits":"3-1-0=4","prerequisites":"EEPC10, MAIR11, MAIR12","course type":"PC","branch":"ee","course learning objectives":"- To understand the working of different types of power generation systemsn- To realize the necessity for interconnected operation of different power stations.n- Identify major components of power transmission and distribution systems.n- Describe the principle of operation of transmission and distribution equipment.n- Know and appreciate the key factors in equipment specification and network design.","course content":"## UNIT InnHydro-electric, Thermal steam power plants, Nuclear power plants – selection of site, elements of power plant, working and classification,nRenewable power plants – Solar power generation – Photo-voltaic and solar thermal generation – solar concentrators, Wind power generation – types of wind mills, wind generators, tidal, biomass, geothermal and magneto-hydro dynamic power generation, micro-hydel power plants, fuel cells and diesel and gas power plantsnnn## UNIT IInnCombined operation of power plants – plant selection, choice of size, real and reactive power exchange among interconnected systems. station control - switch yard and control room. Economic considerations – types of costs, tariff mechnaism.nnn## UNIT IIInnTransmission line parameters – Resistance, Inductance and Capacitance calculations – single phase and three phase lines – double circuit lines – effect of earth on transmission line capacitancenPerformance of transmission lines – Regulation and efficiency – Tuned power lines, Power flow through a transmission line – Power circle diagrams.nSag and tension calculation – Line supports – Insulators, Voltage distribution in suspension insulatorsn–– string efficiency – effects of wind and ice loading.nnn## UNIT IVnnBasics of distribution networks, – Recent trends in transmission and distribution systemsnPower system deregulation (Qualitative treatment only) Introduction - Power system restructuring models- responsibilities and functions of independent system operator (ISO) – Ancillary ServicesnReferencesn- D. P. Kothari and IJ Nagrath, ‘Power System Engineering’, Tata Mcgraw – Hill, 2nd Edition, 2008.n- Singh S N, ‘Electric Power Generation Transmission and distribution’, PHI India, 2nd Edition,2008n- Chakrabarti A., Soni M.L., Gupta P.V., and Bhatnagar U.S., 'A Text Book on Power Systems Engg', Dhanpat Rai and Sons, New Delhi, 2nd Revised Edition, 2010.n- B.R.Gupta, ‘Generation of Electrical Energy’, S. Chand Limited, 2009.n- Wadhwa, C.L., ‘Generation Distribution and Utilisation of Electrical Energy', New Age International Publishers, 3rd Edition, 2010.n- Mohammad Shahidehpour, Hatim Yamin, ‘Market Operations in Electric Power Systems’, John Wiley & Sons Inc., 2002.","course outcomes":"Upon completion of this course, students will be able ton- Understand the major components of Transmission and Distribution Systems (TDS) and its practical significancen- Good Knowledge of various equipment specifications and design for TDSn- Awareness of latest technologies in the field of electrical transmission and distribution.n- Appreciate the different types of tariff, consumers and different types of power generation plants.n- Determine the significance of various components of the power generation plants.n- Correlate the importance of interconnected operation of different power generation systems.n- Plan an appropriate scheduling of electric power to satisfy the demand constraint"}
