{"course code":"EEPC25","course title":"Electronics Devices and Circuits","number of credits":"3-1-0=4","prerequisites":"EEIR11, EEPC10","course type":"PC","branch":"ee","course learning objectives":"To prepare students to perform the analysis and design of various analog and digital electronic circuits.","course content":"## UNIT-InnTransistor biasing circuits: Base bias, Emitter-feedback bias, collector-feedback bias, Voltage- divider bias, emitter bias. CE, CC and CB analysis, h-parameters. JFET: Gate bias, Self bias, Voltage-divider bias and source bias, current source bias. CS, CD and CG amplifier., MOSFET: Depletion type, Enhancement type MOSFET and their biasing., Power Amplifiers: Class A, B, C, D and S power amplifiers. Push-pull operation.nnn## UNIT-IInnOP-AMP: Differential amplifier and its DC, AC analysis, OP-AMP characteristics, Non- Inverting/Inverting Voltage and Current feedback. Linear and Non-Linear OP-AMP circuits, Regulated power supplies. Oscillators- Barkhausen criteria of oscillations, Wein-bridge, RC oscillator, 555 timer: its monostable and astable operation.nnn## UNIT-IIInnLogic gates and Logic Families: Logic gates, Universal gates, transistor as a switching element, Tri-state switch, Bipolar logic Families: RTL, DTL, TTL, ECL, 12L, MOS Logic families: NMOS, CMOS families and characteristics, various logic functions and their implementation.nnn## UNIT-IVnnCombinational Circuits: Introduction to combinational circuits, arithmatic and logical operation, design of Half adder & full adder, subtractor circuits, decoders, multiplexers, demultiplexers, comparators, Sequential Circuits: Flip-flops, bistable circuits: RS, JK, D, T, Master/Slave Flip-flop, race around condition, latches, synchronous and asynchronous counters up & down counters, shift registers.nReferences:n- Millman and Halkias, “Integrated Electronics”, Mc Graw Hill.n- R. Boylested and L. Nashelsky, “Electronics Devices and Circuits”, Prentice Hall India.n- Millman and Halkias, “Electronics Devices and Circuits”, TMH Edition.n- Malcolm Goodge, “Analog Electronics Analysis and Synthesis”, TMH Edition.n- Malvino, “Electronics Principles”, TMH Editionn- AP Malvino and DP Leach, ‘ Digital Principles and applications’n- Charles Roth, ‘Fundamentals of Logic Design’.n- H. Taub and D. Schilling, ‘Digital Integrated Electronics’.","course outcomes":"- To understand the concept of multistage amplifiers, analysis of multistage amplifier and its frequency response, Darlington pair and bootstrap circuits.n- To learn the basics of tuned amplifiers such as single tuned, double tuned, stagger tuned & power amplifiers.n- To study and analyze the performance of negative as well as positive feedback circuits.n- To study and analyze the wave shaping circuits and operational amplifies.n- Acquired knowledge about basics of digital electronics.n- Ability to identify, analyze and design combinational circuits.n- Ability to design various synchronous and asynchronous sequential circuits.n- Acquire knowledge about internal circuitry and logic behind any digital system."}
