{"course code":"EEPC35","course title":"Control System - II","number of credits":"3-1-0=4","prerequisites":"EEPC12; EEPC14; EEPC21","course type":"PC","branch":"ee","course learning objectives":"- To study the fundamental concepts of digital control system problems and their solution possibilities,n- To study about the mathematical modelling of the various physical systems in continuous/discrete-time using transfer function and state space methods,n- To study the concept of time-domain response (transient and steady-state response)and frequency-domain analysis of the discrete-time systems,n- To study the basics of stability analysis of the discrete-time systems,n- To study about the discrete-time systems analysis, controldesign and implementations in state space.","course content":"## UNIT-InnMOTIVATION, MODELLING OF DIGITAL CONTROL SYSTEMSnIntroduction to digital control: The digital control problem and solution possibilities, Signal processing in digital control, principles of signal conversion, sampling and reconstruction, principles of discretization, impulse and step invariance, finite difference approximation, bilinear transformation.nMathematical models of discrete-time systems: Transfer function and system response, stability in the z-plane and the Jury stability criterion, sampling and data reconstruction process, z-domain description of closed loop systems, systems with dead-time.nnn## UNIT-IInnDESIGN OF DIGITAL CONTROL ALGORITHMSnDigital control design: Implementation of digital controllers, digital controllers for deadbeat performance, root locus methods and frequency domain methods, effect of nonlinearity in root locus and Nyquist plot.nnn## UNIT-IIInnCONTROL SYSTEM ANALYSIS AND DESIGN IN STATE-SPACEnIntroduction to state space model: State space equations in canonical forms, modelling of electrical and mechanical systems in state space form, solution of time invariant/variant continuous/ discrete- time system state equations, state transition matrix, state transformation, Eigen values and Eigen vectors, controllability and observability, relation between transfer function and state variable representations.nFeedback control design: Pole-placement using state variable feedback, Ackerman’s formula, full- order observer, reduced-order observer, and observer based state feedback controller, Lyapunov theory of stability analysis.nnn## UNIT-IVnnNONLINEAR SYSTEMS ANALYSISnIntroduction to nonlinear systems: Characteristics of nonlinear systems,inherent and intentional nonlinearities, qualitative behaviour of linear Vs nonlinear systems, multiple equilibrium points, limit cycle, bifurcation, jump response, chaos,nStability analysis of nonlinear systems:Describing function of common nonlinear functions and stability analysis, phase plane analysis, construction of phase portraits, singular points, concept of stability in the sense of Lyapunov, asymptotic stability, local and global stability, construction of Lyapunov function using Krasovskii and variable gradient method.nReferences:n- Raymond T. Stephani, Design of Feedback Control Systems, Oxford University Press, Edition No. 04, 2002.n- Donald M. Wiberg, State Space and Linear Systems, Schuam’s Outline Series, Edition No. 01, 1971.n- Katsuhiko Ogata, Discrete-Time Control Systems, Prentice-Hall, Edition No. 02, 2015.n- M. Gopal, Digital Control and State Variable Methods, Tata McGrow Hill, Edition No. 04, 2012.n- B. C. Kuo, Digital Control System, Oxford University Press, Edition No. 02, 2006.n- J. J. E. Slotine and W. Li, Applied Nonlinear Control, PrenticeHall, Edition No. 01, 1991.n- Hassan. K. Khalil, Nonlinear Systems, Prentice-Hall, Edition No. 03, 2002.","course outcomes":"At the end of the course student will be able ton- Fundamental knowledge of digital control system,mathematical modelling of various physical systems in continuous/discrete-time using transfer function and state space methods,n- Digital control design and stability analysis using time-domain as well as frequency-domain methods,n- Conversion of system models from transfer function to state space and vice versa using various transformations,n- Design and implementation of input and output feedback controllerswith Lyapunov theory of stability.n- Learn characteristics of linear Vs nonlinear systems behaviour and stability analysis with the concept of local and global stability."}
