{"course code":"EEPC45","course title":"Industrial Control","number of credits":"3-1-0=4","prerequisites":"EEPC10, EEPC14, EEPC21, EEPC22","course type":"PC","branch":"ee","course learning objectives":"- To learn the fundamental of control of most process variables and how these measured quantities are transformed and transmitted.n- To learn the concepts of process control, including principles of industrial practices and computer control.n- To apply these concepts to the control system for typical chemical processes.n- To gain knowledge and actions of various types of control system, including analog and digital types, online and real time.","course content":"## Unit-InnMOTIVATION, MODELS OF INDUSTRIAL PROCESSESnIntroduction to Process Control System: Control objectives and configurations of process control, role of control engineer, documentation, process equipments and use, process control operations.nMathematical modelling: Type of models; modelling procedure steps, empirical model identification and system identification.nnn## Unit-IInnDYNAMICAL MODELLING AND FEED BACK CONTROLnBlending process: problem, dynamics, modelling, selection, temperature sensors, concentration response of isothermal CSTR with no chemical reaction, first order reaction, higher order reaction, pressure tanks with resistances, change in valve positions, interacting systems, liquid level systems with linear/non linear effects; non-interacting and interacting tanks.nFeedback Control Analysis: Transient response with regulatory, set-point and tracking control for second and higher order systems with P, PI, PD, PID controllers, effect of measurement lag and process dead time on response, control architectures.nnn## Unit-IIInnENHANCED CONCEPTS OF PROCESS CONTROLnEnhance control strategies: PID controller tuning, control valves, feed forward control, cascade control, selectors and redundant control, concept of computer control, sequential, supervisory and DDC modes, digital implementation of PID, computer control architecture.nAdvanced control strategies: Model predictive control, dead time compensation, internal model control, adaptive control, inferential, statistical control, intelligent control (ANN, Fuzzy), case studies.nnn## Unit-IVnnCOMMUNICATION AND NETWORKINGnBackground: organization, bus interface, type of buses, features, factors to reckon, LAN topologies, communication hierarchy, ISO reference model, data link layer, central and decentralized bus control, industrial communication systems, management protocols, comparison.nIndustrial visits: Seminars/Workshops.nReferences:n- Peter Harriot, Process control, McGrow Hill, Edition No. 01, 1964.n- D. E. Seborg, T. F. Edgar, D. A. Mellichamp, F. J. Doyle, Process Dynamics and Control, Wiley, Edition No. 04, 2016.n- S. K. Singh, Computer Aided process control, PHI, Edition No. 01, 2004.n- S. Bhanot, Process Control-Principles and Applications, Oxford University Press, Edition No. 04, 2010.n- T. E. Marlin, Process Control: Designing Processes and Control Systems for Dynamic Performance, McGrow Hill, Edition No. 02, 2000.","course outcomes":"At the end of the course student will be able to……n- Understand the basic principles & importance of process control in industrial process plants;n- Specify the required instrumentation and final elements to ensure that well-tuned control is achieved;n- Understand the use of block diagrams & the mathematical basis for the design of control systems;n- Design and tune process (PID) controllers;n- Use appropriate software tools (e.g. Matlab Control Toolbox & Simulink) for the modelling of plant dynamics and the design of well tuned control loops;n- Understand the importance and application of good instrumentation for the efficient design of process control loops for process engineering plants; andn- Draw a PID (Process & Instrumentation Diagram) & devise simple but effective plant wide control strategies using appropriate heuristics."}
