{"course code":"EEPC40","course title":"Power System Operation and Economics","number of credits":"3-0-0=3","prerequisites":"EEPC27, EEPC24","course type":"PE","branch":"ee","course learning objectives":"- To understand the economics of power system operation.n- To realize the requirements and methods of real and reactive power control in power system.n- To recognize the recent advancements in power system operation.","course content":"## UNIT-InnTypes of load – components of system loads - load curves – load factor, demand factor,ndiversity factor, capacity factor, utilization factor, base load and peak load stations- Reserve Capacity and requirements- Load Forecasting-Electrical Tariff-types of tariff.nnn## UNIT-IInnEconomic Load Dispatch-characteristics of generation unit, Co-ordination equations with and without transmission loss, General problem formulation and common constraints-Unit Commitment – Constraints in unit commitment-Solution methods.nnn## UNIT-IIInnLoad frequency control-Generator, Prime mover, Governor & Load models – LFC of a single area and two area systems-Tie line bias control-steady state and transient response- Automatic Voltage, Regulator – Exciter and Generator models-steady state and transient response.nnn## UNIT-IVnnReactive power and Voltage control–Load Compensation- power factor correction, voltage regulation, load balancing-Maximum load ability of transmission lines-Line Compensation-Static shunt capacitor / inductor-tap changing transformer, VAR compensators, Introduction to FACTS.nRecent trends in real time control of power systems-Power system control centers with SCADA / EMS Restructuring of power system – fundamentals and operational issues–Introduction to Smart Grid.nReferencesn- Allen J. Wood, Bruce F. Wollenberg, ‘Power Generation Operation and Control’, Wiley India 2nd Edition, 2009.n- Abhijit Chakrabarti & Sunita Halder, ‘Power System Analysis- Operation & Control’, PHI New Delhi,3rd Edition, 2010.n- K Uma Rao, ‘Power System Operation & Control’, Wiley India 1st Edition, 2013.n- Robert H.Miller, James H.Malinowski, ‘Power System Operation’, Tata McGraw-Hill, 2nd Edition,2009.nCourse OutcomenUpon completion of the course, the student will be able ton- Calculate various factors (such as load factor and demand factor, etc.) and interpret different tariff structures.n- Develop generation dispatching schemes for thermal units.n- Apply frequency control schemes on power system.n- Employ reactive power compensation systems.n- Adopt engineering innovations for improved power system operation."}
