{"course code":"EEPC 14","course title":"Signals and Systems","number of credits":"3-0-0=3","prerequisites":"EEIR11, MAIR11","course type":"PC","branch":"ee","course learning objectives":"- To study properties and representation of various continuous and discrete-time signals.n- To acquire knowledge of time-domain analysis in terms of difference equations, impulse response and convolution etc.n- To acquire knowledge of frequency-domain analysis using Fourier series, Fourier, Laplace and Z transforms.n- To gain insight into the concepts of sampling process.n- To study different types of systems, their properties and modeling.","course content":"## UNIT-InnSIGNALS AND SYSTEMS:nIntroduction, Continuous and discrete time signals: periodic-aperiodic, even-odd, complex exponential-sinusoidal, deterministic-stochastic, energy-power, impulse-step, transformation of independent variable.nContinuous and discrete time systems: introduction, interconnection, basic properties- memory-memoryless, invertibility, causality, stability, time invariance, linearity.nnn## UNIT-IInnLTI SYSTEMS:nIntroduction, Continuous and discrete time LTI systems: representation in terms of impulses, unit impulse, step and complex exponential response using convolution integral/sum, Properties of LTI systems, Modeling of continuous and discrete time LTI systems.nnn## UNIT-IIInnFOURIER SERIES AND TRANSFORM:nIntroduction, Fourier series: representation of continuous and discrete time periodic signals, convergence, properties, Application to LTI systems, Fourier transform: introduction, representation of continuous and discrete time aperiodic and periodic signals, convergence, properties, Application to LTI systems.nSAMPLING:nIntroduction, sampling of continuous time signals; sampling theorem, reconstruction, effect of undersampling.nnn## UNIT-IVnnLAPLACE TRANSFORM:nIntroduction, Laplace transform and its inverse, region of convergence, relation with Fourier transform, properties, Application to LTI systems, their interconnections and block diagram.nZ TRANSFORM:nIntroduction, z-transform and its inverse, region of convergence, relation with Fourier transform, properties, Application to LTI systems, their interconnections and block diagram.nReferencesn- Alan V. Oppenheim, S. Hamid and Alan S. Willsky, Signals and Systems, PHI/Pearson.n- M. J. Roberts, Signals and Systems, TMHn- A. Papoulis, Circuits and Systems: A Modern Approach, Oxford Univ. Pressn- R.F. Ziemer, W.H. Tranter and D.R. Fannin, Signals and Systems: Continuous andn- Discrete, Pearsonn- Simon Haykins and Barry Van Veen, Signals and Systems, Wileyn- Fred J. Taylor, Principles of Signals and Systems, TMH","course outcomes":"On successful completion of the course, students will be able ton- Characterize and analyze the properties of CT and DT signals and systemsn- Analyze CT and DT systems in Time domain using convolutionn- Represent CT and DT systems in the Frequency domain using Fourier analysis tools like CTFS, CTFT, DTFS and DTFT.n- Conceptualize the effects of sampling a CT signaln- Analyze CT and DT systems using Laplace transforms and Z Transforms.n- Modeling different systems with detailed analysis of LTI systems."}
