{"course code":"EEPC29","course title":"Power Electronics-I","number of credits":"3-1-0=4","prerequisites":"EEPC-21, EEPC-25, EEPC-10","course type":"PC","branch":"ee","course learning objectives":"- To understand about various power semiconductor devices.n- To analyze and design different power converter circuits.","course content":"## UNIT-InnModern Power Electronics Devices:nPrinciple of operation of SCR, dynamic characteristic of SCR during turn ON and turn OFF, Two- transistor analogy, Protection of SCR, Snubber circuit, Commutation circuits, SCR ratings, Triggering Methods, Series and Parallel operation of SCR. Principle of operation of, IGBT, GTO, MCT, DAIC, TRAIC, IGCT, their operating characteristics.nnn## UNIT-IInnSingle-phase Converter:nHalf wave converter, 2-pulse midpoint converter, half controlled and fully controlled bridge converters, input current and output voltage waveforms, effect of load and source impedance, expressions for input power factor, displacement factor, harmonic factor and output voltage, effect of free-wheeling diode, triggering circuits, Dual converter.nnn## UNIT-IIInnThree-phase Converter:nHalf wave, full wave, half controlled and fully controlled bridge converters, effect of load and source impedance, expressions for input power factor, displacement factor, harmonic factor and output voltage, Dual Converter.nnn## UNIT-IVnnA.C. Converters:nPrinciple of operation of single-phase ac regulator, effect of load inductance, firing pulse requirement. Principle of operation of cyclo-converter, waveforms, control technique;nReferences:n- M. Ramamoorthy. Thyristor and their applications, East West Publication, 1991.n- PS Bhimbra.Power Electronics, Khanna Publishers, 2015.n- MD Singh and KB Khanchandani, Power Electronics, TMH Edition, 2007.n- AK Gupta and LP Singh, Power Electronics, Dhanpat Rai Publishing Co.n- G.K. Dubey, S. R. Doradla, A. Joshi, and R. M. K. Sinha, “Thyristorised Power Controllers”, New Age International Private Ltd.n- Mohan N., Undeland T. M. and Robbins W. P., “Power ElectronicsConverters, Applications and Design”, 3rd ED, Wiley India.","course outcomes":"- Understand fundamental concepts in power electronics.n- Capability to analyze power converter circuitsn- Identify basic requirements for power electronics based design and application.n- To troubleshoot power electronics circuits."}
