{"course code":"EEPC-41","course title":"Reliability Engineering","number of credits":"3-1-0=4","prerequisites":"--","course type":"PC","branch":"ee","course learning objectives":"Apply knowledge of students in the field of probability analysis to evaluate reliability. The concept of reliability function, network modeling, methods to evaluate, to increase, to optimize reliability will be discussed. Concept of maintainability & availability will also be discussed.","course content":"## UNIT-InnReliability and its importance, mortality curve, hazard rate, causes of failures, modes of failure, general reliability function and other reliability functions. Mean time to failure (MTTF), repair rate, mean-time-between failures (MTBF), availability, uptime, downtime. Failure frequency and failure distributions.nnn## UNIT-IInnReliability models – statistical, structural, Markov, and fault tree. Reliability evaluation using various models.nnn## UNIT-IIInnRedundancy techniques.Reliability allocation and Redundancy optimization.nnn## UNIT-IVnnReliability Testing.nBasic principles of maintainability, availability and security.Availability evaluation using Markov Technique.nBasic concepts of fuzzy reliability, failure frequency and loss of load probability.nReferencesn- E. Balaguruswamy, “Reliability Engineering”, Tata McGraw-Hill Education.n- KK Aggarwal, “Reliability Engineering”, Springer.n- Martin L. Shooman, “Probabilistic Reliability-An Engineering approach” , Krieger Publishing Company.n- Ram Kumar, “Reliability Engineering”.n- A.K. Govil, “Reliability Engineering”, McGraw-Hill Inc.,USnCourse OutcomenOn successful completion of this course students will be able to:n- Explain the concept of probability.n- Calculate random variable, density & distribution function.n- To analyze the failure modes & effects.n- Evaluate reliability functions.n- Describe various methods to evaluate, increase and allocate and optimize reliability of physical systems.n- To draw reliability logic diagrams, fault trees, market graphs and find reliability using these."}
