{"course code":"EEPC43","course title":"Advanced Power Electronics and Drives","number of credits":"3-1-0=4","prerequisites":"EEPC-29, EEPC-28","course type":"PC","branch":"ee","course learning objectives":"To provide state-of-the-art speed control techniques used in modern drives for high-performance requirements.","course content":"## UNIT-InnD.C. Drives:nSingle phase half and fully controlled rectifier-fed separately excited D C motor, Three phase fully controlled rectifier-fed separately excited D C motor, Principle of operation and control techniques of chopper fed drives, separately excited and series motor fed chopper fed drives, multi-quadrant control of chopper-fed motors and fully-controlled rectifier-fed D C motor.nnn## UNIT-IInnInduction Motor (IM) Drives:nVoltage source inverter (VSI) and current source inverter (CSI) variable frequency drives, comparison of VSI and CSI drives, mathematical modeling, direct and indirect FOC, influence of parameters, VSI and CSI fed schemes.nnn## UNIT-IIInnSynchronous Motor Drives:nVSI drive, CSI drive, CSI drive with load commutation, cycloconverter drive, Application of modern andnevolutionary techniques in drives such as fuzzy and ANN control.nnn## UNIT-IVnnDigital Control of Electric Drives:nApplication areas and functions of digital controller in drive technology, speed control of D C drives and A C drives using digital controller.nReferencesn- Dubey G. K., “Fundamentals of Electric Drives”, 2nd Ed., Narosa 2007, Publishing House.n- Pillai S. K., “A First Course in Electric Drives”, 2nd Ed., New Age 2008, International Private Limited.n- Sen P. C., “Thyristor DC Drives”, John Wiley and Sons. 1991n- Dubey G. K., “Power Semiconductor Controlled Drives”, Prentice Hall International Edition.1989n- Murphy J. M. D. and Turnbull F. G., “Power Electronics Control of AC Motors”, Peragmon Press. 1990n- Bose B. K., “Power Electronics and Variable Frequency Drives”, IEEE Press, Standard Publisher Distributors.","course outcomes":"- Able to describe various industrial motors and drive systems.n- Can apply knowledge of power electronics to drive systems.n- Learn advanced control methods of motor drive systems."}
