{"course code":"EEPC28","course title":"Power Electronics-II","number of credits":"3-1-0=4","prerequisites":"EEPC-24, EEPC-23, EEPC-26","course type":"PC","branch":"ee","course learning objectives":"- To understand about various power converters.n- To understand the basics of electric drives.n- To analyze the requirements and operation of electric drives.","course content":"## UNIT-InnD.C. to D.C. Converter:nClassification of choppers. Principle of operation, steady state analysis of class A chopper, step up chopper, switching mode regulators: Buck, Boost, Buck-Boost, Cuk regulators. Current commutated and voltage commutated chopper.nnn## UNIT-IInnD.C. to A.C. Converter:nClassification, basic series and improved series inverter, parallel inverter, single phase voltage source inverter, steady state analysis, Half bridge and full bridge inverter: Modified Mc Murray and Modified Mc Murray Bedford inverter, voltage control in single phase inverters, PWM inverter, reduction of harmonics, current source inverter, three phase bridge inverter.nnn## UNIT-IIInnBasic of Electric Drives:nDefinition of electric drive, type of drives; Speed-torque characteristic of driven unit/loads, motors, joint speed-torque characteristic; Classification and components of load torque; multi-quadrant operation of electric drive.nConverter Fed DC Drives:nSingle-phase half controlled and fully controlled converter fed dc motor drives, operation of dc drives with continuous armature current, voltage and current waveforms; Concept of energy utilization and effect of free-wheeling diode; Operation of drive under discontinuous current, expression for speed- torque characteristic.nnn## UNIT-IVnnChopper fed DC Drives:nPrinciple of operation and control techniques, chopper circuit configurations used in dc drives: Type A, B, C, D and E; Motoring operation of chopper fed separately excited dc motor, steady state analysis of drive with time-ratio control.nInverter fed AC Drives:nVoltage source inverter fed induction motor drive in open loop, frequency and voltage control in PWM VSI; Operation of closed loop slip-speed controlled VSI fed induction motor drive; Current source inverter, advantage of CSI fed drives, closed loop slip speed controlled CSI fed drive.nReferences:n- G.K. Dubey, “Fundamentals of Electrical Drives” Narosa Publishing House, 1995.n- SK Pillai, “A First course on Electrical Drives” Wiley Eastern Ltd.n- V. Subrahmanyam, “ Electric Drives: Concepts and Applications”, Tata Mc Graw Hill Publishing Co. Ltd., 1994.n- GK Dubey, “ Power semiconductor Controlled Drives, “Prentice Hall, Englewood cliffs, New Jersey, 1989.n- EL- Sharkawi& A Mohamad “ Fundamental of Electric Drive”, Vikas Publishing House","course outcomes":"- Capability to analyze power converter circuitsn- Model and analyze electrical motor drives.n- Choose suitable components for the electric drives.n- Choose a suitable control structure and calculate control parameters for an electrical motor drive"}
