{"course code":"EEPE21C","course title":"Modelling and Simulation","number of credits":"3-1-0=4","prerequisites":"MAIR-11, MAIR-12, MAIR-22","course type":"PE","branch":"ee","course learning objectives":"The aim of this course is two-fold;n- To introduce students the complexities of the real life problems and their solution with stochastic modeling and comprehensive simulations.n- To introduce learner the fundamental principles of simulation in both deterministic and stochastic frameworks.","course content":"## UNIT-InnReview of Probability and Random Number generation. Generating continuous and discrete time random variables. Discussions on deterministic and stochastic modeling of engineering systems. Need for stochastic models. Ideas of model validation.nnn## UNIT-IInnModeling of systems as discrete event systems(DES). Continuous time and discrete time Markov chains, Properties of DES (observability and controllability), Supervisory control of DES, Queuing models.nnn## UNIT-IIInnHeuristic modeling, Neural, Fuzzy and Neuro-Fuzzy modeling and simulation of dynamical systems. Modeling of time delays and introduction to networked dynamical systems.nnn## UNIT-IVnnDynamical system simulation, Monte Carlo simulations, generation of simulation data and itsnstatistical analysis, Statistical validation techniques, Goodness of fit test - based simulation, Numerical issues in simulation of dynamical systems.nReferences:nχ 2 and others, Agentn- Sheldom Ross, “Simulation”, Academic Press, Elsevier Imprint, 2006.n- Sankar Sen Gupta. “System Simulation and Modeling”, Pearson Education, 2013.n- J. Banks, J. S. Carson, B. Nelson and D. M. Nicol, “Discrete Event system simulation”, Pearson Education, 5th Edition, 2014.n- J. R. Jang and C. Sun, “Neuro-Fuzzy Modeling and Control”, Proceedings of IEEE, Vol. 83, No. 3, March 1995.nCourse OutcomenUpon successful completion of the course, students will be able ton- Look engineering system from the point of view of stochastic frameworkn- Model various systems from multiple domains e.g. electrical engineering, bio-informatics, financial systems etc.n- Undertake further industrial and research assignments."}
