{"course code":"EEPE33B","course title":"Distributed Generation","number of credits":"3-0-0=3","prerequisites":"EEPC 26, EEPC 27, EEPC 35","course type":"PE","branch":"ee","course learning objectives":"- To illustrate the concept of distributed generationn- To analyse the impact of grid integration.n- To study concept of Microgrid and its configuration","course content":"## UNIT-InnIntroduction: Conventional power generation: advantages and disadvantages, Energy crises, Non- conventional energy (NCE) resources: basics of Solar PV, Wind Energy systems, Fuel Cells, micro- turbines, biomass, and tidal sources.nnn## UNIT-IInnDistributed Generations (DG): Concept of distributed generations, topologies, selection of sources, regulatory standards/ framework, Standards for interconnecting Distributed resources to electric power systems: IEEE 1547. Energy storage elements: Batteries, ultra-capacitors, flywheels, Superconducting magnetic energy storage.nnn## UNIT-IIInnMicrogrids: Concept and definition of microgrid, microgrid drivers and benefits, review of sources of Microgrids, typical structure and configuration of a Microgrid, AC and DC Microgrids, Power Electronic interfaces in DC and AC Microgrids.nnn## UNIT-IVnnImpact of Grid Integration: Requirements for grid interconnection, limits on operational parameters: voltage, frequency, THD Impact of grid integration with NCE sources on existing power system: reliability, stability and power quality issues.","reference books":"- D. N. Gaonkar, Distributed Generation, In-Tech publications.n- Magdi S. Mahmoud, Fouad M. AL-Sunni, Control and Optimization of Distributed Generation Systems, Springer International Publishing.","course outcomes":"After the completion of the course student will be able to,n- Understand the fundamentals of distributed generationn- Identify different storage mediums used for distributed generationn- Categorize various types of distributed generation systemsn- Analyse the problems of grid integration of distributed generation systems"}
