{"course code":"EEPE22A","course title":"Distribution System Analysis and Automation","number of credits":"3-0-0=3","prerequisites":"EEPC27","course type":"PE","branch":"ee","course learning objectives":"To understand concept of distribution system, layouts of substation and lines, consumer loads, application of distribution transformers, power flow analysis and basics concept of distribution system automation","course content":"## UNIT-InnDistribution systems – General aspects – Kelvin's Law – A.C distribution – single phase and three phase – Underground cables – Comparison with overhead line – Types of cables – insulation resistance –potential gradient – capacitance of single core and three core cables, customer loads, feeders loads, load models, Layout of substations and feeders.nnn## UNIT-IInnMethod of analysis: voltage drop calculations, K-factors, uniformly distributed loads, lumping loads in geometric configuration.nSeries impedance and shunt admittance of overhead and underground lines: series impedance of OH lines, Carson’s equation, modified Carson’s equation, primitive and phase impedance matrix, impedance of under-ground lines, concentric and tape shielded cables, shunt admittance of overehead and Underground distribution lines.nnn## UNIT-IIInnApplication of distribution transformers and voltage regulation: Types, efficiency, single phase, three phase connections, step regulators for single and three phase.nDistribution feeder analysis: power flow analysis, ladder iterative technique, unbalanced three phase feeders, ladder technique for unbalanced feeders, capacitor placement.nnn## UNIT-IVnnIntroduction to Distribution Automation System, control hierarchy, Distribution Automation concept, architecture, DA Capabilities, DATA acquisition and SCADA system.nReferencesn- Momoh A. Momoh, James A. Momoh., ‘Electric Power Distribution, Automation, Protection, and Control’, CRC Press, 2007.n- Turan Gonen., ‘Electric Power Distribution System Engineering’, BSP Books, Pvt. Ltd, 2007.n- William H. Kirsting, Distribution system modeling and Analysis, CRSC press, Taylor and Francis group, 2007.n- Robert H.Miller, James H.Malinowski, ‘Power System Operation’, Tata McGraw-Hill, 2nd Edition,2009.nCourse OutcomenUpon completion of the course, the student will be able ton- Calculate various factors (such as load factor and demand factor, etc.) and interpret different tariff structures.n- Develop generation dispatching schemes for thermal units.n- Apply frequency control schemes on power system.n- Employ reactive power compensation systems.n- Adopt engineering innovations for improved power system operation."}
