{"course code":"EEPE44A","course title":"Smart Grid Systems","number of credits":"3-0-0=3","prerequisites":"EEPE33B, EEPC21, EEPE41B","course type":"PE","branch":"ee","course learning objectives":"- Understand the role of automation in transmission and distribution.n- Understand the features of small grid in the context of Indian gridn- Apply evolutionary algorithms for smart grid.n- Understand operation of PMUs, PDCs, WAMs, and voltage and frequency control in micro grid","course content":"## Unit-InnIntroduction to Smart Grid: What is Smart Grid? Working definitions of Smart Grid and Associated Concepts –Smart Grid Functions-Traditional Power Grid and Smart Grid –New Technologies for Smart Grid –Advantages –Indian Smart Grid –Key Challenges for Smart Grid.nnn## Unit-IInnSmart Grid Architecture: Components and Architecture of Smart Grid Design –Review of the proposed architectures for Smart Grid. The fundamental components of Smart Grid designs – Transmission Automation –Distribution Automation –Renewable Integrationnnn## Unit-IIInnTools and Distribution Generation Technologies: Introduction to Renewable Energy Technologies – Micro grids –Storage Technologies –Electric Vehicles and plug –in hybrids –Environmental impact and Climate Change –Economic Issues.nnn## Unit-IVnnCommunication Technologies and Smart Grid: Introduction to Communication Technology –Synchro Phasor Measurement Units (PMUs) –Wide Area Measurement Systems (WAMS).nControl of Smart Power Grid System:nLoad Frequency Control (LFC) in Micro Grid System –Voltage Control in Micro Grid System –Reactive Power Control in Smart Grid. Case Studies for the Smart Grids.nReferencesn- Stuart Borlase, Smart Grids, Infrastructure, Technology and Solutions, CRC Press, 2013n- Gil Masters, Renewable and Efficient Electric Power System, Wiley-IEEE Press, 2004.n- A.G. Phadke and J.S. Thorp, ―Synchronized Phasor Measurements and their Applications, Springer Edition, 2010.n- T. Ackermann, Wind Power in Power Systems, Hoboken, NJ, USA, John Wiley, 2005.","course outcomes":"At the end of the course the student will be able to:n- Understand the features of small grid in the context of Indian grid.n- Understand the role of automation in transmission and distribution. CO3 Apply evolutionary algorithms for smart grid.n- Understand operation of PMUs, PDCs, WAMs, and voltage and frequency control in micro grid"}
