{"course code":"EEPE21B","course title":"Mechatronics","number of credits":"3-1-0=4","prerequisites":"EEPC25, EEPC33, EEPC21, EEPC35, EEPC45","course type":"PE","branch":"ee","course learning objectives":"- To develop an ability to identify, formulate, and solve engineering problems.n- To develop an ability to design a system, component, or process to meet desired needs within realistic constraints.n- To develop an ability to use the techniques, skills, and modern engineering tools necessary for engineering practice.","course content":"## Unit-InnMOTIVATION, SYSTEM MODELLINGnIntroduction to Mechatronics: Mechatronics design process, design parameters, traditional and Mechatronics designs, advanced approaches in Mechatronics, industrial design and ergonomics, safety.nModelling: Model categories, fields of application, model development, model verification, model validation, model simulation, design of mixed systems, electro mechanics design, model transformation, domain independent description forms, simulator coupling.nnn## UNIT IInnREAL TIME INTERFACINGnSelection of interfacing standards elements of data acquisition & control systems, over view of I/O process, general purpose I/O card and its installation, data conversion process, application software, lab view environment and its applications, VIM-SIM environment & its applications, man-machine interface.nnn## Unit-IIInnCASE STUDIES ON MECHATRONIC SYSTEMnStudies on Fuzzy based washing machine, pH control system, autofocus camera, exposure control, motion control using D.C. motor & solenoids, engine management systems, controlling temperature of a hot/cold reservoir using PID, control of pick and place robot, part identification and tracking using RFID, online surface measurement using image processing.nnn## Unit-IVnnMICRO MECHATRONIC SYSTEMnIntroduction: System principle, component design, system design, scaling laws, micro actuation, micro robot, micro pump, applications of micro Mechatronics components.nReferences:n- D. shetty, Richard A. Kolk, Mechatronics System Design, Cengage Learning, Edition No. 02, 2011.n- G. Pelz, Mechatronic Systems: Modeling and simulation with HDL’s, John wiley and sons Ltd, 2003.n- Bishop, H. Robert, Mechatronics Hand book, CRC Press, 2002.n- Bradley, D. Dawson, N. C. Burd, and A. J. Loader, Mechatronics: Electronics in Products andn- Processes, CRC Press, Edition No. 01, 1991, (First Indian print 2010).n- D. Silva, Mechatronics: A Foundation Course, Taylor & Francis, (Indian Reprint, 2013).","course outcomes":"At the end of the course student will be able ton- Be able to model and analyze electrical and mechanical systems and their inter-connection.n- Be able to integrate mechanical, electronics, control and computer engineering in the design of Mechatronics systemn- Be able to do the complete design, building, interfacing and actuation of a Mechatronics system for a set of specific actions.n- Be proficient in the use of Lab VIEW software for data acquisition.n- Be proficient in the programming of microcontrollers."}
