{"course code":"EEPE22C","course title":"Power System Compensation","number of credits":"3-0-0=3","prerequisites":"EEPC-27, EEPC-24,EEPC-31","course type":"PE","branch":"ee","course learning objectives":"- To familiarize the students with the basic concepts, different types, scope and applications of FACTS controllers in power transmission.","course content":"## UNIT InnFundamentals of ac power transmission, transmission problems and needs, emergence of FACTS devices, control considerations, FACTS controllers.nPrinciples of shunt compensation – Variable Impedance type & switching converter type- Staticnnn## UNIT IInnSynchronous Compensator (STATCOM) configuration, characteristics and control. Principles of static series compensation using GCSC, TCSC and TSSC, applications, Static Synchronous Series Compensator (SSSC).nnn## UNIT IIInnPrinciples of operation-Steady state model and characteristics of a static voltage regulators and phase shifters-power circuit configurations.nnn## UNIT IVnnUPFC-Principles of operation and characteristics, independent active and reactive power flow control, comparison of UPFC with the controlled series compensators and phase shifters.nReferences:n1. Hingorani, L. Gyugyi, ‘Concepts And Technology Of Flexible AC Transmission System’, Standard Publishers Distributors, 1st Edition, 2011.n- R.M. Mathur And R.K. Varma, ‘Thyristor-Based FACTS Controllers For Electrical Transmission Systems’, Wiley India Pvt. Limited Publications, 1st Edition, 2011.n- 3 K. R. Padiyar, ‘FACTS Controllers In Power Transmission And Distribution’, New Age International Publications, 1st Edition, 2009.n- Enrique Acha, Claudio R. Fuerte-Esquivel, Hugo Ambriz-Pérez, César Angeles-Camacho, ‘FACTS: Modelling And Simulation In Power Networks’, John Wiley & Sons, 2004.n- 5 Enrique Acha, Vassilios Agelidis, Olimpo Anaya, T.J.E.Miller, ‘Power Electronic Control In Electrical Systems’, Newness Power Engineering Series, 2002.n- 6 T.J.E.Miller, ‘Reactive Power Control In Electric Systems’, Wiley Publications, 1982.","course outcomes":"Upon completion of the course, the students shall be able ton- Understand various Power flow control issues in transmission lines, for the purpose of identifying the scope and for selection of specific FACTS controllers.n- Apply the concepts in solving problems of simple power systems with FACTS controllers.n- Design simple FACTS controllers."}
