{"course code":"EEPE40C","course title":"Intelligent Instrumentation","number of credits":"3-0-0=3","prerequisites":"---------","course type":"PE","branch":"ee","course learning objectives":"This course introduces basic concept of intelligent sensor, Data acquisition, application of automation in industrial application. It also helps to understand the student the application of intelligent controller in instrument.","course content":"## Unit 1 Introduction:nnIntelligence, features characterizing intelligence, intelligent instrumentation system; features of intelligent instrumentation; components of intelligent instrumentation system. Block diagram of an intelligent instrumentation system.nSmart SensorsnPrimary sensors; Excitation; Compensation (Nonlinearity: look up table method, polygon interpolation, polynomial interpolation, cubic spline interpolation, Approximation & regression: Noise & interference; Response time: Drift; Cross-sensitivity); information coding/Processing; Data Communication; Standards for smart sensor interface. Recent Trends In Sensor Technologies: Introduction; Film sensors (Thick film sensors, this film sensor) Semiconductor IC Technology- Standard methods; Micro electro- mechanical systems (Micro-machining, some application examples); Nono-Sensors.nnn## Unit 2nnInterfacing Instruments & ComputersnInstrumentation systems, Types of Instrumentation systems, Data acquisition system and its uses in intelligent Instrumentation system, Detailed study of each block involved in making of DAS, Signal Conditioners: as DA, IA, Signal Converters (ADC & DAC), Sample and hold, Designing of Pressure, Temperature measuring instrumentation system using DAS, Data loggernnn## Unit 3nnAutomatic Process ControlnAutomation system, Concepts of Control Schemes, Types of Controllers, Components involved in implementation of Automation system; Converter (I to P) and Actuators: Pneumatic cylinder, Relay, Solenoid (Final Control Element), Computer Supervisory Control System (SCADA), Direct Digital Control’snStructure and Software Introduction of Programmable logic controller, Principles of operation, Architecture of Programmable controllers, Programming the Programmable controller, Industrial control applications like cement plant, thermal power plant.nnn## Unit 4nnIntelligent controllersnIntroduction about Intelligent controllers, Model based controllers, Predictive control, Artificial Intelligent Based Systems, Experts Controller, Fuzzy Logic System and Controller, Artificial Neural Networks, NeuroFuzzy Controller system.nReference Book:n- G. C. Barney, “Intelligent Instrumentation”, Prentice Hall, 1995.n- Computer-Based Industrial Control”, by Krishna Kant, PHI.n- Process Control Instrumentation Technology”, by Curtis D Johnson, Pearson Ed.n- Electrical and Electronics Measurement and Instrumentation” by A. K. Swahney.n- Electronics instrumentation” by H. S. Kalsi [TMH]n- ALAN S. Morris, Principles of Measurement s Instrumentation. New. Delhi: PHI Pvt. Ltd. 1999.n- D.Patranabis, Sensors s Transducers. New .Delhi: PHI, 2003.n- Roman Kuc, Introduction to Digital Signal Processing. New York: McGraw-Hill Pub. Co.","course outcomes":"- Able to understand the basic characteristic of intelligent instrumentation systemn- Knowledge of new sensor technologyn- Able to understand the data acquisition system in intelligent instrumentation systemn- Knowledge of automation in industrial plantn- Able to understand the intelligent controller used in intelligent instrumentation system"}
