{"course code":"EEPE42B","course title":"Virtual Instrumentation","number of credits":"3-0-2=4","prerequisites":"EEPC-12","course type":"PE","branch":"ee","course learning objectives":"- To review background information required for studying virtual instrumentation.n- To study the basic building blocks of virtual instrumentation.n- To study the various techniques of interfacing of external instruments of PC.n- To study the various graphical programming environment in virtual instrumentation.n- To study a few applications in virtual instrumentation.","course content":"## UNIT-InnReview of Virtual Instrumentation: Historical perspective, Advantages etc., Block diagram and Architecture of a Virtual Instrument. Use of Virtual Instrumentation in the engineering process.nData-flow Techniques: Graphical programming in data flow, Comparison with conventional programming.nnn## UNIT-IInnVI Programming Techniques: VIs and sub-VIs, Loops and Charts, Arrays, Clusters and Graphs, Case and sequence structures, Formula nodes, Local and global variables, String and file I/O.nnn## UNIT-IIInnData Acquisition Basics: ADC, DAC, DIO, Counters and timers, PC Hardware' structure, Timing, Interrupts, DMA Software and hardware installation.nCommon Instrumentation Interfaces: Current loop RS232C/ RS485, GPIB, VISA and IVI, Image acquisition and processing, Motion Control.nnn## UNIT-IVnnUse of Analysis Tools: Some tools from the advanced analysis tools relevant to the discipline may be included, e.g., Fourier transforms, Power spectrum, Correlation methods, Windowing and Filtering.nApplications of VI: VI Applications in various fields. Simulation of System using VI, Development of Control System, PID Controller.nNote: The Experiments in the Lab will be based on the theory.nReferencesn- Gary Johnson, LabVIEW Graphical Programming, Second edition, McGraw Hill, Newyork, 1997.n- Lisa K. Wells & Jeffery Travis, LabVIEW for Everyone, Pentice Hall, New Jersey, 1997.n- Travis, J., LabVIEW for Everyone, Dorling Kingsley (2009).n- Kevin James, PC interfacing and data Acquisition: Techniques for Measurement.n- Gupta, S. and Gupta, J.P., PC Interfacing for Data Acquisition and Process Control, Instrument Society of America (1994) 2nd ed.","course outcomes":"At the end of the coursen- Student will be familiarized with Virtual Instrumentation.n- Student will be able to do Graphical language programming.n- Student will have knowledge of analytical tools.n- Student can build the VI for various applications"}
