{"course code":"EEPE21A","course title":"Renewable Energy","number of credits":"3-1-0=4","prerequisites":"EEPC27","course type":"PE","branch":"ee","course learning objectives":"- To impart knowledge of the principles and working of various renewable energy resources.","course content":"## Unit-I Introduction:nnLimitations of conventional energy sources, need and growth of alternate energy sources, basic schemes and applications of direct energy conversion. Basic principles of MHD generator and Hall Effect, different types of MHD generators, conversion effectiveness. Practical MHD generators, applications and economic aspects.nnn## UNIT-IInnWind and Solar Energy:nPhotovoltaic effect, characteristics of photovoltaic cells, conversion efficiency, solar batteries and applications. Solar energy in India, solar collectors, solar furnaces & applications.nHistory of wind power, wind generators, theory of wind power, characteristics of suitable wind power sites, scope in India, advantages and limitations.nnn## UNIT-IIInnThermo-electric Generators:nSeeback effect, peltier effect, Thomson effect, thermoelectric convertors, brief description of the construction of thermoelectric generators, applications and economic aspects.nnn## UNIT-IVnnFuel Cells and Miscellaneous Sources:nPrinciple of action, Gibbs free energy, general description of fuel cells, types, construction, operational characteristics and applications. Geothermal system, characteristics of geothermal resources, Low head hydroplants.nReferencesn- R.A. Coormbe,. “An introduction to direct energy conversion”.n- M. Kettani, . “Direct energy conversion”.n- Robest L Loftness, “Energy hand book”.n- D. P. Kothari, K C Singal, Rakesh Ranjan, “Renewable Energy Sources and Emerging Technologies”n- Shobnath Singh, “Non Conventional Energy Resources”n- G D Rai, “Non Conventional Energy Sources”","course outcomes":"- Able to know basic concepts of renewable energy resources.n- Able to identify scope of renewable energy resources in India."}
