{"course code":"EEPE40A","course title":"Electric Vehicles","number of credits":"3-0-0=3","prerequisites":"EEPC23, EEPC26, EEPC24, EEPC33","course type":"PE","branch":"ee","course learning objectives":"- Recognize EV/HEV technical and economic objectives.n- Explain the mechanism of battery and motors in terms of functionality, control, and integration.n- Identify efficient EV/HEV architectures.n- Describe a basic co-ordinated control between different parts of EV.","course content":"## UNIT-InnElectric Vehicles (EV) and Hybrid Electric Vehicles (HEV) Developments:nHistorical developments, recent developments, State of art EVs and HEVs, EV configurations, EV parameters, HEV configurations, Power flow control.nnn## UNIT-IInnElectric Propulsion:nDifferent types of Power converter based DC motor drives, induction motor drives, permanent magnet motor drives, Switched reluctance motor drives.nnn## UNIT-IIInnEnergy SourcesnBasics- Parameters-Capacity, Discharge rate, State of charge, state of Discharge of Batteries, Fuel cells, Ultra-capacitors, Fly-wheels.nnn## UNIT-IVnnEV auxiliaries:nBattery characteristics and chargers, Battery indication and management, Temperature control units, Power steering units, Auxiliary power supplies, Navigation systems, Regenerative Braking systems.","reference books":"- C. C. Chan, K. T. Chau, “Modern Electric Vehicle Technology” published by Oxford University Press.n- Rodrego Garcia-valle and J. A. P Lopes “Electric Vehicle Integration into Modern Power Networks” Springer.n- Chris Mi, M. AbulMasrur and David WenzhongGao, “Hybrid Electric Vehicles: Principles and Applications with PracticalPerspectives” John Wiley Ltd. Publication.n- . MehrdadEhsani, YimiGao, Sebastian E. Gay, Ali Emadi, “Modern Electric, Hybrid Electric and Fuel Cell Vehicles: Fundamentals, Theory and Design” CRC Press, 2004.","course outcomes":"- Learn fundamentals of advanced batteries, super-capacitors and fuel cells for electrification of vehicles.n- Learn hybridization of various energy conversion devices for vehicle electrification.n- Understand battery management systems and state-of-charge estimation.n- Understand the overall operation of Electric vehicles."}
