{"course code":"EEPE41A","course title":"EHV AC and DC Transmission","number of credits":"3-0-0=3","prerequisites":"EEPC27","course type":"PE","branch":"ee","course learning objectives":"- To develop basic understanding of operation of power system and extra high voltage.n- Differentiate between AC and DC systems.n- Understand the operation of AC and DC systems.n- Knowledge of advance concepts such as travelling waves to power system.","course content":"## Unit-InnConstitution of EHV a.c. and d.c. links, Kind of d.c. links, Limitations and Advantages of a.c. and d.c. transmission, Principal application of a.c. and d.c. transmission, Trends in EHV a.c. and d.c. transmission, Power handling capacity.nnn## Unit-IIInnComponents of EHV d.c. system, converter circuits, rectifier and inverter valves, Reactive power requirements, harmonics generation, Adverse effects, Classification, Remedial measures to suppress, filters, Ground return. Converter faults & protection harmonics misoperation, Commutation failure, Multiterminal D.C. lines.nnn## Unit-IVnnControl of EHV d.c. system desired features of control, control characteristics, Constant current control, Constant extinction angle control. Ignition Angle control. Parallel operation of HVAC & DC system. Problems & advantages.nnn## Unit-VnnTravelling waves on transmission systems, Their shape, Attenuation and distortion, effect of junction and termination on propagation of traveling waves. Over voltages in transmission system. Lightning, switching and temporary over voltages: Control of lighting and switching over voltagesnReference:n- S. Rao, EHV AC & DC Transmission. Khanna publishers.n- E. Kimbark, HVDC Transmission, Jhon Wiley and Sons.n- J. Arrillaga, HVDC Transmission, 2nd Edition ,IEEE Press.n- K. R. Padiyar, HVDC Transmission, New age international pub.n- T.K. Nagsarkar,M.S. Sukhiza, Power System Analysis, Oxford Universityn- Narain.G. Hingorani, l. Gyugyi, Understanding of FACTS concept and technology, John Wiley and Sons.n- P.Kundur, H.V.D.C. Transmission,Tata McGraw Hill","course outcomes":"At the end of the course student will be able ton- Analyze the concept of operation of AC and DC systems.n- Understand the concept of travelling waves.n- Analyze different problems at EHV level."}
