{"course code":"EEPE42C","course title":"Optimization Theory","number of credits":"3-1-0=4","prerequisites":"MAIR11, MAIR12, MAIR22","course type":"PE","branch":"ee","course learning objectives":"- Understand the concept of optimization and its theory.n- Analyse the advantages and disadvantages associated with the large-scale optimization techniques when applied to Engineering problems.n- Implement selected optimization algorithms / approaches commonly used in engineering systems and other specific areas","course content":"## UNIT-InnIntroductionnIntroduction to optimization theory, Importance in solving system engineering problems, Convex sets & functions, supporting & separating hyper planes, dual cones and generalized inequalities, Multi objective optimization.nnn## UNIT-IInnLinear programmingnLinear programming problem: Formulation, simplex method, two phase simplex method, dual simplex method,, Duality in linear programming, sensitivity analysis, Integer linear programming, cutting plane method, linear programming approach to game theory, dynamic programming problems.nnn## UNIT-IIInnNonlinear programmingnIntroduction to nonlinear programming: Unconstrained optimization—formulation of quadratic optimization problem, Newton raphson method, gradient method, Constrained optimization— quadratic programming, separable programming.nnn## UNIT-IVnnConvex optimizationnConvex optimization problem: Linear optimization problem, quadratic optimization problem, complexity of convex programmingnReferencesn- Optimization Theory & Applications by SS Rao, Wiley Eastern Ltd.n- Convex Optimization by Boyd & Vandenberghe, Cambridge University Pressn- Operational Research: An Introduction by Hamdy A. Taha, Pearson Prentice Hall, New Jerseyn- Nonlinear Programming by D. Bertsekas, Athena Scientific, Nashua, USAn- Linear Programming by V. Chvatal, W. H. Freeman, New York.n- Practical Methods of Optimization by R. Fletcher, Wiley, New York.","course outcomes":"After the course is completed the students will be able to:n- Understand the different optimization algorithms, multidisciplinary design optimization; formulate optimization problems;n- Understand how optimization theory maybe applied to different applications and areas of engineeringn- Solve various constrained and unconstrained problems in single variable as well as multivariable; apply the methods of optimization in real life situation."}
