{"course code":"EEPE44C","course title":"Electrical Safety and Standards","number of credits":"03","prerequisites":"Basic sciences, EEIR11","course type":"Programme Elective","branch":"ee","course learning objectives":"The contents for this course have been discussed and the syllabus will be framed later.nTo provide a comprehensive exposure to electrical hazards, various grounding techniques, safety procedures and various electrical maintenance techniques.","course content":"## Unit-InnPrimary and secondary hazards- arc, blast, shocks-causes and effects-safety equipment- flash and thermal protection, head and eye protection-rubber insulating equipment, hot sticks, insulated tools, barriers and signs, safety tags, locking devices- voltage measuring instruments- proximity and contact testers-safety electrical one line diagram- electrician’s safety kit.nnn## Unit-IInnGeneral requirements for grounding and bonding- definitions- grounding of electrical equipment bonding of electrically conducting materials and other equipment-connection of grounding and bonding equipment- system grounding- purpose of system grounding- grounding electrode system grounding conductor connection to electrodes-use of grounded circuit conductor for grounding equipment- grounding of low voltage and high voltage systems.nnn## Unit-IIInnThe six step safety methods- pre job briefings - hot-work decision tree-safe switching of powernsystem- lockout-tag out- flash hazard calculation and approach distances- calculating the required level of arc protection-safety equipment , procedure for low, medium and high voltage systems- the one minute safety audit Electrical safety programme structure, development- company safety team- safety policy programme implementation- employee electrical safety teams- safety meetings- safety audit accident prevention- first aid- rescue techniques-accident investigationnnn## Unit-IVnnSafety related case for electrical equipments, Various Standards : IEEE, IEC, IS... ,regulatory bodies- national electrical safety code- standard for electrical safety in work place- occupational safety and health administration standards, Indian Electricity Acts related to Electrical Safety.nReferencesn- John Cadick, Mary Capelli-Schellpfeffer, Dennis Neitzel, Al Winfield ,‘Electrical Safety Handbook’, McGraw-Hill Education, 4thEdition, 2012.n- Sunil S. Rao, Prof. H.L. Saluja, “Electrical safety, fire safety Engineering and safety management”, Khanna Publishers. New Delhi, 1988.n- Maxwell Adams.J, ‘Electrical Safety- a guide to the causes and prevention of electric hazards’, The Institution of Electric Engineers, IET 1994.n- Ray A. Jones, Jane G. Jones, ‘Electrical Safety in the Workplace’, Jones & Bartlett Learning, 2000.","course outcomes":"Upon completion of the course, the students would be able ton- Describe electrical hazards and safety equipment.n- Analyse and apply various grounding and bonding techniques.n- Select appropriate safety method for low, medium and high voltage equipment.n- Participate in a safety team.n- Carry out proper maintenance of electrical equipment by understanding various standards."}
