{"course code":"EEPE31C","course title":"Electric Energy Utilization","number of credits":"03-0-0=03","prerequisites":"EEPC27, EEPC24, EEPC31","course type":"PE","branch":"ee","course learning objectives":"To design illumination systems, choose appropriate motors for any drive application, to debug a domestic refrigerator circuit and to design battery charging circuitry for specific applications.","course content":"## UNIT-InnIllumination – Terminology, Laws of illumination, Photometry, lighting calculations. Electric lamps – Different types of lamps, LED lighting and Energy efficient lamps. Design of lighting schemes – factory lighting - flood lighting – street lighting.nRefrigeration-Domestic refrigerator and water coolers - Air-Conditioning-Various types of air conditioning system and their applications, smart air conditioning units - Energy Efficient motors:nnn## UNIT-IInnStandard motor efficiency, need for more efficient motors, Motor life cycle, Direct Savings and payback analysis, efficiency evaluation factor.nDomestic utilization of electrical energy – House wiring. Induction based appliances, Online and OFF line UPS, Batteries. Power quality aspects – nonlinear and domestic loads. Earthing – domestic, industrial and sub-station.nnn## UNIT-IIInnElectric Heating- Types of heating and applications, Electric furnaces - Resistance, inductance and Arc Furnaces, Electric welding and sources of welding, Electrolytic processes – electro-metallurgy and electro-plating.nnn## UNIT-IVnnTraction system – power supply, traction drives, electric braking, tractive effort calculations and speedtime characteristics. Locomotives and train - recent trend in electric traction.nReferencesn- Dr. Uppal S.L. and Prof. S. Rao, 'Electrical Power Systems', Khanna Publishers, New Delhi, 15th Edition, 2014.n- Gupta, J.B., 'Utilisation of Electrical Energy and Electric Traction', S. K. Kataria and Sons, 10th Edition, 2012.n- Rajput R.K., ’Utilisation of Electrical Power’, Laxmi Publications, 1st Edition, 2006.n- N. V. Suryanarayana, ‘Utilisation of Electrical Power’, New Age International Publishers, Reprinted 2005.n- C. L. Wadhwa, ‘Generation Distribution and Utilization of Electrical Energy’, New Age International Publishers, 4th Edition, 2011.n- H. Partab, ‘Modern Electric Traction’, Dhanpat Rai & Co., 3rd Edition, 2012.n- Energy Efficiency in Electrical Utilities, BEE Guide Book, 2010.","course outcomes":"Upon completion of the course the students would be able ton- Develop a clear idea on various illumination techniques and hence design lighting scheme for specific applications.n- Identify an appropriate method of heating for any particular industrial application.n- Evaluate domestic wiring connection and debug any faults occurred.n- Construct an electric connection for any domestic appliance like refrigerator as well as to design a battery charging circuit for a specific household application.n- Realize the appropriate type of electric supply system as well as to evaluate the performance of a traction unit."}
