{"course code":"EEPE40B","course title":"Fault Tolerance and Reliability Engineering","number of credits":"3-0-0=3","prerequisites":"-","course type":"PE","branch":"ee","course learning objectives":"Introduction to basic concepts of fault tolerance and reliability engineering. Application of probability and statistics to estimate reliability of industrial systems; development of reliability measures; analysis of static and dynamic reliability models; development and analysis of fault trees; analysis of safety of reliability models.","course content":"## UNIT 1nnFault tolerant concepts, fault detection techniques: test generation, design of testable circuits, fault tolerant system modeling. redundancy techniques: voting schemes, qudded logic, radial logic, use of error-correcting codes, N-version and modular redundancy, SIFT, replicas, alternatives, dynamics of replicas and alternatives.nnn## UNIT 2nnReliability data analysis: reliability function, mean-time to failure, bathtub curve, hazard models: Linear, polynomical, exponential, normal, lognormal, weibull, analysis of failure data, Estimation of failure data : Least-square, maximum likelihood.nnn## UNIT 3nnSystem reliability modeling, reliability evaluation techniques, system analysis through fault trees.nnn## UNIT4nnReliability Data Management: Data collection, storage and recovery of data, data banks, reliability data sources, Design for Reliability and Safety. reliability improvement, A typical case study.","reference books":"- Friedman & Menon, “Fault Detection in Digital Circuits,” Prentice-Hall, 1971.n- Shem.Tov-Levi, Ashok K. Agrawala, “Fault Tolerant System Design,” McGraw-Hill, 1994.n- V.N. Yarmolik, “Fault Diagnosis of Digital Circuits”, John Wiley & Sons, 1990.n- Shooman M.L, “Probabilistic Reliability; An Engineering Approach”, McGraw Hill.n- K.B. Misra, “Reliability Analysis & Prediction”, Elsevier, 1992.n- EE Lewis, “Introduction to Reliability Engineering”, John Wiley & Sons.n- Lawrence M. Leemis, “Reliability Probabilistic Models and Statistical Methods”, Prentice Hall.","course outcomes":"- Analyze the static and dynamic of Fault Tolerance and Reliability of complex systemsn- Identify commonly used reliabilty using graphical techniques and empirical distributionsn- Utilize common physical models for reliability analysisn- Formulate fault tree models of complex systems and determine the failure modes of the systemn- Perform Safety and reliability analysis"}
