{"course code":"EEPE33C","course title":"Multivariable Control","number of credits":"3-0-0=3","prerequisites":"EEPC25, EEPC33, EEPC21, EEPC35, EEPC45","course type":"PE","branch":"ee","course learning objectives":"- To develop an ability to identify, formulate, and solve multivariable control engineering problems.n- To develop an ability to design a multivariable control system, component or process to meet desired needs within realistic constraints.n- To develop an ability to use the techniques, skills, and modern engineering tools necessary for multivariable control engineering practice.","course content":"## Unit-InnMOTIVATION, RANDOM VARIABLESnIntroduction to multivariable control: State-space dynamic systems analysis, stability, norms of signal, vector and matrix, system norms, MIMO frequency response, review of probability theory.nVector random processes: Scalar and vector random variables, uncorrelated versus independent, functions of random variables, conditioning, vector random (stochastic) processes, shaping filters.nnn## UNIT IInnESTIMATION, QUADRATIC REGULATORnLeast-Squares Estimation: Deterministic least squares, stochastic least squares, metrics for our estimates, recursive estimation, and system identification.nLinear Quadratic Regulator: Cost functions; deterministic LQR problem, optimization via calculus of variations, LQR problem solved via calculus of variations, solving the Riccati equation, symmetric root locus, stochastic LQR, LQR solution via dynamic programming, infinite-horizon discrete-time LQR.nnn## Unit-IIInnQuadratic Estimator and GaussiannLinear Quadratic Estimator: Setting up the optimal state estimator, deriving the optimal state estimator, Kalman filter loop, steady-state Kalman filters, frequency-domain interpretation, symmetric root locus, relationship between LQE and LQR.nLinear Quadratic Gaussian: Deriving LQG via separation principle, satellite tracking example, steady- state LQG control and the compensator, reference tracking, designing for disturbance rejection.nnn## Unit-IVnnROBUST CONTROL APPROACHnIntroduction to robust control: Review of SISO Nyquist stability, robustness of LQR, robustness of LQG; Loop-transfer recovery, modelling uncertainty, four classic problems, unstructured/structured robust stability, performance robustnessnH∞ full-information control and estimation: Differential games, full-information control, Hamiltonian equation, Riccati equation to find state feedback, H∞ estimation.nH∞ output-feedback controller: Setting up the problem, H∞ output-feedback control as an estimation problem, Finite-time and steady-state control, μ synthesis, fitting a transfer function to D-scales and inverse D-scales, controller order reduction.nReferencesn- P. Albertos, A. Sala, Multivariable Control Systems: An Engineering Approach, Springer, 2004.n- Oleg Gasparyan, Linear and Nonlinear Multivariable Feedback Control: A Classical Approach, 2008.n- Papoulis & S. U. pillai, Probability, Random Varriables and Stochastic Process, Mc Graw Hill, Edition No. 04, 2002.n- S. Skogestad, & I Postlethwaite, Multivariable Feedback Control: Analysis And Design, Wiley, Edition No. 02, 2001.","course outcomes":"At the end of the course student will be able ton- Analyze the concept of modelling, identification, estimation and control of linear/nonlinear systemsn- Use the basics of classical and multivariable control in continuous/discrete-time systems.n- Use essential software for multivariable control system analysis and design and dynamic system modelling.n- Analyze the benefits and limitations of multivariable control systems and their applications."}
