{"course code":"EEPE33A","course title":"Power Quality","number of credits":"3-0-0=3","prerequisites":"EEPC-14, EEPC-27","course type":"PE","branch":"ee","course learning objectives":"- To introduce the power quality problemn- To educate on production of voltages sags, over voltages and harmonics and methods of control.n- To study overvoltage problemsn- To study the sources and effect of harmonics in power systemn- To impart knowledge on various methods of power quality monitoring","course content":"## UNIT-InnIntroduction to Power QualitynPower Quality (PQ): definitions, concerns, and evaluations. Terminology: under-voltage, over-voltage, transients, harmonics, voltage unbalance, voltage sags, voltage swells, flicker, interruptions, and power frequency variations Concepts of transients – short duration variations such as interruption - long duration variation such as sustained interruption. Sags and swells - voltage sag - voltage swell - voltage imbalance - voltage fluctuation - power frequency variations. International standards of power quality. Computer Business Equipment Manufacturers Associations (CBEMA) curve.nnn## UNIT-IInnVoltage Sags, Interruptions and OvervoltagesnSources of sags and interruptions - estimating voltage sag performance. Thevenin’s equivalent source - analysis and calculation of various faulted condition. Voltage sag due to induction motor starting. Estimation of the sag severity - mitigation of voltage sags, active series compensators. Static transfer switches and fast transfer switches. Sources of over voltages - Capacitor switching – lightningn- ferro resonance. Mitigation of voltage swells - surge arresters - low pass filters - power conditioners. Lightning protection – shielding – line arresters - protection of transformers and cables. An introduction to computer analysis tools for transients, PSCAD and EMTP.nnn## UNIT-IIInnPower System HarmonicsnHarmonic sources from commercial and industrial loads, locating harmonic sources. Power system response characteristics - Harmonics Vs transients. Effect of harmonics - harmonic distortion – voltage and current distortion - harmonic indices - inter harmonics – resonance. Harmonic distortion evaluation - devices for controlling harmonic distortion - passive and active filters. IEEE and IEC standards.nnn## UNIT-IVnnPower Quality MonitoringnMonitoring considerations, monitoring and diagnostic techniques for various power quality problems - modeling of power quality (harmonics and voltage sag) problems by mathematical simulation tools - power line disturbance analyzer – quality measurement equipment - harmonic / spectrum analyzer - flicker meters - disturbance analyzer. Applications of expert systems for power quality monitoring.nReferences:n- Roger. C. Dugan, Mark. F. McGranagham, Surya Santoso, H.Wayne Beaty, Electrical Power Systems Quality, McGraw Hill, 2003.n- J. Arrillaga, N.R. Watson, S. Chen, Power System Quality Assessment, Wiley, 2011.n- Eswald.F.Fudis and M.A.S.Masoum, Power Quality in Power System and Electrical Machines, Elsevier Academic Press, 2013.n- G.T. Heydt, Electric Power Quality, 2nd Edition. (West Lafayette, IN, Stars in a Circle Publications, 1994).n- M.H.J Bollen, Understanding Power Quality Problems: Voltage Sags and Interruptions, (New York: IEEE Press, 1999).n- G.J.Wakileh, Power Systems Harmonics – Fundamentals, Analysis and Filter Design, Springer, 2007.n- E.Acha and M.Madrigal, Power System Harmonics, Computer Modelling and Analysis, Wiley India, 2012.n- R.S.Vedam, M.S.Sarma, Power Quality – VAR Compensation in Power Systems, CRC Press, 2013.n- C. Sankaran, Power Quality, CRC press, Taylor & Francis group, 2002.","course outcomes":"Students who successfully complete the course will be able to understand and analyze power quality importance, events and their harmful effects to take the suitable precautionary measures."}
