{"course code":"ITOE40","course title":"Database Systems","number of credits":"3","prerequisites":"","course type":"OE","branch":"it","course learning objectives":"- To understand fundamentals of data models and to conceptualize a database system for user requirement.n- To study the fundamental of Database query language, like SQL and relational algebra.n- To learn the concept of normalization in database design.n- To learn fundamental concepts of transaction processing, concurrency control techniques and database recovery procedure.n- Understand the professional, ethical and security issues and responsibilities in database design.","course content":"- Introduction: Overview of file systems and Database Systems , Software Architecture of a typical DBMS, Data Models, Relational Data Model, Network Data Model, Hierarchical Data Model, Schemas and Instances, Database Administration and Control.n- Relational Model and Query Language: Overview of Relational Database, Key Integrity constraint, Relational Algebra, Relational Calculus: Domain Relational Calculus, Tuple Relational Calculus, SQL Fundamentals, Basic operators, Missing Information, Null Values, Additional Operations, Advanced SQL features, Embedded SQL, Dynamic SQL, Database Views.n- Database Design: Overview of Normalization, Database Anomalies, Functional Dependencies, Candidate and Super Key, Non-loss Decomposition, Dependency Preservation, Normal forms: First, Second, Third Normal, Boyce Codd Normal Form, Multi-valued Functional Dependencies and Fourth Normal Form, Join Dependencies and Fifth Normal Form, Denormalization.n- Transaction Processing: Overview of Database Transactions, Transaction states, Transaction Recovery, ACID Properties, Transaction Recovery: Two Phase Commit, Commit Points, Serializability, Concurrency control: Need for Concurrency, Locking Protocols: Binary lock, Two Phase Lock, Deadlock, Starvation, Transaction Timestamp.","reference books":"- A Silberschatz, H.F. Korth & S. Sudarshan: Data Base System Concepts, TMH, 1997.n- A.K. Majumdar and Bhattacharyya: Database Management Systems, THM, 1996.n- C.J. Date: An Introduction to Database systems 7th Ed. Addison Wesley, Indian Edition, 2000.n- Elmasri & Navathe : Fundamentals of Database Systems/Oracle 9i Programming 5th Ed. Pearson, 2009","course outcomes":"- To understand fundamental concepts, principles and applications of database system.n- To demonstrate database related programming languages and perform the basics of commercial relational systems.n- To apply the concepts of normalization on database design.n- To Design and Implement a small database project, considering the issues like concurrency control, recovery and security.n- Comprehend contemporary issues related to industry and government related to database domain."}
