{"course code":"ITPC22","course title":"Communication Systems","number of credits":"4","prerequisites":"ITPC10","course type":"PC","branch":"it","course learning objectives":"- Present overview structure of communication system.n- Understand the basic modulation techniques.n- Develop an understanding of implementation methodology of digital communication system.","course content":"- Spectral Analysis and Noise: Fourier series, Response of linear system Power spectral density, Fourier Transform, Convolution, Parseval’s Theorem, correlation between waveforms, Impulse Function, Ideal low pass filter. Hilbert Transform. Random variables, Cumulative distribution function, Probability density function, Average value of random variables Central Limit Theorem Noise and its sources, Methods of noise calculation in network and interconnected networks, Mathematical representation of random noise. Narrow band noise and its representation, Transmission of noise through linear systems, Noise figure, Noise temperature, Computation of signals to noise ratio, and noise bandwidth.n- Analog Modulation: Introduction, Amplitude Modulation, AM demodulators, Spectrum of AM signal, angle modulation, Phase and frequency modulation, spectrum of FM signal, bandwidth of FM signal; NBFM & WBFM, FM generation and demodulation methods.n- Pulse and Digital Modulation Techniques: Sampling theorem for low pass and band pass signals, time division multiplexing, frequency division multiplexing, concept of pulse amplitude modulation and pulse width modulation, demodulation of signals, pulse code modulation, delta modulation and adaptive delta modulation. Binary phase shift keying, differential phase shift keying, quadrature phase shift keying, M-ary PSK, QASK, Binary FSK, M-ary FSK, Minimum shift keying.n- Code Division Multiple Access Systems: Spread spectrum model, direct sequence spread signals, CDMA system based on frequency hopped spread spectrum signal, Uncertainty, Information and Entropy, Source coding theorem, Data compaction, Discrete memory less channels, Mutual information, Channel capacity, channel coding theorem, information capacity theorem.","reference books":"- Simon Haykin, Digital Communication, John Wiley.n- Taub and Schilling, Principles of Communication System, TMH.n- G. Kennedy, Electronic Communication System, TMH.n- J. G. Proakis, Digital Communications, MGH.","course outcomes":"- Learn the fundamentals of communication system.n- Identify the needs of digital communication in real life applications.n- Have knowledge of contemporary issues for implementation of communication system."}
