{"course code":"ITPC41","course title":"Machine Learning","number of credits":"4","prerequisites":"ITPC33, MAIR13, MAIR12","course type":"PC","branch":"it","course learning objectives":"- Be able to understand and apply supervised and unsupervised learning algorithms.n- Understand the fundamental concepts in machine learning and popular machine learning algorithms.n- Understand the concept of Deep Learningn- Be able to solve problems related to the application of machine learning algorithms with programming in Python/ MatLab.","course content":"- IntroductionnBasic definitions, types of learning, hypothesis space and inductive bias, evaluation, cross-validation, Instance based learning, Feature reduction, Collaborative filtering based recommendation, Gradient Decent learning.nKernel Methods and Support Vector MachinesnThe Two-Class Problem, Dual Representation, Soft Margin Classification; Origins of Kernel methods, Kernel Mapping, The Kernel Trick; Constructing Kernels, Support Vector Machines: Formulation and Computation; Radial Basis Function Networks; Positive Semi-Definite Kernels, Linear Kernel, Polynomial Kernel.nClustering and LearningnBasic Clustering Techniques, Standard k-Means (Lloyd) Algorithm, Generalized Clustering, Overpartitioning, Merging, Modifications to the k-Means Algorithm, k-Means Wrappers, Rough k- Means, Fuzzy k-Means, k-Harmonic Means Algorithm, Hybrid Clustering Algorithms; Estimation using Incomplete Data, Two classes, Multiple classes, Least squares for classification, Fisher’s linear discriminant, Relation to least squares, Fisher’s discriminant for multiple classes.nDeep LearningnNeural network: Perceptron, multilayer network, backpropagation, Introduction to deep neural network: Convolutional Neural Networks, its Architectures, convolution layers, pooling strategies and softmax layer.","reference books":"- T. Hastie, R. Tibshirani, J. Friedman. The Elements of Statistical Learning, 2e, 2008.n- Christopher Bishop. Pattern Recognition and Machine Learning. 2e.n- Machine Learning. Tom Mitchell. First Edition, McGraw- Hill, 1997.n- Introduction to Machine Learning Edition 2, by Ethem AlpaydinnCourse Outcome:n- Recognize major programming languages.n- Explain the stages of programming language interpretation and compilation.n- Understand fundamental concepts in machine learning and popular machine learning algorithms.n- Explain basics of computational learning theory.n- Hands-on problem solving with programming in Python and MatLab"}
