{"course code":"ITPC29","course title":"Computer Organization and Architecture","number of credits":"4","prerequisites":"ITPC10","course type":"PC","branch":"it","course learning objectives":"- Working of Computer Systems & its basic principlesn- Concepts of processor and control design.n- Concepts of pipelining techniques.n- Memory hierarchy and its organization.n- Concept of I/O devices and working.","course content":"- IntroductionnIntroduction to digital electronics: combinational circuits and sequential circuits. Basic Machine Principle, Structure and representation of real world data. Subroutine, Branching & Macro facility.nProcessor DesignnProcessor Organization, Information representation and Number format, Instruction cycle and Instruction format, Addressing modes, Arithmetic operation, timed point addition, subtraction, multiplication and division, ALU design, Parallel processing – Performance consideration, Pipeline processor.nControl DesignnInstruction sequencing and Interpretation, Hardware Control design method and Microprogrammed Control.nMemory organizationnMemory device characteristic, Random access and serial access memories, Virtual memory – memory hierarchies, Page replacement policies, Segments, pages and file organization, High speed memories – cache and associative memory.nSystem OrganizationnProgrammed I/O, DMA and interrupts, I/O processors & CPU – I/O interaction.","reference books":"- M.M. Mano: Computer System Architecture, 3rd Ed. PHI.n- J.P. Hayes: Computer Architecture and Organization, 3rd Ed. TMH, 1999.n- C.W. Gear: Computer organization and Programming, TMH.n- T.C. Bartee: Digital Computer Fundamental, TMH.n- A. S. Tanenbaum: Computer System Organization, PHI.","course outcomes":"- Understand the Computer System concepts.n- Understand the organization of a computer system in terms of its main componentsn- Understand the processor and control design of a computer system.n- Understand the various types of memory.n- Understand input/output mechanisms."}
