{"course code":"ITPE43","course title":"Advances in Computer Networks","number of credits":"4","prerequisites":"ITPC26","course type":"PE","branch":"it","course learning objectives":"To give the students an understanding of the principles behind the latest advances in network technology from the physical to application layer","course content":"- Introduction to IPv6nIPv6 protocol architecture, IPv6 addressing , IPv6 headers, Static & automatic address configuration, ICMPv6, Neighbor discovery, IPsec, Authentication header, Encapsulation security payload header, transport and tunnel Mode, Interoperation concepts, Dual stack servers, Tunnelling and header translation.nMobile IPnIntroduction to mobile IPv4, mobile IPv6, protocol over view of mobile IPv6, enhanced handover schemes, fast handover scheme, network mobility (NEMO), hierarchal mobile IPv6, security in mobile IP, VPN problems & solutions, bidirectional tunneling & route optimization, DHCPv6.nSoftware Defined NetworknSDN: Background and Motivation, SDN Data Plane and OpenFlow, Control Plane, Application PlanenCongestion Control in Wired and Wireless NetworksnTCP Congestion Control – fairness, scheduling and Delay modeling, QoS issues, differentiated services, Transport layer in Wireless Networks, IEEE 802.11a/b/n/g/p, 802.15, standards for Wireless.","reference books":"- Youngsong Mun and Hyewon Keren Lee , Understanding IPv6, Springer, 2010n- William Stallings, Foundations of Modern Networking: SDN, NFV, QoE, IoT, and Cloud, 2015n- Rajeev S. Koodli and Charles E. Perkins, Mobile Inter-networking with IPv6 : Concepts, Principles and Practices, Wiley, 2007n- Michael Welzl ,Network Congestion Control: Managing Internet Traffic, Wiley, 2005n- Marc Blanchet, Migrating to IPv6: A Practical Guide to Implementing IPv6 in Mobile and Fixed Networks, Wiley, 2005nCourse Outcomen- Understand the fundamentals of next generation computer networksn- Understand the issues of wired and wireless networking, current standards and new application areasn- To recognize the need of service integration and discuss how it can be accomplished."}
