{"course code":"ITPE71","course title":"Advance Database Systems","number of credits":"3","prerequisites":"ITPC25","course type":"PE","branch":"it","course learning objectives":"- To understand the application and fundamentals of Advance Database Systems in real- world.n- To study the basics of query processing and optimization techniques in Advanced Database systems.n- To lean the basic issues of transaction processing and concurrency control in Distributed and Multidatabase system.n- To develop the knowledge of various design and implementation issues of Advance Database for given business requirement.","course content":"- Introduction: Overview of Distributed Database, Data Delivery Alternatives, Promises of DDBSs, Distributed DBMS Architecture, Design Issues, Fragmentation: Horizontal, Vertical, Hybrid Fragmentation, Allocation and Information Requirements, Allocation Model, DD Design approach: Top-down and Bottom-Up Design Methodology, Schema Matching, Schema Heterogeneity, Linguistic Matching Approaches, Constraint-based Matching Approaches, Learning-based Matching, Combined Matching Approaches, Schema Integration, Schema Mapping.n- Distributed Database Query Processing: Overview of Distributed Query Processing, Complexity of Relational Algebra Operations, Layers of Query Processing, Query Decomposition: Normalization, Analysis, Elimination of Redundancy, Rewriting, Localization of Distributed Data, Reduction for fragmentation, Query Optimization: Static, Dynamic and Hybrid,n- Multidatabase Query Processing: Issues in Multidatabase Query Processing , Multidatabase Query Processing Architecture, Query Rewriting Using Views, Datalog Terminology, Rewriting in GAV, Rewriting in LAV, Query Optimization and Execution, Heterogeneous Cost Modeling, Heterogeneous Query Optimization, Adaptive Query Processing , Query Translation and Execution.n- Introduction to Transaction Management: Definition of a Transaction, Termination Conditions of Transactions, Characterization of Transactions, Formalization of the Transaction Concept, Properties of Transactions, ACID, Types of Transactions, Flat Transactions, Nested Transactions, Workflows.","reference books":"- M. Tamer Özsu, Patrick Valduriez, Principles of Distributed Database Systems, 3rd edition, Springer, 2012.n- Hector Garcia-Molina, Jeffrey Ullman,, Jennifer Widom, Database System Implementation, Prentice- Hall, 2000.n- A. Silberschatz, H. F. Korth, S. Sudarshan, Database System Concepts,. 5th Edition. McGraw‐Hill.","course outcomes":"- To understand fundamental concepts, principles and applications of Adv. Database Systems.n- To demonstrate the knowledge of database system and evaluate Database design.n- To apply state-of-art techniques to design advanced techniques in Database Systems.n- Comprehend contemporary trend and issues in Advance Database System design related to research domain, industry and government."}
