{"course code":"ITPE47","course title":"Game Theory and Applications","number of credits":"4","prerequisites":"MAIR13","course type":"PE1","branch":"it","course learning objectives":"Objective of the course is to make student understand the concepts of game theory and its applications to various discipline engineering.","course content":"- Introduction And Outline Of The Course: Definitions, Utilities, Rationality, Intelligence, Common Knowledge, Classification Of Games.n- Non-Cooperative Game Theory: Extensive Form Game, Strategic Form Games With Illustrative Examples, Dominant Strategy Equilibria, Pure Strategy Nash Equilibrium With Illustrative Examples And Key Results, Mixed Strategy Nash Equilibrium With Illustrative Examples And Key Results Such As The Nash Theorem, Computation Of Nash Equilibria And Introduction To Algorithmic Theory, Matrix Games: Saddle Points, Minimax Theorem, Bayesian Games, Bayesian Nash Equilibrium, Evolutionary Game Theory (Ess Strategies), Repeated Game.n- Mechanism Design: The Mechanism Design Environment, Social Choice Functions With Illustrative Examples, Implementation Of Social Choice Functions, Incentive Compatibility And Revelation Theorem, Gibbard-Satterthwaite And Arrow Impossibility Theorem, Vickrey-Clarke-Groves (Vcg) Mechanisms, Bayesian Mechanisms (Dagva), Revenue Equivalence Theorem, Myerson Optimal Auction, Further Topics In Mechanism Design.n- Cooperative Game Theory: Correlated Strategies And Correlated Equilibrium, The Nash Bargaining Problem, Coalitional Games (Transferable Utility Games), The Core, The Shapley Value, Other Solution Concepts: Kernel, Nucleolus.nText Books, and/or reference materialn- Martin J. Osborne. An Introduction to Game Theory. Oxford University Press. Indian Edition, 2003.n- Roger B. Myerson. Game Theory: Analysis of Conflict. Harvard University Press, 1991.n- Y. Narahari, Dinesh Garg, RamasuriNarayanam, HastagiriPrakash. Game Theoretic Problems in Network Economics and Mechanism Design Solutions. Springer, London, 2009.n- NPTEL website, http://nptel.ac.in/syllabus/106108053/.","course outcomes":"- To understand the concepts of game theory and its mathematical foundationn- To identify fields of application of game theory in real-lifen- To design and implement game theoretic algorithms for automationn- To apply game theoretic strategies in industrial engineering problems"}
