{"course code":"ITPE41","course title":"Graphics & Visualization","number of credits":"4","prerequisites":"MAIR12","course type":"PE","branch":"it","course learning objectives":"- Comprehensive introduction for computer graphics leading to the ability to understand contemporary terminology, progress, issues, and trendsn- Involves processing and transforming large, incomprehensible datasets into a format more easily understood by humansn- Introduce theoretical methods for two-dimensional and three-dimensional graphics with applications to visualization techniques","course content":"- Introduction, Scan Conversion, 2D & 3D - Transformation and Viewing:nOverview of computer graphics, representing pictures, preparing pictures for presentation, presenting previously prepared pictures, CRT technologies - Raster Scan Display, Computer graphics software. Scan Conversion: Points & lines, Line drawing algorithms; DDA algorithm, Bresenham’s line algorithm, Circle generation algorithm; Ellipse generating algorithm; scan line polygon, fill algorithm, boundary fill algorithm, flood fill algorithm. 2D & 3D - Transformation and Viewing: Translation, rotation, scaling; Matrix representations & homogeneous coordinates, transformations between coordinate systems; reflection shear; Transformation of points, lines, parallel lines, intersecting lines; Viewing pipeline, Window to Viewport co-ordinate transformation, clipping operations, point clipping, line clipping, clipping circles, polygons & ellipse. 3D Transformation: Translation, rotation, scaling & other transformations, Rotation about an arbitrary axis in space, reflection through an arbitrary plane, general parallel projection transformationn- Clipping, Curves Fractals, Geometric modeling, Hidden Surfaces and Color & Shading Models: Viewport clipping, 3D viewing, perspectives & Depth Cueing. Curves and Fractals: Curve representation, surfaces, designs, Bezier curves, B-spline curves, end conditions for periodic B-spline curves, rational B-spline curves. Geometric modeling: Elementary geometric algorithms for polygons, boundary representations, constructive solid geometry, spatial data structures. Hidden Surfaces and Color & Shading Models: Depth comparison, Z-buffer algorithm, Back face detection, BSP tree method, the Printer’s algorithm, scan-line algorithm; Hidden line elimination, wire frame methods, fractal – geometry. Color & Shading Models: Introduction, Modeling Light Intensities and Sources, Diffuse Reflection, Lambert’s Cosine Law, Specular Reflection, Halftoning, Color Models - RGB Color, CMY Color, realistic image synthesis techniques, textures and image-based renderingn- Visual saliency, perceptual attractiveness, Visualization of experimental and simulated data: Perception-Oriented and Non-Photorealistic Rendering, human perception of saliency on object surfaces, relief mapping of textures. Visualization of experimental and simulated data: Surface construction from scattered data, 3-D data arrays and 2-D cross sections, Elevation maps, topological maps, contour maps and intensity maps; fractals for visualization of complex and large data sets, Algebraic stochastic and Geometric fractals, Modeling of natural forms and textures using fractals, Visualization of multi variate relations, Flow visualization and hyper streamlines, Visualization of Meteorological, cosmological, seismic, biological data for scientific decision making, Data and Geometry, Height field and contours, Visualizing surfaces and scalar fields, Isosurfaces and marching cubes, Direct volume rendering, Vector-field visualization, Tensor-visualizationn- Animation, Visual Realism, Image/Video based rendering, Animation and Capture:nModelling issues in dynamic visualization, Behavioural animation, walk through coordinate transformation and view transformation, virtual reality interfaces, Interactive and immersive systems for Prototyping and visualization, Visualization in concurrent engineering, Interactive multimedia technology and standards for Video-Graphics-Audio integration and tele-video conferencing. Visual Realism: Natural effects for object rendering, iterative ray tracing, radiosity, plenoptic function, Perlin noise, lighting & shadow, materials effect, BRDF, volumes and photons, fire and water, fog, smoke modeling etc. Image/Video based rendering: Video mosaic synthesis, video resizing and stabilization,nNovel view Synthesis; Photosynth, retargeting, 3D cut and paste. Animation and capture: Motion Control, Orientation Parameterization, Quaternions, Animating Articulated Structures, Inverse Kinematics, hard and soft constraints, implicit surfaces; Stylized rendering and illusion, facial animation, appearance capture.","reference books":"- Edward Angel and Dave Shreiner, Interactive Computer Graphics: A Top-Down Approach with Shader-Based OpenGL, Pearson, 6th edition, 2011.n- F.S. Hill Jr., Computer Graphics Using OpenGL, Pearson, 3rd edition, 2006.n- John F. Hughes, Andries van Dam, Morgan McGuire, David F. Sklar, James D. Foley, Steven K. Feiner, and Kurt Akeley, Computer Graphics: Principles and Practice, Pearson Education, 1st edition, 2013.","course outcomes":"- Use the underlying architecture, algorithms, mathematical concepts, supporting computer graphicsn- Enhance their perspective of modern computer system with modeling, analysis and interpretation of 2D and 3Dn- Fundamental graphic design theory and principles as they relate to current trends in visual communicationn- Organize information to make compelling and experimental visual expressions for presentationn- Explain and understand fundamental concepts within information visualization and scientific visualization"}
