{"course code":"ITPE35","course title":"Information Security","number of credits":"4","prerequisites":"MAIR13","course type":"PC3","branch":"it","course learning objectives":"- To introduce the concept of security in cyber world.n- To make students familiar with different aspects of information security and its applications.n- To introduce the mathematical fundamentals involve in cryptography.","course content":"- Introduction to Cryptography - Meaning of security, attacks, Computer Criminals, Methods of defense, Introduction, Substitution ciphers, Transpositions, Data encryption standard, AES Encryption Algorithm, Public key Encryption, Uses of Encryption.n- Introduction to Number Theory - Divisibility, Division Algorithm, Euclidean Algorithm; Congruences, Complete Residue systems, Reduced Residue systems; Chinese Remainder Theorem, Finite Fields, Primitive Roots; Quadratic Residues, Primality Tests; Introduction to Elliptic Curve Cryptography.n- Operating System Security - Overview, File Protection Mechanisms, User Authentication, Designing Trusted Operating System, Security Policy, Models of Security, Trusted Operating System Design; Risk analysis, legal, Privacy & Ethical issues, Computer Security: Protecting Programs and Data, Secure Program, Non Malicious Program errors, Viruses and other malicious code, Targeted Malicious Code, Control against Program.n- Network and Database Security - .Network security: Network Concepts, Threats in Networks, Networks, Security controls, Firewalls, Intrusion Detection System, Secure Email. Database security: Introduction to Database, Security Requirements, Reliability and Integrity, Sensitive Data, Inference, Multilevel database.nSuggested Books:n- Charles P. Pfleeger, Share Lawrence Pfleeger, Security in Computing, Pearson Education, 2/e.n- William Stallings, Cryptography and Network Security, PHI, 4/en- Neal Koblitz, A Course in Number Theory and Cryptography, Springer 2006","reference books":"- An Introduction to theory of numbers, Niven, Zuckerman and Montgomery, (Wiley 2006)n- Elliptic curves: number theory and cryptography, Lawrence C. Washington, (Chapman & Hall/CRC 2003)n- Charlie Kaufman, Perlman & S Peeciner, Network Security, Pearson Education, 2/e.nCourse Outcome:n- Able to understand the information security concepts.n- Able to distinguish different cipher schemes and apply them as per the requirement.n- Able to strengthen the mathematical fundamentals for cryptography.n- Make a strong base for network security concepts."}
