{"course code":"ITPE48","course title":"Cyber Security and IT Infrastructure","number of credits":"4","prerequisites":"","course type":"PE","branch":"it","course learning objectives":"- To introduce the concept of cyber security.n- To make students familiar with different aspects of a secure cyber space.n- To introduce the secure IT infrastructure design concepts.n- To make them aware of the IT laws and policies, agencies etc.","course content":"- Introduction to Cyberspace - Cyberspace environment and its characteristics, Developing a design approach, Planning for cyberspace operation. Cyberspace Operations: Network Operations (NETOPS), Defensive Cyberspace Operations (DCO), Offensive Cyberspace Operations (OCO), Operational methodologies to conduct cyberspace operations.n- Cyberspace Design - Design a cyberspace operation and integrate it with a Joint Operations plan, Practice the presented methodologies in a practical application exercise. Designing Cyber Related Commands: Mission statements, Essential tasks, Organizational structures, Tables of organizations, Developing the cyber workforce, Plan your own training programs within your organization.n- Introduction to Risk Management - An Introduction to Risk Management: Introduction to the Theories of Risk Management; The Changing Environment; The Art of Managing Risks. Vulnerability Issues: Operating System Vulnerabilities; Application Vulnerabilities; Public Domain or Commercial Off-the-Shelf Software; Connectivity and Dependence; Vulnerability assessment for natural disaster, technological hazards, and terrorist threats; implications for emergency response, vulnerability of critical infrastructures.n- IT Awareness - Introduction to the Legal Perspectives of Cybercrimes and Cyber security, Cybercrime and the Legal Landscape around the World, Why Do We Need Cyber laws, The Indian IT Act, Challenges to Indian Law and Cybercrime Scenario in India, Consequences of Not Addressing the Weakness in Information Technology Act. Ethics, Legal Developments, Cyber security in Society, Security in cyber laws case studies, General law and Cyber Law-a Swift Analysis.nSuggested Books:n- Paulo Shakarian et al. “Introduction of Cyber Warfare: A Multidisciplinary Approach,” syngress, Elsevier 2013.n- Sunit Belapure and Nina Godbole, Cyber Security: Understanding Cyber Crimes, Computer Forensics And Legal Perspectives, Wiley India Pvt. Ltd, 2011.n- Jason Andress et al. “Cyber Warfare: Techniques, Tactics and Tools for Security Practitioners” Syngress, Elsevier 2013.n- Malcolm Harkins, Managing Risk and Information Security, Apress, 2012.","reference books":"- Andreas Von Grebmer, Information and IT Risk Management in a Nutshell: A pragmatic approach to Information Security, 2008, Books On Demand Gmbh.n- Jeffery carr et al, “Inside Cyber Warfare: Mapping the Cyber Underworld,” O’Reilly Publication December 2012.n- Jonathan Rosenoer, “Cyber Law: The law of the Internet”, Springer-Verlag, 1997.n- Mark F Grady, Fransesco Parisi, “The Law and Economics of Cyber Security”, Cambridge University Press, 2006n- The Indian IT ActnCourse Outcome:n- Able to understand the Cyberspace Environment and Design.n- Have a proper idea about Cyberspace Operations and Integration.n- Able to identify, analyze and articulate the importance of managing IS-related risk and security issues in organizations.n- Able to identify, analyze, synthesize and articulate the major theories and concepts associated with IS failure and the management of IS risk, including factors argued to lead to unsatisfactory outcomes with respect to IS/IT and Information Security.n- Understand key terms and concepts in cyber law, intellectual property and cyber crimesnOpen Elective – I"}
