{"course code":"ITPE42","course title":"Advance Multimedia Technologies","number of credits":"4","prerequisites":"","course type":"PE","branch":"it","course objectives":"The objective of the course is to understanding of theories and practices of current multimedia system architecture, requirements, multimedia information management, human & body animation, multimedia security and digital rights management, etc. Student should be aware with the factors involved in multimedia systems performance, integration and evaluation.","course content":"- Introduction:nMultimedia today, Impact of Multimedia, Multimedia Systems, Components and Its ApplicationsnText: Types of Text, Ways to Present Text, Aspects of Text Design, Character, Character Set, Codes, Unicode, Encryption.nAudio: Basic Sound Concepts, Types of Sound, Digitizing Sound, Computer Representation of Sound (Sampling Rate, Sampling Size, Quantization), Audio Formats, Audio tools, MIDI.nImage and Video: Formats, Image Color Scheme, Image Enhancement; Video: Analogue and Digital Video, Recording Formats and Standards (JPEG, MPEG, H.261) Transmission of Video Signals, Video Capture, and Computer based Animation.n- Storage models and Access Techniques: Magnetic media, optical media, file systems (traditional, multimedia) Multimedia devices – Output devices, CD-ROM, DVD, Scanner, CCD.nImage and Video Database: Image representation, segmentation, and similarity based retrieval, image retrieval by color, shape and texture; Indexing- k-d trees, R-trees, quad trees; Case studies- QBIC, Virage, Video Content, querying, video segmentation, indexing.n- Document Architecture and Content Management: Content Design and Development, General Design Principles. Hypertext: Concept, Open Document Architecture (ODA), Multimedia and Hypermedia Coding Expert Group (MHEG), Standard Generalized Markup Language (SGML), Document Type Definition (DTD), Hypertext Markup Language (HTML) in Web Publishing. Case study of Applications.n- Multimedia Applications:nInteractive television, Video-on-demand, Video Conferencing, Educational Applications, Industrial Applications, Multimedia archives and digital libraries, media editorsnSecured Multimedia:nSecured Multimedia, Digital Rights Management Systems, and Technical Trends - Multimedia encryption - Digital Watermarking - Security AttacksnMultimedia Authentication:nPattern, Speaker and Behavior Recognition - Speaker Recognition – Face RecognitionnMultimedia Forensics:nDigital Forensics taxonomy, goals/requirements - Forensic Data Acquisition - Digital Forensics Tools - Forensics Analysis and Validation - File and Network Forensics -Techniques - Application forensics- Email, Graphics and Multimedia ForensicsnMultimedia Security Applications:nMedia Sensor Network - Voice over IP (VoIP) Security - DTH -Video Conference","course outcomes":"- Understand in general theories of multimedia technology.n- Understand how to store and manage the data that can provide efficient access.n- Understand the architecture of document that can provide efficient access and its efficient management.n- Understand how to use multimedia technology in different areas like video processing, data processing in open environment.n- Understand the issues related to security of data and its solution.nSuggested Books:n- Ralf Steinmetz and Klara Nahrstedt, Multimedia: Computing, Communications & Applications, Pearson Edn- Nalin K. Sharda, Multimedia Information System, PHIn- Fred Halsall, Multimedia Communications, Pearson Edn- Koegel Buford, Multimedia Systems, Pearson Edn- Fred Hoffstetter, Multimedia Literacy, McGraw Hilln- Ralf Steinmetz and Klara Nahrstedt, Multimedia Fundamentals: Vol. 1- Media Coding and Content Processing, PHIn- J. Jeffcoate, Multimedia in Practice: Technology and Application, PHIn- Prabhat K. Andleigh & Kiran Thakrar, Multimedia Systems Design, PHIn- Wenjun Zeng, Heather Yu and Ching Yung Lin, Multimedia Security technologies for Digital rights Management, Elsevier Inc 2006n- Chun Shien Lu, Multimedia Security: Steganography and Digital Watermarking techniques for Protection of Intellectual Property, Springer Inc 2007n- Subramanian V. S., Principles of Multimedia Database Systems, Elsevier Publishers, 2013n- Wesley, 2003. Subramanian S., Principles of Multimedia Database Systems, Elsevier, 1998n- Date C. J., An Introduction to Database Systems, 8th Editionn- Khoshafian S. and Bakor A. B., Multimedia and Imaging Databases, Elsevier, 1996n- Kingsley Nwosu C., Multimedia Database Systems: Design and Implementation Strategies, Kluwer Academic Publishers, 1996n- Lynne Dunckley, Multimedia Databases: An Object-Relational Approach, Pearson Education, 2003"}
