{"course code":"ITPE39","course title":"Microprocessor and Interfacing","number of credits":"4","prerequisites":"ITPC10, ITPC29","course type":"PE","branch":"it","course learning objectives":"- To provide an introduction to the basic principles and applications of microprocessor to solve real life problems.n- To give an expose of assembly language programming.n- To make familiar with the implementation of various interfaces with microprocessor.","course content":"- Introduction & ArchitecturenHistory of microprocessors, 8086 architecture, internal operation, Machine language instructions, Instruction execution time (Timing Diagram: Fetch Cycle, Execution Cycle).nAssembly Language ProgrammingnInstruction format, Instruction Types (data transfer instruction, arithmetic instructions, branch instruction, NOP & HLT instructions, flag manipulation instruction, logical instruction, shift and rotate instruction, String instructions), Assembler directions and operators.nMemory Interfacing and Modular ProgrammingnMemory Interfacing (Static RAMs & ROMs), Stacks, Procedures, macros – local labels and nested macros.nI/O Interface and I/O ProgrammingnI/O consideration, programmed I/O block transfer, Serial communication, asynchronous, synchronous, physical, 8251A; Parallel communication: 8255 A, 16-bit bus interface, Basic Interrupt processing, Interrupt and interrupt routines, 8259A Programmable Interrupt Controller, DMA with controller (8237), 8254 Programmable interval Timer (8253/8254), Interfacing to A/D and D/A converters, Stepper motor interfacing.","reference books":"- Liu and Gibson, Microcomputer Systems: 8086/8088 family: Architecture, Programming and Design, PHI.n- D.V. Hall, Microprocessors and Interfacing, TMH.n- A. K. Ray & K.M. Bhurchandi, Advanced Microprocessors and Peripherals: Architecture, Programming and interfacing, TMH.n- Bray, The Intel Microprocessor 8086/8088-Pentium: Architecture, Programming and interfacing , PHIn- James L. Antonakos, The Intel Microprocessor family H/W and S/W Principles and Applications, Cengage Learning","course outcomes":"- Develop an understanding of basic concepts of microprocessors.n- Understand the instruction set of 8086.n- Able to apply the knowledge of assembly language to solve various problems.n- Grasp an understanding of various peripheral device interfaces with 8086.n- Able to design and implement various interfaces in real life different applications."}
