{"course code":"ITPE62","course title":"Software Project Management","number of credits":"4","prerequisites":"ITPC27","course type":"PE","branch":"it","course learning objectives":"Understand the different activities in software project development i.e, planning, design and management.","course content":"- Conventional Software Management.nEvolution of software economics. Improving software economics: reducing product size, software processes, team effectiveness, automation through software environments. Principles of modern software management.nSoftware Management ProcessnFramework,: Life cycle phases- inception, elaboration, construction and training phase. Artifacts of the process- the artifact sets, management artifacts, engineering artifacts, pragmatics artifacts. Model based software architectures. Workflows of the process. Checkpoints of the process.nSoftware Management DisciplinesnIterative process planning. Project organisations and responsibilities. Process automation. Project control And process instrumentation- core metrics, management indicators, life cycle expections. Process discriminants.","books":"- Software Project management, Walker Royce, Addison Wesley, 1998.n- Project management 2/e ,Maylor.n- Managing the Software Process, Humphrey.n- Managing global software Projects, Ramesh, TMH,2001.","course outcomes":"- Understanding the evolution and improvement of software economics according to the basic parameters and transition to the modern software management.n- Learning the objectives, activities and evaluation criteria of the various phases of the life cycle of software management process.n- Gaining knowledge about the various artifacts, workflows and checkpoints of the software management process and exploring the design concept using model based architecture from technical and management perspective.n- Develop an understanding of project planning, organization, responsibilities, automation and control of the processes to achieve the desirable results."}
