{"course code":"MEIR-12","course title":"Introduction to Mechanical Engineering","number of credits":"2.0","prerequisites":"Nil","course type":"EPR","branch":"me","course learning objectives":"- To introduce the basic concepts and applications of Mechanical Engineering.n- To demonstrate importance of Mechanical Engineering in present day scenario.n- To be able to understand the concept of forces.n- To be able to understand thermodynamics and their various systems","course content":"## UNIT- InnHistory and evolution of Mechanical Engineering and applications, invention in Mechanical Engineering: timeline; case study. (3 hrs)nnn## UNIT- IInnForce systems: moment, couple and resultant, free body diagrams & equilibrium; centroid, centre of mass; moment of inertia: area moment of inertia, mass moment of inertia, product of inertia of different shapes; friction: static & kinetic friction, angle of repose, applications: wedge, screws, screw jack; trusses & frames; virtual work. (7 hrs)nKinematics & dynamics of particles & rigid bodies in plane motion; impulse & momentum (linear & angular) and energy formulation, collisions. (5 hrs)nnn## UNIT- IIInnIntroduction to thermodynamics, thermodynamic systems and control volume: system, boundary and surroundings; closed, open and isolated system, homogeneous and heterogeneous system, macroscopic and microscopic viewpoint, thermodynamic properties: intensive and extensive, state, path, process and cycle, point function, path function, thermodynamic equilibrium, quasi-static process, concept of continuum, zeroth law of thermodynamics, measurement of temperature: thermometers, thermocouples, pressure: atmospheric, absolute, and gauge pressure, specific heat and latent heat, thermodynamic concept of work, p-dv work, displacement work, indicator diagram, free expansion with zero work transfer, modes of heat transfer. (6 hrs)nnn## UNIT –IVnnEngineering materials: metals, alloys, ceramics, composites, polymers; their properties and applications, selection criteria of materials for engineering applications, evolution of manufacturing processes, selection criteria of manufacturing processes, introduction to manufacturing systems, plant layout and material handling, fundamentals of NC & CNC, product development cycle, case study. (7 hrs)","course outcomes":"At the end of the course, students will be able to understandn- History and evolution of Mechanical Engineering, and recent developmentsn- Static and dynamic for particle and rigid body and apply to simple practical problemsn- Thermodynamic systems, temperature measurements, different temperature measuring instruments and will be able to apply to simple practical problemsn- Different materials, manufacturing processes and principles of selection of materials and manufacturing processes for engineering applications.","reference books":"- Engineering Mechanics: Statics and Dynamics – J.L. Meriam & L.G. Kraige.n- Engineering Mechanics (Dynamics), Hibbeler, Pearson Education (Singapore), Pvt. Ltd.n- Engineering Mechanics: Timoshenko & Youngn- Engineering Mechanics (Statics).-Hibbelern- Engineering Mechanics: Statics and Dynamics – Shames, Prentice-Hall (India).n- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.n- M P Groover, Principles of Modern Manufacturing, Wiley.n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.n- Yunus A. Cengel and Michael A.Boles, Thermodynamics – An Engineering Approach, McGraw Hill Education.n- P K Nag, Engineering Thermodynamics, McGraw Hill Education.n- Beer Johnston, Mechanics of Materials, McGraw Hill Education.n…..………………….………………………………………………………………………..nSCHEME OF EXAMINATIONnB.Tech (Mechanical Engineering) 3rd Semester"}
