{"course code":"MEIR-11","course title":"Engineering Practice","number of credits":"2.0","prerequisites":"NIL","course type":"EPR","branch":"pie","course learning objectives":"- To introduce the basic concepts and fundamental Knowledge of engineering practices such as fitting, wood working, foundry, machining, welding, etc. for manufacturing a product.n- The other objective of this course is to prepare the students to understand the various tools and equipment’s used in these processes and their working principle.","course content":"## UNIT InnIntroductionnIntroduction to engineering practices, safety measures.nFitting shopnIntroduction, classification of metals: ferrous and nonferrous, fitting tools: measuring and marking tools, marking schemes for a fitting jobs, cutting tools: files specifications and uses, hacksaw, chisels, clamping tools: Vice, U-clamp, striking tools: hammers, taps and tapering process.n[4 hrs]nnn## UNIT IInnCarpentry shopnIntroduction of carpentry/Joinery, wood working: types of woods, advantage of wood, seasoning of wood, carpentry tolls: measuring tools, marking tolls, cutting tools: saws, chisels, planning tools, drilling tools, striking tools, drilling tools, wood working joints, wood working lathe,nFoundry ShopnIntroduction, foundry hand tools, measuring boxes, ladle, moulding, machines, furnaces.nnn## UNIT IIInnMachining Shopn[6 hrs]nLathe, description of lathe: headstock, tailstock, gearbox, carriage, apron, cutting speed, feed &depth of cut, cutting tools, Chucks: 3 jaw, 4 jaw. [2 hrs]nnn## UNIT IVnnIntroduction, classification of welding processes, advantages, disadvantage and applications of welding, arc welding & gas welding equipment’s, soldering & brazing [2 hrs]","course outcomes":"At the end of the course student will be able to:n- Understand the fundamental concept of various basic engineering practices namely fitting, carpentry, foundry, machining welding, etc.n- Decide and recommended appropriate tools and equipment for different manufacturing techniques.n- Develop their communication skills in oral, written and developed modes.n- Function effectively in teams and within a diverse environment.n- Understanding professionalism, ethics and the associated responsibilities.","reference books":"- S K Hajra Choudhury, Nirjhar Roy, A K Hajra Choudhury, Elements of workshop Technology (vol. 1&2 ), media promoters.n- B S Raghuwanshi, A Course in Workshop Technology (manufacturing Process vol 1 Dhanpat Rai & CO.n- W A J Chapman, Workshop technology in SI unit (part – 1 &2), Mc Graw Hill Education.n- MP Groover, Principles of Modern Manufacturing, Wiley.n- Kalpakjian, Manufacturing Process for Engineering Materials, Pearson Education India.nSCHEME OF EXAMINATION"}
