{"course code":"MELR-20","course title":"Internal Combustion Engines and Gas Turbines (Practical)","number of credits":"1","prerequisites":"","course type":"ELR","branch":"me","course learning objectives":"The objective of course isn- To understand the performance of I C Engine.n- To analyze the various parameters related to I C Engine.n- To study boiler operations.n- To study the fuel system of engine.","course content":"- To make a trial on single cylinder 4 –stroke Diesel Engine to calculate B.H.P., S.F.C. and to draw its characteristics curves.n- To make a trial on 4- stroke high – speed diesel engine and to draw its Heat Balance Sheet.n- To make a trial on Wiley’s jeep Engine at constant speed to calculate B.H.P., S.F.C., thermal efficiency and to draw its characteristic Curves.n- To make Morse Test to calculate IHP of the multi cylinder petrol engine and to determine its mechanical efficiency.n- To study Boiler and its components.n- To study the following models:nnnnGas TurbinennnWankel Enginen- Gas Turbinen- Wankel Enginen- To studynnnnVariable compression ignition Engine.nnnBraking system of automobile in the Lab.n- Variable compression ignition Engine.n- Braking system of automobile in the Lab.n- To study a Carburetor.n- To studynnnnFuel Injection System of a C.I. EnginennnBattery ignition system of S.I. Enginen- Fuel Injection System of a C.I. Enginen- Battery ignition system of S.I. Enginen- To study multi-cylinder four strokes vertical Diesel Engine test RIG with Hydraulic Dynamometer.","course outcomes":"- By the end of this education program, the students will be able to:n- To calculate various performance parameters related to I C Engine.n- To draw the heat balance sheet of Engine.n- Understand the performance of Variable compression Engine.n- To make trial run of Engine and recording reading from the measuring instruments to evaluate performance.nReference:n- Thermal Engineering by r.k.rajput 7th edition bookn- An Introduction to Thermodynamics, Y.V.C. Rao, University Press (India) Private Limited, Revised Edition, 2004).n- Thermodynamics: an Engineering Approach, Y.A.Cengal and M.A.Boles, McGraw Hill (Fifth edition).n- Fundamentals of Classical Thermodynamics, G.VanWylen, R.Sonntag and C.Borgnakke, John Willey & Sons (Fourth edition).n- NPTEL Videos courses of Basic and Applied Thermodynamics (https://nptel.ac.in/course.php)n- Edx Videos courses of Thermodynamics (https://courses.edx.org/courses/ coursev1:IITBombayX+ME209.1x+1T2017 /course/)n…..………………….……………………………………………………………………….."}
