{"course code":"MELR-16","course title":"Theory of Machines (Practical )","number of credits":"1","prerequisites":"Dynamics of Machines","course type":"ELR","branch":"me","course learning objectives":"To prepare students for kinematic and dynamic of various machines and mechanisms.","course content":"- To determine experimentally the ratio of cutting to idle time to the crank & slotted lever (QRM) & Compare the result with theoretical values. Plot the following:n- θ v/s displacement of slidern- θ v/s velocityn- θ v/s accelerationn- To determine velocity & acceleration of slider in Slider Crank mechanism and plot the following:n- θ v/s displacement of slidern- θ v/s velocityn- θ v/s acceleration Compare the values of velocities and acceleration with those obtained theoretically. Assume W= 1 rad/secn- To determine the values of coefficient of friction between the screw & nut of jack while:n- Raising the loadn- Lowering the loadn- To draw experimentally a curve of the follower displacement v/s cam angle. Differentiate the above curve to get velocity & acceleration plot & compare the values with those obtained analytically.n- To determine the value of coefficient of friction between belt & pulley and plot a graph between log T1/T2, &θ and measure the slip and creep in belt drive.n- To determine the value displacement, velocity and acceleration of driven shaft of Hook’s joint for a constant speed of the driven shaft.n- To find experimentally the gyroscopic couple on motorized Gyroscope and compare with applied couple.n- To find critical speed experimentally and to compare whirling speed of shaft with theoretical values.n- To perform the experiment of balancing of rotating parts and find unbalanced couples and force.n- To find experimentally the Coriolli's component of acceleration and compare with theoretical values.n- To study different types of Centrifugal governor.n- To measure Epicyclic Gear ratio between input shaft and output shaft.","course outcomes":"Students are able to perform the static and dynamic analysis of mechanisms.n- Should be able to perform the experiment on balancing of masses.n- Able to perform the experiment on various mechanisms.n- Able to perform the experiment of Coriolli’s component of acceleration.n- Knowledge of Gyroscopic Motion, Governors and Gear Tran…..………………….……………………………………………………………………….."}
