{"course code":"MELR-17","course title":"Numerical Methods and Computer Programming (Practical )","number of credits":"1","prerequisites":"CSIR-11","course type":"ELR","branch":"me","course learning objectives":"- To Embedding the skills of programming with mathematical formulation of dynamic analysis.n- The source codes for the following problems are to be developed by the students and results should be verified.n- The programming has to be done in MATLAB environment using C style i.e functions available in MATLAB have to be used only for comparing the results obtained from the program developed by the students.","course content":"## UNIT-Inn- Solution to Non-linear equation in single variable using the method of successive Bisectionn- Solution to Non-Linear Equation in single variable using the Newton- Raphson methodn- Solution to Non-Linear Equation in single variable using the secant method.nnn## UNIT-IInn- Solution to a system of simultaneous algebraic equations using the Gaussian elimination procedure.n- Solution to a system of simultaneous algebraic equations using the Gauss- Seidel iterative method.n- Solution to a system of simultaneous algebraic equations using the Crout’s triangularisation method.n- Solution to a system of simultaneous algebraic equations using the Gauss- Seidel iterative method employing the technique of successive relaxation.n- Solution to a system of simultaneous algebraic equations using the LU decomposition.nnn## UNIT-IIInn- Curve fitting i.e. obtaining a best fit curve of linear, quadratic or higher polynomial. And find the error of fit.n- Numerical solution to an ordinary differential equation using the Euler’s methodn- Numerical solution to an ordinary differential equation using the Range-Kutta methodn- Numerical solution to an ordinary differential equation using the Predictor- corrector methodn- Numerical solution to an ordinary differential equation using the Picard’s methodn- Numerical solution to an ordinary differential equation using the Euler’s methodnnn## UNIT-IVnn- Numerical solution to the Laplace equation using the method of Finite Differences.n- Numerical solution to the Laplace equation using the ADI approach.n- Numerical solution to the one dimensional transient equation using the Finite Differences with forward, backward and central approximation.n- Solving an ODE using the Milne’s predictor-corrector method.","course outcomes":"At the end of the course student will be able to deal with various methods needed to solve the mathematical modeling of various systems.n…..………………….……………………………………………………………………….."}
