{"course code":"MEPC-24","course title":"Material Science","number of credits":"4","prerequisites":"","course type":"PC","branch":"me","course learning objectives":"- To understand and distinguish between the various mechanisms of plastic deformation and apply this knowledge to explain ductilityn- To explain the mechanism of work hardening and other strengthening processes and apply this knowledge for hardening the materialsn- To apply the concepts of failure analysis to identify the mode of failure (ductile/brittle fracture, fatigue or creep) and suggest design measures for the prevention of failuren- To find out the number of phases, their compositions and mass fractions using the phase diagrams of binary isomorphous, eutectic and iron-iron carbide systemsn- To explain and suggest heat treatment techniques to improve the mechanical properties of various types of steeln- To suggest the use of ceramics as engineering materials in accordance with the application","course content":"Plastic Deformationnnn## UNIT-InnTypes of defects in crystals- point, line and surface defects, deformation by slip, slip planes, twinning, mechanical and annealing twins, dislocation- edge and screw dislocation, critical resolved shear stress, dislocation loop, energy of dislocation, force on dislocation, stress field around dislocation, dislocation motion, perfect, extended and sessile dislocation, jogs, dislocation density, Frank Read source, dislocation pile-up, interaction between dislocation and vacancies.n(6 hrs)nnn## UNIT-IInnWork HardeningnWork hardening of single crystal and polycrystalline materials, mechanism of work hardening, work softening, Bauschinger’s effect, grain boundaries, its effect on crystal and on strength, grain size, low angle grain boundaries, polygonization, solid solution hardening, yield point phenomenon, strain aging, dispersion of second phase particles, preferred orientation, recovery and its mechanisms, recrystallization - mechanisms and laws, grain growth, hot working and cold working and their effects on mechanical properties. (6 hrs) Fracture and CreepnIntroduction, types fracture, theoretical cohesive strength of metals, Griffith's theory of brittle fracture and its modification, stages in development of ductile fracture, methods of fracture protection, creep test, creep curve, creep curvenequations, creep curve at constant temperature, stress- rupture test, effects of metallurgical variables on creep, creep mechanisms. (6 hrs)nnn## UNIT-IIInnFatigue of MetalsnIntroduction, factors to cause fatigue failure, stress cycles, S-N curve, fatigue test, theories of fatigue-Orowan theory, fatigue limit theory, Wood's theory and dislocation movement theory, effect of stress concentration on fatigue, size effects, corrosion fatigue, fretting, low temperature and high temperature fatigue.n(6 hrs)nPhase DiagramsnIntroduction, plotting of binary diagram, equilibrium cooling of an alloy, solid solutions, eutectic, eutectoid and peritectic systems, Iron-Iron carbide (Iron Carbon)equilibrium diagram- various phases present, various reactions involved, critical points, explanation of Iron Carbon diagram; phase rule. (4 hrs)nnn## UNIT-IVnnHeat TreatmentnTTT diagram, pearlite transformation and bainite transformation, continuous cooling and TTT diagram- transformation of austenite, factors affecting critical cooling rate, heat treatment processes- annealing, normalizing, spheroidizing, hardening and tempering, austempering, martempering, precipitation hardening, case hardening- carburising, nitriding, cyaniding, flame hardening, induction hardening. (6 hrs)nCeramics and Powder MetallurgynClassification of ceramic materials, ceramic and non- ceramic materials, mechanical and magnetic properties of ceramics, classification and properties of composite materials, whiskers and whisker composites, various methods of preparations of raw powders, blending, compacting, sintering, finishing operations-sizing, impregnation, infiltration, advantages and disadvantages, typical applications of powder metallurgy. (6 hrs)","course outcomes":"Upon completion of this course, student would be able ton- Understand and distinguish between the various mechanisms of plastic deformation and apply this knowledge to explain ductilityn- Explain the mechanism of work hardening and other strengthening processes and apply this knowledge for hardening the materialsn- Apply the concepts of failure analysis to identify the mode of failure (ductile/brittle fracture, fatigue or creep) and suggest design measures for the prevention of failuren- Find out the number of phases, their compositions and mass fractions using the phase diagrams of binary isomorphous, eutectic and iron-iron carbide systemsn- Explain and suggest heat treatment techniques to improve the mechanical properties of various types of steeln- Suggest the use of ceramics as engineering materials in accordance with the application","reference books":"- Material Science and Engineering - V. Raghavan, Prentice Halln- Materials Science and Engineering An Introduction - W.D. Callister, John Wileyn- Mechanical Behaviour of Materials - McClontock& Argon, Addison-Wesleyn- Mechanical Behaviour of Materials - Courtney, McGraw-Hilln- Mechanical Metallurgy-Dietern- Introduction to Elastic Wave Propagation' by A. Bedford & D. S. Drumhellern…..………………….……………………………………………………………………….."}
