{"course code":"MEPC-12","course title":"Fluid Mechanics","number of credits":"4","prerequisites":"Nil","course type":"PC","branch":"me","course learning objectives":"- To understand the various properties of fluid and instruments for measurement of pressuren- To study the behaviour of fluid at rest and in motionn- To study in detail viscous and turbulent flow and flow of fluid in pipen- To understand the concept of boundary layer, study of lift & drag andnstreamlined bodies","course content":"## UNIT- InnFluid StaticsnProperties of fluid, Fluid pressure, Pascal’s law, General equation of Fluid statics, Pressure head of a fluid, Absolute and gauge pressure, Measurement of pressure, Simple manometers, Differential manometers, Mechanical gauges, Force on submerged surfaces: Horizontal, Vertical, Inclined, Curved, Dams and gates. Buoyancy: Stability of submerged and floating bodies, Determination of metacentric height: analytical and experimental methods, Oscillation of floating body. (6hrs)nFluid KinematicsnLagrangian and Eulerian methods, flow lines, types of flow (Steady, unsteady, compressible, incompressible, ideal, real, uniform, non-uniform, Rotational and Irrotational, Laminar and turbulent, 1-D, 2-D and 3-D) Velocity and acceleration, Rate of flow, Continuity equation, Continuity equation in 3-D (differential and Polar), Stream function, Velocity potential function, Flow nets, Types of motion: linear translation, linear deformation, angular deformation and rotation. (6hrs)nnn## UNIT- IInnFluid DynamicsnEuler’s equation, Bernoulli’s equation, Energy equation, Practical applications of Bernoulli’s equation (Venturimeter, Orifice meter, Pitot tube), Kinetic energy and momentum correction factors, Momentum equation, Free liquid jet. (4hrs)nViscous FlownReynolds experiments, flow of viscous fluid in circular pipes, Hagen-Poiseuille equation, Flow through an annulus and two parallel plates, Power absorbed in bearings, Movement of piston in dash-pot, Viscometers; Capillary tube, falling spheres, rotating cylinder, Efflux. (4hrs)nnn## UNIT- IIInnTurbulent flownLoss of head in pipes, Shear stress in turbulent flow, Hydraulically smooth and rough boundaries, Velocity distribution in pipes, Velocity distribution in terms of average velocity, Power law, Friction coefficients of smooth and rough pipes.n(6hrs)nPipe flownMajor and Minor losses in pipes, Hydraulic gradient and total energy lines, Pipes in series, Pipes in parallel, Equivalent pipe, Siphon, Power transmission through pipes, Water hammer, Flow through nozzles. (4hrs)nnn## UNIT- IVnnBoundary layer theorynIntroduction, Description of a boundary layer on a thin flat plate, Boundary layer parameters (boundary layer, displacement, momentum, and energy thickness), Von-Karman integral momentum equation, Boundary layer separation, Methods to prevent boundary layer separation (6hrs)nImmersed bodiesnLift and drag, Lift and drag coefficients, Streamlined and bluffed bodies Drag on a cylinder (2D body), drag on a sphere Circulation and lift on a cylinder, Airfoil, Lift and drag on an airfoil (4hrs)","course outcomes":"At the end of the course student will be able to analyse the various flow problems using standard equations. They will understand the concept of boundary layer, design of streamlined bodies and various types of drags encountered by a body immersed in fluid.","reference books":"- Som and Biswas, Introduction to Fluid Mechanics and Machinery, Tata McGraw Hill, 3rd Edition, 2011.n- Robert W. Fox, Philip J. Pritchard, Alan T. McDonald, Introduction to Fluid Mechanics, Wiley India, 8th Edition, 2012n- Merle C. Potter, David C. Wiggert, Fluid Mechanics, Cenage Learning (India Edition), 2nd Edition, 2011.n- Frank M. White, Fluid Mechanics, McGraw-Hill Education; 7th Edition, 2010.n- D. S. Kumar, Fluid Mechanics and Fluid Power Engineering, S.K. Kataria & Sons, 8th Edition, 2013.n- P.N.Modi, S.M Seth, Hydraulics and Fluid Mechanics including Hydraulic Machines, Standard Book House, 19th Edition, 2009.n- S.S. Rattan, Fluid Mechanics and Hydraulic Machines, Khanna Book Publishing, 2014.n- P. Balachandran, Engineering Fluid Mechanics, Prentice Hall India, 2102.n- R. K. Bansal,Fluid Mechanics and Hydraulic Machines, Laxmi Publications, 9th Edition, 2017.n…..………………….……………………………………………………………………….."}
