{"course code":"MEPC-22","course title":"Mechanical Vibrations(Practical)","number of credits":"01","prerequisites":"Engineering Mechanics, Mechanical Vibrations, Tribology, Measurements","course type":"PC","branch":"me","course learning objectives":"The objectives of the course aren- To develop the understanding of basic concepts of Mechanical Vibrations and Tribology with the help of experiments.n- To find natural frequency of free and forced vibrations of undamped and damped Mechanical systems for understanding the theoretical concepts of Mechanical Vibrations.n- To find viscous damping from the response curve of damped free vibrations of a Mechanical System.n- To develop the understanding of Torsional Vibrations.n- To verify some of the methods of finding natural frequency of Mechanical Systems.","course content":"S:n- To study undamped free vibrations of equivalent spring mass system & determine the natural frequency of vibrations.n- To study the free vibrations of the system for different damper setting. Draw the decay curve and determine the log decrement and damping factor. Find also the natural frequency.n- To study the torsional vibrations of a single rotor shaft system and to determine the natural frequency.n- To determine the two frequencies of the torsional spring type double pendulum and compare them with theoretical values.n- To determine the radius of gyration of given bar by using Bifilar suspension.n- To verify the Dunkerley’s rule.n- To study the forced vibrations of the system with damping. Plot magnification factor vs. frequency and phase angle vs. frequency curves. Also, determine the damping factor.n- To study the pressure distribution of a journal bearing using a journal bearing apparatus.n- To determine the rate of wear of a metallic plate from the plot of displacement vs. time curve by using friction and wear monitor apparatus.n- To determine abrasion index of a material with the help of a dry abrasion test rig.n- To evaluate the load wear index and the weld point of a lubricant with the help of a four-ball extreme pressure tester.","course outcomes":"At the end of the course, the students will be able to:n- Perform Vibrations and Tribology tests on a Mechanical System.n- Find inertial properties of a component of machine or Machine itself by performing free vibrations tests.n- Determine the viscous damping present in a Mechanical system.n- Understand theoretical concepts of Mechanical Vibrations and Tribology.n- Analyze the response of the Vibrations Test to understand the theoretical results obtained from Mathematical Modelling of the Mechanical System under periodic input.n…..………………….……………………………………………………………………….."}
