{"course code":"MEPC-25","course title":"Internal Combustion Engines and Gas Turbines","number of credits":"4","prerequisites":"","course type":"PC","branch":"me","course learning objectives":"- To make students familiar with the design and operating characteristics of modern internal combustion engines.n- To apply analytical techniques to the engineering problems and performance analysis of internal combustion engines.n- To study combustion, heat transfer, friction and other factors affecting engine power, efficiency and emissions.n- To describe the effects of transient operations of vehicle on emissions and types of emissions.n- To make students familiar with the practical importance of contemporary engines.","course content":"Introductionnnn## UNIT-InnInternal & external combustion engines; classification, cycle of operation in four stroke and two stroke I.C. Engines and Valve timings .Wankel Engine. (3 hrs) Air Standard CyclesnAssumptions made in air standard cycles, Otto cycle, Diesel cycle, Dual cycle; comparison of these cycles; Sterling and Ericsson cycles; Air standard efficiency; specific work output, work ratio & mean effective pressure, Deviation of actual cycle from ideal cycle. (3 hrs)nnn## UNIT-IInnCombustion in I.C. EnginesnSI engines: Ignition Limits, stages of combustion, Effect of engine variables on Ignition Lag and flame-propagation, abnormal combustion, Detonation, Effect of Engine variables on detonation, Pre-ignition, Octane rating of fuels, SI engine combustion chambers. CI engine: stages of combustion, Delay period, variables affecting delay period, Diesel knock, Cetane rating, CI engine combustion chambers. (5 hrs)nCarburetion, Fuel Injection & Ignition systemsnMixture requirements for various operating conditions in SI engines: Elementary carburetor, Calculation of A/F ratio, The complete carburetor. Diesel injection systems: requirements, types, petrol, injection. Requirements of ignition systems, types of ignition systems, ignition timing, spark plug. (5 hrs)nnn## UNIT-IIInnLubrication and CoolingnTotal engine friction, Function of the lubrication systems, properties of lubricating oil, rating of oils, Lubrication systems, engine performance & lubrication. Necessity of engine cooling, Cooling systems, Water cooling, air cooling, Radiators. (5 hrs)nEngine Testing & PerformancenPerformance parameters, BHP, IHP, Mechanical efficiency, B M E P, I M E P, torque, volumetric efficiency B S F C And I S F C , thermal efficiency, Heat balance, Basic engine measurements: fuel and air consumption, brake power, indicated power and friction power, performance curves. (5 hrs)nnn## UNIT-IVnnAir Pollution and its ControlnSources and classification of air pollution, Effect on human health, pollutants from IC engines, methods of emission control, Alternative fuels, current scenario on the pollution front. (5 hrs)nAir compressorsnSingle stage reciprocating air compressors, work input, volumetric efficiency, isothermal efficiency, Advantages of multi stage compression, Two stage compressor with inter cooling, optimum pressure ratio. Rotary air compressors and their applications. (5 hrs)nGas TurbinesnBrayton cycle, components of a gas turbine plant, open and closed type, optimum pressure ratio, Improvements upon the basic cycle, multi stage compression with inter cooling, multi stage expansion with reheating, Regeneration, Applications of gas turbines. (4 hrs)","course outcomes":"- Students will be able to differentiate among different internal combustion engine designs.n- Students will be able to recognize and understand reasons for differences among operating characteristics of different engine types and designs.n- Students will be able to predict performance and fuel economy trends with given engine design specifications.n- Students will be able to to understand the effects of transient operations of vehicle on emissions and types of emissions.n- Students will be able to perform various tests on single cylinder and multi- cylinder SI and CI engines.","reference books":"- Internal Combustion Engines by Obert E.F.n- Internal Combustion Engines by Mathur& Sharma, DhanpatRai.n- Internal Combustion Engines by Gill, Smith &Zuriys, IBHn- Internal Combustion Engines by Ganesan V, TMHn…..………………….……………………………………………………………………….."}
