{"course code":"MEPC-18","course title":"Production Technology – I","number of credits":"4","prerequisites":"Manufacturing Processes, Engineering Practice","course type":"PC","branch":"me","course learning objectives":"- To understand milling machine tool and associated machining operationsn- To understand hole making operationsn- To understand grinding process and other super finishing processesn- To understand measurement of machined surface and associated aspectsn- To understand metal cutting and associated aspects","course content":"Millingnnn## UNIT- InnIntroduction, Milling machines types, milling cutters, milling operations, dividing head and indexing types, Up milling down milling, milling operations, special set- ups. (5hrs)nHole Making OperationsnIntroduction, Drilling, reaming, boring, tapping, other hole making operationsn(3hrs)nnn## UNIT- IInnMetal CuttingnBasic tool geometry, single point tool nomenclature, Chips- various type and their characteristics, mechanism of chip formation, Theoretical and experimental determination of shear angle. Orthogonal and oblique metal cutting. Metal cutting theories, relationship of velocities, forces and power consumption. (6hrs) Tool Life and WearnEffect of operating parameters like tool geometry, cutting speed, feed depth of cut, coolant, materials etc. on force, temp, tool life, surface finish etc. Tool life relationship, Taylor's equation of tool life. Tool materials, flank wear, crater wear, mechanism of tool wear. (6hrs)nnn## UNIT-IIInnThermal aspects of machining:nCutting temperature and factors affecting it, measurement, cutting fluids and its types, selection of cutting fluids. (3hrs)nAnalysis of Machining processesnMechanics of machining of turning, boring, shaping and planning, milling (Slab and face milling), drilling, machining time calculations of above operations. (4hrs) Economics of metal machiningnElements of machining cost, tooling economics, machining economics and optimization. (3hrs)nnn## UNIT- IVnnGrinding and super finishing processesnGrinding process, wheel characteristics, specifications, lapping, honing. (4 hrs)nMetrologynLinear and angular measurements, sine bar, auto-collimator, comparators: mechanical, electrical, optical and pneumatic, Surface finish and its measurement, Micro and macro deviations, factors influencing surface finish and evaluation of surface finish. Limits, fits & tolerances, gauge design. (7hrs)","course outcomes":"At the end of the course student will be able to known- milling machine tool and associated machining operationsn- various hole making operationsn- grinding, honing and lapping processesn- various direct and indirect methods of linear and angular measurement of machined components, types of fits as well as gauges and its designn- orthogonal metal cutting theory, tool wear and tool life, economics and analysis of conventional machining processes.","reference books":"- Manufacturing Science - Ghosh and Mallik, E.W. Pressn- Principles of Metal cutting - Sen and Bhattacharya, New central book.n- Metal Cutting Principles - Shaw, MIT Press, Cambridgen- Manufacturing Analysis- Cook, Addision-Wesleyn- Production Engineering Science- Pandey and Singhn- DeGarmo, E. P., Black, J.T., and Kohser, R.A., “Materials and Processes in Manufacturing”, Prentice-Hall of India.n- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.n- Groover, M.P., “Fundamentals of Modern Manufacturing”, John Wiley & Sons.n- Boothroyed, G. et al., Fundamentals of Metal Cutting and Machine Tools, McGraw Hill.n- Rao,P.N., “Manufacturing Technology”, (Vol. 2), Tata McGraw-Hilln- Ghosh, A. and Mallik, M., “Manufacturing Science”, E.W. Pressn- Lal, G.K., “Introduction to Machining Science”, New Age International Publishers.n- Production Engineering Science- Pandey and Singh.n…..………………….……………………………………………………………………….."}
