{"course code":"MEPC-15","course title":"Fluid Machines","number of credits":"4","prerequisites":"Fluid Mechanics","course type":"PC","branch":"me","course learning objectives":"- To learn and under/stand application of fluid mechanics to generate powern- To provide the student the necessary analytical skills to solve and analyze a variety of fluid power related problemsn- To use concepts of momentum principles in order to impart the knowledge of impact of jets, pumps and turbines","course content":"## UNIT- InnPrinciples of Hydraulic MachinesnImpact of jet on stationary and moving flat and curved plates, Force on series of vanes, Radial vanes, Jet propulsion of ships. (2hrs) Hydraulic TurbinesnIntroduction, development of hydraulic turbines, Components of hydro-power plant, Classification of turbines, Euler’s equation and degree of reaction, Losses and efficiency of turbines, Surge tank and its types. (5hrs) Impulse TurbinesnPelton turbine, its components and design, Energy conversion, Condition for maximum efficiency, Governing of impulse turbines. (3hrs)nnn## UNIT- IInnReaction TurbinesnFrancis turbine: components, working principles, draft tube, types of draft tube, design considerations, outward vs. inward flow reaction turbines, Evolution of axial flow turbines, Propeller and Kaplan turbines, Governing of reaction turbines.n(5hrs)nPerformance of Turbinesnnn## Unit quantities, specific speed, runway speed, characteristics of turbines, cavitation and its effects, cavitation parameters and Thoma’s cavitation factor, Detection and prevention of cavitation (5hrs)nnnn## UNIT- IIInnCentrifugal PumpsnIntroduction, classification & components of centrifugal pumps, Principle of working, Various heads, Energy conversion, Euler’s head and its variation with vane shapes, Effect of finite number of vanes, Losses and efficiencies, Minimum starting speed, Limitation of suction lift, Net Positive Suction Head (NPSH), Multistage pumps, Priming, Specific speed and performance. (5hrs) Reciprocating PumpsnWorking principles, Classification, Components, Discharge, Slip, Power input, Indicator diagram, Effect of accelerating head and pipe friction, Maximum speed, Air vessels, Comparison with centrifugal pumps. (5hrs)nnn## UNIT- IVnnOther Hydraulic PumpsnPropeller pump, Jet pump, Airlift pump, Gear pump, Screw pump, Vane pump, Radial piston pump, Submersible pump, pump problems. (3hrs) Hydraulic SystemsnHydraulic accumulators, Hydraulic intensifier, Hydraulic lift, Hydraulic crane, Hydraulic coupling, Torque convertor, Hydraulic ram. Hydraulic valves: check valve, relief valve, speed control valve, pressure compensating valve, direction control valve, Hydraulic filters and piping. (5hrs) Dimensional Analysis and Model Testingnnn## Units and dimensions, Dimensional analysis method: Rayleigh and Buckingham methods, Dimensionless numbers, Similitude laws, Model testing of turbine and pumps. (2hrs)","course outcomes":"- At the end of the course student will be able to understand the working and design of various types of hydraulic turbines and pumps.n- They would also understand the working of various types of hydraulic machines and systems.","reference books":"- Som and Biswas, Introduction to Fluid Mechanics and Machinery, Tata McGraw Hill, 3rd Edition, 2011.n- D. S. Kumar, Fluid Mechanics and Fluid Power Engineering, S.K. Kataria & Sons, 8th Edition, 2013.n- P.N.Modi, S.M Seth, Hydraulics and Fluid Mechanics including Hydraulic Machines, Standard Book House, 19th Edition, 2009.n- D. Rama Durgaiah, Fluid Mechanics and Machinery, New Age International Publishers, 2002.n- S.S. Rattan, Fluid Mechanics and Hydraulic Machines, Khanna Book Publishing, 2014.n- P. Balachandran, Engineering Fluid Mechanics, Prentice Hall India, 2102.n- R. K. Bansal, Fluid Mechanics and Hydraulic Machines, Laxmi Publications, 9th Edition, 2017.n…..………………….……………………………………………………………………….."}
