{"course code":"MEPC-23","course title":"Machine Design – II","number of credits":"4","prerequisites":"","course type":"PC","branch":"me","course learning objectives":"- To understand the design process of different types of gears, gear box, different types of belt drives, chain drive, rope drive and their applications in industry.n- To understand the utility and design process of different types of cluches, brakes and springs used in automotive industry.n- To understand the process of design for various types of bearings and crane hook.n- To understand the design process of I.C. engine components like cylinder, piston, crankshaft, connecting rod, valve gear mechanism and flywheels.","course content":"- Design of spur, helical, bevel and worm gears, gear box design including housing. (6 hrs)n- Design of flat and V - belt, chain drive, Wire ropes and Sheaves. (4 hrs)n- Design of single and multiple plate and cone clutches, centrifugal clutchn(4 hrs)n- Design of brakes, Energy absorbed by brake, Heat dissipation during braking, External and internal shoe type and disk type. (4 hrs)n- Design of Coil and leaf springs. (3 hrs)n- Design of various hydro-dynamically lubricated bearings. (4 hrs)n- Selection of rolling contact bearings. (3 hrs)n- Design of cam and follower mechanism. (3 hrs)n- Design of cylinder, piston, crankshaft, connecting rod and valve gear mechanism for I.C. Engine. (5 hrs)n- Design of Crane hook. (2 hrs)n- Design of flywheels. (2 hrs)nNote: Prepare the drawing sheets for above problems based on your calculated dimensions.","course outcomes":"At the end of the course student will be able ton- Understand the design process of different types of gears, gear box, different types of belt drives, chain drive, rope drive and their applications in industry.n- Understand the utility and design process of different types of cluches, brakes and springs used in automotive industry.n- Understand the process of design for various types of bearings and crane hook.n- Understand the design process of I.C. engine components like cylinder, piston, crankshaft, connecting rod, valve gear mechanism and flywheels.","reference books":"- Design of Machine Elements by Bhandari, Tata McGraw-Hilln- Machine Design by Maleev and Hartmann, CBS Public.n- Machine Design by Sharma and Aggarwal, Kaston Publc.n- PSG Design data book by PSG Publication, Coimbtoren- Machine Design – An Integrated Approach by Robert L. Norton, Prentice- Hall Inc.n- Fundamentals of Machine Component Design by R.C. Juvinall, John Wiley & Sonsn- Machine design data book by V.B.Bhandarin…..………………….……………………………………………………………………….."}
