{"course code":"MEPC-20","course title":"Machine Design-I","number of credits":"4","prerequisites":"-","course type":"PC","branch":"me","course learning objectives":"- To understand the engineering materials their properties, concept of endurance strength, the manufacturing and assembly considerations during design process.n- To understand the design process of riveted joint, welded joint, bolted joint, cotter joint, knuckle joint, keys and pipe joints.n- To understand the process of shaft design for different types of loadings, coupling design, their types and applications.n- To understand the design and applications of different types of levers, basic concepts and design of power screw.","course content":"## UNIT- InnEngineering Materials and Concepts of DesignnProperties: chemical, physical, mechanical and dimensional; Ferrous metals, Non- ferrous metals, Plastics, Composite materials etc, Selection of Engineering Materials. Design methodology, Classification of machine design and the general considerations, Design criterion based on fracture, deformation and elastic stability, design stresses, factor of safety. Significant stress and significant strength, stresses-concentration, causes and mitigation, Endurance limit, Effect of concentration, Notch sensitivity, Size and surface finish, Goodman diagram, Gerbers parabola and Soderberg line. (6 hrs)nManufacturing and Assembly ConsiderationsnSupports and retainment of rotating assemblies; manufacturing considerations in design, design of castings and weldments. (4 hrs)nnn## UNIT- IInnDesign of jointsnRiveted joints for boiler shell according to I.B.R., riveted structural joint, and riveted joint with eccentric loading. Types of welded joints, strength of welds under axial load, Welds under eccentric loading, designation of various types of bolts and nuts, Design of bolted joints, Bolts of uniform strength, Bolted joints with eccentric loads. (7 hrs)nDesign of Keys, Cotter joint and knuckle joints. (3 hrs)nnn## UNIT - IIInnDesign of ShaftnDesign of shafts subjected to pure torsion, pure bending load, Combined bending & torsion, combined torsion, bending and axial loads, Design of shaft on the basis of rigidity. (5 hrs)nDesign of CouplingsnTypes of shaft couplings, Design of sleeve or muff coupling, flange coupling and bush type flexible couplings. (5 hrs)nnn## UNIT - IVnnDesign of LeversnIntroduction, hand and foot levers, cranked levers, lever for a lever safety valve, Bell crank lever, miscellaneous levers. (3 hrs) Pipe jointsnIntroduction, Types of pipe joints, Design of circular, oval shaped and square flanged pipe joints. (4 hrs)nPower screwnFunction, types of power screws, stresses in screws, Self locking screw, Design of Screw jack, Differential and Compound Screws. (3 hrs)","course outcomes":"At the end of the course student will be able ton- Understand the engineering materials their properties, concept of endurance strength, the manufacturing and assembly considerations during design process.n- Understand the design process of riveted joint, welded joint, bolted joint, cotter joint, knuckle joint, keys and pipe joints.n- Understand the process of shaft design for different types of loadings, coupling design, their types and applications.n- Understand the design and applications of different types of levers, basic concepts and design of power screw.","reference books":"- Design of Machine Elements - Bhandari, Tata McGraw-Hilln- Machine Design- Maleev and Hartmann, CBS Public.n- Machine Design - Sharma and Aggarwal, Kaston Publc.n- PSG Design data book - PSG Publication, Coimbtoren- Machine Design – An Integrated Approach - Robert L. Norton, Prentice-Hall Inc.n- Fundamentals of Machine Component Design - R.C. Juvinall, John Wiley & Sonsn…..………………….……………………………………………………………………….."}
