{"course code":"MEPC-13","course title":"Kinematics of Machines","number of credits":"4","prerequisites":"Applied Mechanics","course type":"PC","branch":"me","course learning objectives":"- To understand the basic concepts of machines & various parts involved in machinesn- To understand the basic concepts of kinematics of machines for different applicationsn- To analyze the motions of various mechanismsn- To understand the basic concepts of design mechanisms to have given motions","course content":"## UNIT - InnMechanism and machinesnKinematics, introduction to analysis and synthesis of mechanisms, Classification of mechanisms – Basic kinematic concepts and definitions, Mechanism & Machines. rigid and resistance body, link, Kinematic pair, Types of motion, degrees of freedom, classification of Kinematic pairs, Kinematic Chain, Linkage, Mechanics, Gruebler‟s criterion ,Four bar chain and Slider crank chain, Kinematic inversions of four-bar chain and single and double slider crank chains. (5hrs) Velocity AnalysisnVelocity analysis using Relative velocity method and Instantaneous centre method, Kennedy’s theorem, Space cent rode and body cent rode. (3 hrs) Acceleration AnalysisnCentripetal and tangential accelerations, Acceleration determination by graphical method using velocity polygons, Corioli’s component of acceleration, Klein’s construction method to find acceleration of four bar mechanism and slider crank chain mechanism. (4 hrs)nnn## UNIT-IInnComputer-aided analysis and synthesis of mechanismnComputer-aided analysis of four-link mechanism and slider crank mechanism, Synthesis of mechanism by graphical method (function generation by Relative pole method and inversion method, Path generation and motion generation), Computer -aided Synthesis of Mechanism- Freudenstein’s equation (4 hrs) Lower pairsnPantograph, straight-line motion mechanisms (Paucellier, Hart, Scott Russel, Grasshopper, Watt, Tchebicheff’s Parallel linkages) Indicator mechanisms (Simplex, Crosby, Thomson, etc) Automobile steering gears (Davis and Ackermann), Hooke’s joint (universal coupling), Double Hooke’s joints. (6 hrs)nnn## UNIT-IIInnFrictionnTypes of friction, Laws of dry friction, Motion along inclined plane, Screw threads, Screw jack, Wedge, Pivots and collars, Plate and cone clutches, Antifriction bearings, friction circle and friction axis. (6 hrs) CamsnTypes of cams and followers, various motions of the follower, Construction of cam profiles, Analysis for velocities and accelerations of tangent and circular arc cams with roller and flat-faced followers. (6 hrs) UNIT-IVnBelts, Ropes and ChainsnOpen and crossed belt drives, velocity ratio, slip, material for belts, crowning of pulleys, law of belting, types of pulleys, length of belt, ratio of belt tensions, centrifugal tension, power transmitted by belts and ropes, initial tension, creep, chain drive, chain length, classification of chains. (6 hrs)","course outcomes":"Understanding of common mechanisms used in machinesn- able to perform velocity and acceleration analysis of mechanismsn- able to do CAD based synthesis of mechanismsn- Construction of cam profiles and analysis of their velocity and accelerationn- Knowledge of power transmission devices such as belts , ropes and chainsn- Knowledge of straight line mechanisms and universal coupling","reference books":"- Theory of Machines - S.S.Rattan, Tata McGraw Hilln- Theory of Mechanism and Machines - Jagdish Lal, Metropolitan Book Co.n- Theory of Machines by Sadhu Singh, Pearson Publishern- Theory of Machines - .L. Ballaney, Khanna Publishern..………………….………………………………………………………………………….."}
