{"course code":"MEPC- 21","course title":"Dynamics of Machines","number of credits":"4","prerequisites":"Applied Mechanics, Kinematics of Machines","course type":"PC","branch":"me","course learning objectives":"- To equip the student with fundamental knowledge of dynamics of machines so that student can perform static and dynamic force analysisn- To develop knowledge of analytical and graphical methods for calculating balancing of rotary and reciprocating masses.n- Develop understanding of flywheel analysis, gyroscopic forces and governorsn- To familiarize with the type of gears, gear trains and brakes","course content":"Static Forces in Mechanismsnnn## UNIT-1nnIntroduction, Static force analysis, Static equilibrium, Equilibrium of members, Force convention, free body diagram, Principle of superposition, static force analysis of Four bar mechanisms ,Static forces analysis of Slider-Crank mechanism, Static force analysis of Quick Return Mechanism. (4hrs) Dynamic Forces in MechanismsnD’ Alembert’s principle, Equivalent offset inertia force, Dynamic force analysis of four-bar mechanism, Dynamics of reciprocating parts, Piston effort, Crank effort, Equivalent dynamical systems, and Inertia force in reciprocating engines by graphical and analytical method. (6hrs)nnn## UNIT-IInnGearsnTypes of gears, gear terminology, condition for correct gearing, cycloidal and involutes profiles of gear teeth, pressure angle, path of contact, arc of contact, interference, undercutting, minimum number of teeth, number of pairs of teeth in contact, Helical gear and spiral gear, Expression for centre distance between two shafts connected by spiral gear or helical gear, Efficiency of spiral and helical gear, Efficiency of worm and worm gear. (5hrs) Gear TrainsnTrain value, Limitations in design of gear trains, Types of gear trains- simple, compound, reverted, and epicyclic gear train, Solution of gear trains, sun and planet gear, bevel epicyclic gear, compound epicyclicgear, pre- selective gear box, differential of automobile, torque in gear trains. (4hrs)nnn## UNIT-IIInnGovernorsnTypes of governors: Watt, Porter, Proell, spring loaded centrifugal governors- Hartnell and Wilson Hartnell, Sensitiveness, Stability, Isochronism’s-- Hartnell and Wilson Hartnell, Hunting, Effort and power of governor, controlling force. (4 hrs) FlywheelsnTurning moment (crank effort) diagrams for single cylinder and multi-cylinder engines, coefficient of fluctuation of energy, coefficient of fluctuation of speed, flywheel and its function. (4hrs)nBrakes and DynamometersnTypes of brakes, Block or shoe break, band brakes, band and block brakes, internal expanding shoe brake, dynamometers: absorption, transmission, and tensional. (4 hrs)nnn## UNIT-IVnnBalancingnBalancing and its classification, Need of balancing, Balancing of rotating weights, Balancing of reciprocating parts, balancing of I.C. engines, balancing of multi- cylinder engine: V-engines and radial engines, balancing of machines. (5hrs) GyroscopenGyroscope, Gyroscopic couple and its effect on aircraft, naval ships during steering, pitching and rolling, Stability of an automobile (2-wheelers & 4-wheelers).n(4hrs)","course outcomes":"- Students should be able to perform static and dynamic analysis of machinesn- Students should be able to perform balancing of rotating and reciprocating parts of machinesn- Students should be able to describe the working of different types of brakes, dynamometers and governorsn- Students should know different types of gears, gear terminology and understand important gear trains and their practical applications.n- Student should be able to construct turning moment diagram and have the Knowledge of flywheels and Gyroscopic Motion","reference books":"- Theory of Machines - S.S.Rattan, Tata McGraw Hilln- Theory of Mechanism and Machines - Jagdish Lal, Metropolitan Book Co.n- Theory of Machines by Sadhu Singh, Pearson Publishern- Theory of Machines- .L. Ballaney, Khanna Publishern- Dynamics of Machinery by S. Balaguru, Scitech Publicationsn…..………………….……………………………………………………………………….."}
