{"course code":"MEPC-19","course title":"Strength of Materials-II","number of credits":"4","prerequisites":"-","course type":"PC","branch":"me","course learning objectives":"- To learn about fixed and continuous beams and methods to find fixing moments and end reactions.n- To study the theory to find the stresses in curved bars (Winkler-Bach theory).n- To study torsion of shafts and to know the stresses and deflections of various types of springs.n- To learn about various types of stresses in thin and thick cylindersn- To study Euler theory and other formulae to find the stresses in long columns and struts.n- To learn about stresses developed in rotating cylinders","course content":"## UNIT- InnFixed and Continuous BeamsnFixed beams, continuous beams and overhanging beams, moment-area method, Macaulay’s method,Clapeyrons’s three moment equation, moment distribution method, slope and deflection of propped (elastic and rigid) cantilevers and beams subjected to point loads and/or uniformly distributed loads. (5Hrs)nBending of Curved BarsnStresses in bars of small initial curvature, Stresses in bars of large initial curvature, Winkler-Bach theory, stresses in crane hooks, circular hooks, circular rings, simple chain links, deflection of curved bars, crane hooks, rings, and simple chains. (5 Hrs)nnn## UNIT- IInnTorsionnCircular shafts, power transmission, Shear stresses in hollow and solid shafts, shafts in series and parallel, Stepped and composite shafts, shafts subjected to combined bending and twisting loads, equivalent twisting and bending moments, strain energy in torsion, Bredt-Batho theory, thin-walled sections, thin rectangular members. (5 Hrs)nSpringsnClosed-coiled helical springs subjected to axial loads and couples, springs in series and parallel, concentric springs, stresses and deflections in open-coiled helical springs subjected to axial loads, and/or twisting couples, stresses and deflections in leaf springs, flat spiral springs. (5 Hrs)nnn## UNIT- IIInnThin Cylinders and SpheresnThin cylinders subjected to internal pressure, Circumferential and longitudinal stresses and strains, Maximum shear stress, thin spherical shells subjected to internal pressure, wire winding of thin cylinders. (5 Hrs) Thick CylindersnLame’s theory, thick cylinders subjected to internal and external pressures, compound cylinders, stresses and strains in thick spherical vessels subjected to internal and external pressures. (5 Hrs)nnn## UNIT- IVnnColumns and StrutsnColumns under axial load, concept of instability and buckling, slenderness ratio, various end conditions, Euler's theory for initially straight columns, assumptions and limitations, empirical formulae, stresses and deflections in eccentrically loaded straight long columns, secant formula, stresses and deflections in struts with initial curvature and in straight long columns with transverse loads for different end conditions. (6Hrs)nRotating Discs and CylindersnStresses and strains in rotating rims or rings of uniform thickness, stresses and strains in rotating thin solid and hollow discs of uniform thickness, stresses and strains in rotating thin disc of uniform strength, stresses and strains in rotating solid and hollow cylinders. (4Hrs)","course outcomes":"After studying this course, students should be able ton- Draw bending moment and shear force diagrams in fixed end continuous beams using various methods.n- Determine stresses and deflections in curved barsn- Find the stresses in shafts under torsion and stresses and deflection of springs.n- Differentiate thick and thin cylinders and to determine stresses in them.n- Find stresses in rotating discs and cylinders.n- Deduce expressions for crippling load for columns with various types of end conditions.","reference books":"1. G H Ryder, “Strength of Materials”, ELBS, 3rd edition, 1969n2 S S Rattan, “Strength of Materials”, Tata McGraw Hill, India, 3rd Edition, 2017n- Beer P F and Johnston (Jr) E R, “Mechanics of Materials”, McGraw Hill Education, 7th edition, 2015.n- Sadhu Singh “Strength of Materials”, Khanna Publishers, 3rd edition, 2001..n- Popov E P, “Engineering Mechanics of Solids”,Prentice Hall of India, New Delh, 2nd edition, 1999.n- R Subramaniam, “Strength of Materials”,Oxford University Press,2nd Edition, 2010."}
