{"course code":"MEPC-14","course title":"Heat Transfer","number of credits":"04","prerequisites":"","course type":"PC","branch":"me","course learning objectives":"- To introduce the principal concepts and different modes of Heat Transfern- To analyze the different systems through the use of these conduction, convection and radiationn- To understand the basic concepts of design of heat exchanger","course content":"Introductionnnn## UNIT-InnDefinition of heat; Modes of Heat Transfer; Basic Laws of heat transfer; Electrical Analogy of heat conduction; Conduction through composite walls; Overall heat transfer coefficient (5hrs)nConductionnThe General heat Conduction equation in Cartesian, cylindrical and spherical coordinates; steady one dimensional heat conduction without internal heat generation: the plane slab; the cylindrical shell; the spherical shell; Critical thickness of insulation.nVariable thermal conductivity, Steady one dimensional heat conduction with uniform internal heat generation: the plane slab; cylindrical and spherical systems. Fins of uniform cross-section: Governing equation; Temperature distribution and heat dissipation rate; Efficiency and effectiveness of fins.nTransient conduction: Lumped capacitance model, One-dimensional transient problems and analytical solutions. One dimensional Heisler charts (12hrs)nnn## UNIT-IInnConvectionnIntroduction to free and forced convection; Newton’s law of cooling; convective heat transfer Coefficient; Nusselt number; Dimensional analysis of free and forced convection.nInternal Forced convection: Laminar flow heat transfer in circular pipe – constant heat flux and constant wall temperature, thermal entrance region, Turbuent flow heat transfer in circular pipe, pipes of other cross sectionsnExternal Flow: Concept of boundary layer; hydrodynamic and thermal boundary layer; Momentum and Energy equations for boundary layer. Exact solution for laminar flow over an isothermal plate using similarity transformation. The integral approach; integral momentum and energy equations; solution of forced convection over a flat plate using the integral method.nNatural Convection: Analysis of free convection; governing equations for velocity and temperature fields.nRelation between fluid friction and heat transfer, Reynolds analogy. Dimensionless numbers: Reynolds, Prandtl, Nusselt, Grashoff and StantonnNumbers and their significance, Heat transfer with change of phase; Nusselt theory of laminar film Condensation. (13hrs)nnn## UNIT-IIInnHeat ExchangersnIntroduction; classification of heat exchangers; Logarithmic mean temperature Difference; Area calculation for parallel and counter flow heat exchangers; Effectiveness of heat exchangers; NTU method of heat exchanger design. Applications of heat exchangers. (5hrs)nnn## UNIT-IVnnRadiationnTheories of thermal radiation; Absorption, reflection and transmission; Monochromatic and total emissive power; Black body concept; Planck’s distribution law; Stefan Boltzman law; Wien’s displacement law; Lambert’s cosine law; Kirchoff’s law; Shape factor; Heat Transfer between black surfaces. (5hrs)","course outcomes":"- The students will be able to understand about the different modes of heat transfer.n- The students will be able to apply related heat transfer lawsn- The students will be able to calculate the heat flow rate in different engineering applications and its implications on temperature.n- The students will be able to design Fins and heat exchangers for industrial applications","reference books":"- Heat Transfer: A Practical Approach: Cengel, Y. A., McGraw Hilln- Fundamentals of Heat and Mass Transfer: Incropera and Dewitt, John Wileyn- Heat Transfer: Holman, J.P., Eighth Edition, McGraw Hilln- A Text Book on Heat transfer: S.P. Sukhatme, University Pressn- Heat & Mass Transfer. D.S. Kumar, S.K. Katariyan..………………….………………………………………………………………………….."}
