{"course code":"MEPC-11","course title":"Manufacturing Processes","number of credits":"03","prerequisites":"NIL","course type":"PC","branch":"me","course learning objectives":"- To impart fundamental knowledge of engineering materialsn- To impart basic knowledge of various processes such as casting, forming, machining, & welding etc. for manufacturing a product.n- To prepare the students to understand the advance concepts and processes based on these basic manufacturing processes.","course content":"-nnn## UNIT InnIntroduction to manufacturing, classification of manufacturing, fundamental properties of materials including metals and alloys, polymers, ceramics and composites, plastic processing techniques: compression moulding and injection moulding. (6 hrs)nnn## UNIT IInnCastingnPattern materials, types of allowances, type of patterns, type of mould, desirable properties of moulding materials, core, core print, type of cores, CO2 casting, expandable and permanent mould casting, sand casting, shell casting, plaster casting, investment casting, die casting, centrifugal castings, casting defects & remedies advantages, disadvantages and application of casting.nMachiningnDefinition, classification, Lathe: parts and accessories, specifications, various operations on lathe. (14 hrs)nnn## UNIT IIInnFormingnDeformation of metals, elastic and plastic deformation, metal working processes: cold and hot working, forging, rolling, extrusion, wire and tube drawing.nSheet metal operationsnIntroduction to shearing, blanking and punching, notching, trimming, lancing, nibbling, bending, stretching, embossing and coining. (10 hrs)nnn## UNIT IVnnDefinition and classification, thermit welding, electric arc welding: MMAW, SAW, TIG, MIG, gas welding, resistance welding, brazing and soldering, welding defects and remedies. (10 hrs)","course outcomes":"At the end of the course student will be able ton- Decide and recommend cost effective and reliable engineering materials for the development of an existing and innovative product.n- Decide and recommend appropriate manufacturing processes for a product under given conditions and constraints.n- Develop their communication skills in oral, written and visual modes.n- Function effectively in teams and within a diverse environment.","reference books":"- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.n- M P Groover, Principles of Modern Manufacturing, Wiley.n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.n- Amitabha Ghosh & A K Mallik, Manufacturing Science, Affiliated East-West Press Pvt. Ltd.n…..………………….……………………………………………………………………….."}
