{"course code":"MEPC-10","course title":"Thermodynamics","number of credits":"4","prerequisites":"None","course type":"PC","branch":"me","course learning objectives":"- To be able to use the First Law of Thermodynamics to estimate thermo- mechanical energy conversionn- To be able to use the property tables and diagrams to calculate properties of substancesn- To be able to understand and apply the Second Law of thermodynamics and the concept of entropy to various systemsn- To be able to use the general Thermodynamics relations to various systems","course content":"S:nConcepts of Thermodynamicsnnn## UNIT InnDefinition, Classical and statistical thermodynamics, Macroscopic and microscopic approaches, thermodynamic system, state, boundary, surroundings and universe, thermodynamic properties, thermodynamic equilibrium, Quasi-static process, zeroth law of thermodynamics, work and heat transfer. (4hrs)nThe First Law of ThermodynamicsnFirst law for a closed system; Application of the First Law to non-flow processes viz constant volume, constant pressure, constant internal energy processes; Reversible adiabatic and reversible polytropic processes; Steady Flow Energy Equation and its application to water, steam and gas turbines, pumps, compressors boilers, condensers, nozzles etc; Transient flow processes; PMM-I, Enthalpy. (6hrs)nnn## UNIT IInnProperties of FluidsnProperties of liquids and vapours; P-V, P-T, T-S and H-S diagrams for a pure substance (water), Tables of properties, Expansion of steam, hyperbolic , Isentropic and throttling processes; determination of dryness fraction, Properties of a perfect gas; Equation of state; Property relation for internal energy, enthalpy & heat capacities of an ideal gas, P-V-T surface, Triple point , Real gases, properties of real gases, Vander Waals equation , Reduced equation of state, Generalized compressibility charts, Virial equation. Properties of ideal gas mixtures (12hrs)nnn## UNIT IIInnThe Second Law of ThermodynamicsnLimitations of the First Law, Heat source & sink, Heat engine, Refrigerator & Heat Pump, The Second Law, Kelvin Planck and Clausius statements; Reversible & Irreversible processes; the Carnot theorem, Absolute temperature scale, Inequality of Clausius, characteristics of Entropy,nEntropy change for open &closed systems, Third Law of Thermodynamics, Validity & limitations of the Laws of Thermodynamics. (10hrs)nnn## UNIT IVnnGeneral Thermodynamic RelationsnMaxwell Relations, specific heat relations, energy equations; relations between internal energy and entropy, Joule Thomson Coefficient, Clausius Clapeyron’s equation, Application of thermodynamic relations. Availability and the Gibbs function, Availability of a closed system, Availability of steady flow system, The Gibbs function and the steady flow system. (8hrs)","course outcomes":"At the end of the course student will be able ton- understand the basic concepts of thermodynamics such as heat, work, state etc.n- identify the properties of substances on property diagrams and obtain the data from property tables.n- apply First Law of Thermodynamics to open and closed systemsn- apply the Second Law of Thermodynamics and the concept of entropy to analyse the thermal efficiencies of heat engines.","reference books":"- Rogers, GFC & Mayhew, Y.R, Engg. Thermodynamics, ELBSn- Nag, P.K., Engg. Thermodynamics, TMHn- Achuthan, M., Engg. Thermodynamics,TMH.n- Cengel and Boles,Thermodynamics: An Engineering Approach, McGraw Hill, 8th edition, 2015.n…..………………….……………………………………………………………………….."}
