{"course code":"MEPC-29","course title":"Measurement and Instrumentation","number of credits":"4.0","prerequisites":"","course type":"PC","branch":"me","course learning objectives":"- To impart the knowledge to the students about significance, applications and types of measurement, identification of functional elements of a measuring system.n- To study the instrument characteristics, classification, sources and statistical analysis of errors.n- To learn the statistical analysis of experimental data.n- To make students understand the construction, working principle and application of various types of transducers.n- To study the use of strain gauges for load, force, torque and thrust measurement.","course content":"## UNIT-InnIntroductionnDefinition, application of measurement instrumentation, functional elements of a generalized measuring system, measuring standards, types of measurement, types of input to measuring instruments and instrument system, classification of measuring instruments, merits and demerits of mechanical measuring systems, comparison of mechanical measuring system with electrical measuring systems, calibration. (6 hrs)nGeneralized performance characteristics of instrumentsnIntroduction, types of error, types of uncertainties, propagation of uncertainties in compound quantity, Static performance parameters: accuracy, precision, resolution, static sensitivity, linearity, hysteresis, dead band, backlash, and drift., sources of error, selection of a measuring instruments, mechanical and electrical loading, fundamentals of dynamic characteristics, generalized mathematical model of measuring systems, types of input, dynamic performance parameters: dynamic error, speed of response, etc, dynamic response of a first order mechanical systems with different inputs e.g. step, ramp, sinusoidal and impulse input. (12 hrs)nnn## UNIT-IInnStatistical analysis of experimental datanIntroduction, types of measuring data, statistical attributes, various method of presentation, estimation of presentation and uncertainties, confidence level, precision and statistical treatments of single and multi-sample type experimental data, Chauvenet’s criteria of rejecting a dubious data, curve fitting, best linear calibration and its precision, significant figures and rounding off. Overallnuncertainty estimation of measuring systems, common sense approach, and engineering applications. (8 hrs)nTransducersnIntroduction, primary function, classification, electrostatic transducers: principle theory, types, advantages, and limitations, Fixed contact mechano-resistive transducers: classification, and uses, Metallic resistance strain gauge: types, construction theory of operation, Adhesive: property, selection criteria, mounting of strain gauges, Mathematical analysis of ballast and DC Wheatstone bridge circuits, characteristic and comparison of ballast and DC Wheatstone bridge circuits, temperature effects and their compensation. (8 hrs)nnn## UNIT-IIInnMeasuring of non-electrical physical quantitiesnMeasurement of load, force, and thrust using resistant strain gauges, Elastic load cells, proving rings, fluid pressure measurement in pipe and containers, using strain gauges, Measuring of torque in transmission shaft under axial and bending loads in varying ambient conditions. (6 hrs)","course outcomes":"- The students will be able to identify and explain the various functional components of a measurement system.n- The students will be able to evaluate the static and dynamic characteristics of the measurement devices.n- The students will be able to analyze the measurement data to calculate the various types of errors involved.n- The students will be able to explain working principles of sensors and transducers.n- The students will be able to measure the strain for load, force, torque and thrust measurement using various Wheatstone- Bridge circuits.","reference books":"- Mechanical measurements & controlby D.S. Kumar, Metropolitan bookn- Instrumentation and Mechanical measurements by A.K. Tayal, Galgotia Publ.n- Measurements systems application and design by E. Doebelin, McGraw-Hilln…..………………….……………………………………………………………………….."}
