{"course code":"MEPE- 28","course title":"Product Design & Development","number of credits":"3","prerequisites":"Productivity Management, Manufacturing Fundamentals & Techniques","course type":"PE","branch":"me","course learning objectives":"The focus of Product Design and Development is integration of the marketing, design, and manufacturing functions of the firm in creating a new product. The course is intended to provide the following benefits:n- Competence with a set of tools and methods for product design and development.n- Develop abilities to create a new product.n- Awareness of the role of multiple functions in creating a new product (e.g. marketing, finance, industrial design, engineering, production).n- Ability to coordinate multiple, interdisciplinary tasks in order to achieve a common objective.n- Reinforcement of specific knowledge from other courses through practice and reflection in an action-oriented setting.n- Enhanced team working skills.","course content":"## UNIT-InnIntroduction: Design theory, design materials, human factors in design, man- machine system, applied ergonomics, characteristics of successful product development, challenges to product development. (6 hrs)nnn## UNIT-IInnDevelopment process and product planning: Generic development process, Concept development, product development process flows, product planning process, identify customer needs. (6 hrs)nnn## UNIT-IIInnProduct specifications and concept generation: Product specification, steps to establish the target specifications, Concept generation, five step concept generation method, concept selection, concept screening, concept testing, product architecture. (10 hrs)nnn## UNIT-IVnnProduct design methods: Creative and rational, clarifying objectives - the objective tree method, establishing functions- the function analysis method, setting requirements – the performance specification method, determining characteristicsn– the QFD method, generating alternatives – morphological chart method, evaluating alternatives – the weighted objective method, improving details – the value engineering method and design strategies. (6 hrs)nnn## UNIT-VnnDesign for manufacture: Estimating manufacturing cost, reducing component, assembly and support costs, design for assembly, design for disassembly, designnfor environment, design for graphics and packaging, effective prototyping – principle and planning (4hrs)nnn## UNIT-VInnIndustrial design: Its need, impact and quality, industrial design process and its management, legal issues in product design, design resources, economics and management of product development projects. (4 hrs)nnn## UNIT-VIInnErgonomics / Aesthetics: Gross human autonomy. Man-Machine interaction. Concepts of size and texture, colour .Comfort criteria. Psychological & Physiological considerations. Creativity Techniques: Creative thinking, conceptualization, brain storming, primary design, drawing, simulation, detail design. (6 hrs)","course outcomes":"- At the end of the course student will be able to:n- Describe an engineering design and development processn- Demonstrate individual skill using selected manufacturing techniquesn- Employ engineering, scientific, and mathematical principles to execute a design from concept to finished productn- Work collaboratively on a team to successfully complete a design projectn- Effectively communicate the results of projects and other assignments in a written and oral format","reference books":"- K.T. Ulrich and S.D. Eppinger, “Product design and development”, Tata McGraw Hilln- Chitale& Gupta, “Product Development”, Tata McGraw Hilln- Monks, J. G., “Operations Management”, McGraw Hill, 1997.n- George Dietor, A material and Processing approach, McGraw Hilln…..………………….………………………………………………………………………..nB.Tech (Mechanical Engineering) 8th SemesternB.Tech(Mechanical Engineering) 8th Semester Programme Electives (PE)"}
