{"course code":"MEPE-12","course title":"Mechatronics","number of credits":"3","prerequisites":"Nil","course type":"PE","branch":"me","course learning objectives":"- To understand the basic concepts of mechatronics, digital technology and their applications.n- To understand the functioning of various types of sensors, transducers and their applications.n- To understand the concept of pneumatic, hydraulic and mechanical actuation systems.n- To perceive the functioning of microprocessors, Programmable logic controllers, their architecture, structure and applications.n- To understand the basics of robotics, robot types, their drive systems and applications.","course content":"## UNIT-InnIntroduction to Mechatronics and its SystemsnEvolution, Scope, Measurement Systems, Control Systems, open and close loop systems, sequential controllers, microprocessor based controllers, mechatronics approach. (5 hrs)nBasics of Digital TechnologynNumber System, Boolean algebra, Logic Functions, Karnaugh Maps, Timing Diagrams, Flip-Flops, Applications. (5 hrs) UNIT-IInSensors and transducersnIntroduction, performance terminology-Displacement, Position and Proximity, Velocity and motion, force, Fluid Pressure-Temperature Sensors-Light Sensors- Selection of Sensors-Signal Processing. (6 hrs) Pneumatic and Hydraulic actuation systemsnActuation systems, Pneumatic and hydraulic systems, directional control valves, pressure control valves, cylinders, process control valves, rotary actuators. (5 hrs)nnn## UNIT-IIInnMechanical actuation systemsnMechanical systems, types of motion, kinematics chains, cams, gear trains, ratchet and pawl, belt and chain drives, bearings, mechanical aspects of motor selection. (5 hrs)nMicroprocessornIntroduction, Architecture, Pin Configuration, Instruction set, Programming of Microprocessors using 8085 instructions-Interfacing input and output devices- Interfacing D/A converters and A/D converters, Applications, Temperature control, Stepper motor control, Traffic light controller. (6 hrs)nnn## UNIT-IVnnProgrammable Logic ControllernIntroduction, Basic structure, Input/output Processing, Programming, Mnemonics, Timers, Internal relays and counters, Data handling, Analog Input/output, Selection of a PLC. (4 hrs)nRoboticsnIntroduction, types of robots, Robotic control, Robot drive systems Robot end effectors, selection parameters of a robot, applications. (4 hrs)","course outcomes":"At the end of the course student will be able ton- Understand the basic concepts of mechatronics, digital technology and their applications.n- Understand the functioning of various types of sensors, transducers and their applications.n- Understand the concept of pneumatic, hydraulic and mechanical actuation systems.n- Perceive the functioning of microprocessors, Programmable logic controllers, their architecture, structure and applications.n- Understand the basics of robotics, robot types, their drive systems and applications.","reference books":"- Bolton W., “Mechatronics”, Longman, Second Edition, 2004.n- Histand Michael B. and Alciatore David G., “Introduction to Mechatronics and Measurement Systems”, McGraw Hill International Editions, 2003.n- Kamm, M.L.J., Mechatronics, Prentice Hall of India, New Delhi (2007).n- HMT Ltd., “Mechatronics”, Tata McGraw Hill Publishing Co. Ltd., 1998.n- NitaigourPremchandMahalik, “Mechatronics Principles, Concepts and Applications”, Tata McGraw-Hill publishing company Ltd, 2003.n- Auslander, D. M. and Kempf, C. J., Mechatronics: Mechanical System Interfacing, Prentice Hall, New Jersy (1996).n…..………………….……………………………………………………………………….."}
