{"course code":"MEPE-37","course title":"Design of Heat Exchangers","number of credits":"3.0","prerequisites":"","course type":"PE/OE","branch":"me","course learning objectives":"- To understand the different configurations of heat exchangers.n- To solve different rating and sizing problems of heat exchangers.n- To be able to design heat exchangers that are used in numerous heat transfer applications.n- To develop ways of heat transfer enhancement in heat exchangers.","course content":"## UNIT-InnClassification and basic design methodologies for heat exchanger Classification of heat exchanger, selection of heat exchanger, overall heat transfer coefficient, LMTD method for heat exchanger analysis for parallel, counter, multi- pass and cross flow heat exchanger, effectiveness-NTU method for heat exchanger analysis, fouling, cleanliness factor, techniques to control fouling, additives, rating and sizing problems, heat exchanger design methodology.(8 hrs)nnn## UNIT-IInnDesign of double pipe heat exchangersnThermal and hydraulic design of inner tube and annulus, hairpin heat exchanger with bare and finned inner tube, total pressure drop, design calculation of double pipe heat exchanger, double pipe exchangers in series-parallel arrangements.n(7 hrs)nnn## UNIT-IIInnShell and tube heat exchangersnTube layouts, baffle spacing, classification of shell and tube exchangers, design calculation of shell and tube heat exchangers, shell-side film coefficients, shell- side equivalent diameter, true temperature difference in a 1-2 heat exchanger, influence of approach temperature on correction factor, shell and tube sides pressure drop; performance analysis of 1-2 heat exchangers, design calculation of shell and tube heat exchangers; flow arrangements for increased heat recovery.n(9 hrs)nnn## UNIT-IVnnDirect contact type heat exchangersnClassification of cooling towers, wet-bulb and dew point temperatures, Lewis number, cooling-tower internals, heat balance, heat transfer by simultaneous diffusion and convection; Design and analysis of cooling towers, determination of the number of diffusion units, performance evaluation of cooling towers, influence of process conditions and operating variables on their design. (7 hrs)nnn## UNIT-VnnHeat Transfer Enhancement and Performance EvaluationnHeat transfer enhancement, heat transfer and pressure drop, plate fin heat exchanger, tube fin heat exchanger, Performance evaluation of Heat Transfer Enhancement technique. (6 hrs)","course outcomes":"- The students will be able to design heat exchangers employing all the three modes of heat transfer.n- The students will be able to identify different types of heat exchangers and use them for appropriate applications.nReference/Text Books:n- Incropera, Dewitt, Bergmann and Levine, “Fundamentals of Heat and Mass Transfer”, Wiley India, 2006.n- D.S. Kumar, “Heat and Mass Transfer”, Katson Publication, 2013.n- Kern, D. Q., Process Heat Transfer, Tata McGraw-Hill, 2000.n- Fraas, A. P., Heat Exchanger Design, Second Edition, John Wiley & Sons, 1989n- N.H. Afgan and Schliinder, “Heat Exchangers Design and Theory”, McGraw Hill.n…..………………….……………………………………………………………………….."}
