{"course code":"MEPE-19","course title":"Aerodynamics","number of credits":"3.0","prerequisites":"Thermodynamics, Fluid Mechanics","course type":"PE","branch":"me","course learning objectives":"- General knowledge of the history of aeronauticsn- Understanding the basic physical principles of flightn- Basic knowledge of aerodynamics/fluid dynamicsn- General understanding of how the design of an aircraft influences the performance","course content":"## UNIT-InnIntroduction (10 hrs)nIntroduction, Ballooning, the International Standard Atmosphere, How aircraft fly, Cockpits & Navigations, Instruments, Structural concepts, Stability & Control, Paper aircraft. Aircraft and Aerodynamic Forces and Moments, Fluids and Forces in Fluids, Kinematics of fluid motion, speed of sound, Shock Waves Normal & Oblique shock Waves.nnn## UNIT-IInnAerodynamics (10 hrs)nFundamentals of Aerodynamics quantities & equations, Bernoullli’ s principle, Compressibility, Conditions for Incompressibility , Non-dimensional Form of the Equations and Possible Simplifications, High Reynolds Number Approximation Viscous flows, Pressure distributions and flow separation Airfoils, Critical Mach number, Finite wings.nnn## UNIT-IIInnFlight Mechanics (10 hrs)nIntroduction to flight mechanics, Horizontal flight performance, Climbing and descending flight envelope, Equations of Motions, Equations of Fluid Motion - Navier - Stokes Equation, Conservation of Energy and Energy Equation, Equations of Motions. Kinematics of fluid motion - Velocity with specified extension and vorticitynnn## UNIT-IVnnPropulsion (10 hrs)nPropulsion, Water Rocket, Materials & Exploring the limits, Special Vehicles. Aircraft Power plant, Fuel system design, design and Manufacturing Standards in Aircraft industry, Performance of Turboprop & Turbofan Engine.","course outcomes":"By the end of this education program, the students will be able to:n- Understand the basic laws and its conceptsn- Understand the aerodynamics laws and its concepts.n- Analysis of governing equations for fluidn- Understand different propulsion, and aircraft power plant system.nReference:n- Power Plant Engineering by P.K. Nag, Tata McGraw Hill, Second Editionn- Introduction to Aerodynamics - Video course by Dr. K.P. Sinhamahapatra Department of Aerospace Engineering IIT Kharagpur (https://nptel.ac.inn/courses/101105059/).n- Fundamentals of Propulsion by V.Babu ANE Student Edition, 2009.n- Introduction to Aeronautical Engineering online course edx by TuDelft university.(https://courses.edx.org/courses/course-v1:DelftX+AE1110x+2T 2018/course/)n- Gas Dynamics and Propulsion- Video course by Prof. V. Babu Department of Mechanical Engineering IIT Madras (https://nptel.ac.in/courses/112106 166/).n- Hypersonics – from Shock Waves to Scramjets online course Edx by University of Queensland. (https://courses.edx.org/courses/coursev1:UQxn+Hypers301x+1T2018/course/)n- Jet Aircraft Propulsion (Video) by Prof. Bhaskar RoyIIT Bombay (https://npteln.ac.in/courses/101101002/37).n- Aerospace Propulsion by Dr. P.A. RamakrishnaIIT Madras(https://nptel.ac.in/ courses/101106033/4).n…..………………….……………………………………………………………………….."}
