{"course code":"MEPE-10","course title":"Thermal Power Engineering","number of credits":"3","prerequisites":"Nil","course type":"PE","branch":"me","course learning objectives":"- To understand the basic fundamentals of boilers and power plant cycles.n- To understand operations of steam turbines and steam power plants.n- To understand operations of diesel and gas turbine power plants.n- General understanding of challenges in thermal power plants.","course content":"## UNIT-InnIntroductionnIntroduction to thermal power, Description and classification of boilers, Boiler mountings & accessories, Natural draught, Artificial draught: Chimney design, Steam jet draught and mechanical draught, Calculation of boiler efficiency & equivalent evaporation. (6hrs)nVapour Power CyclesnCarnot cycle, Simple & modified Rankine cycles, Effect of operating variables on Rankine cycle, Rankine cycle with superheating, Reheating & regeneration, Reheat factor, Binary vapour cycle. (4hrs)nnn## UNIT-IInnSteam TurbinesnIntroduction, Classification of steam turbines, Working principle, Compounding, Velocity diagrams, Calculation of power output and efficiency, Condition for maximum efficiency, Degree of reaction, Governing of steam turbine.n(8hrs)nSteam (Thermal) Power PlantsnAnalysis of steam power cycles for power plant application; High pressure boilers- La-Mont boiler, Benson boiler, Loeffler boiler; Velox boiler; Super pressure steam power plants; Economizers; Air-preheaters; Super heaters and reheaters; Feed water heaters. General layout of thermal power plant; Site selection for thermal power plant; Coal as fuel, classification of coals, analysis of coal; Coal handling; Dead and live storage; Combustion of coal: coal burning methods, overfeed stokers, underfeed stokers, Pulverized fuels and burners. Ash handling and disposal; Dust collectors. Heat balance sheet for thermal power plants. (6 hrs)nnn## UNIT-IIInnDiesel Power PlantsnIntroduction; Field of use; Outline of diesel electric power plant; Different systems of diesel power plant; Supercharging of diesel engines; Performance of diesel power plant; Advantages and disadvantages of diesel plants over thermal power plants. (4 hrs)nGas Turbine PlantsnElements of plant; Thermal refinements; Performance of plants; Gas turbine characteristics; Comparison with other plants; Combined steam and gas turbine power plants. (4 hrs)nnn## UNIT-IVnnFluctuating Loads on Power PlantsnIntroduction, Load curves, Different terms and definitions, Effects of variable loads on power plant design and operation. (4 hrs) Economic Analysis of Power plants and TariffsnCost of electrical energy; Selection of type of generation; selection of generating equipment; performance and operating characteristics of power plants; Load division among generators; Tariffs methods for electrical energy. (4hrs)","course outcomes":"By the end of this education program, the students will be able to:n- Understand the over view of boilers and power plant cycles.n- Understanding the operations of steam turbines and steam power plants.n- Analysis of operations of diesel and gas turbine power plants.n- Rectify the general challenges in thermal power plants.","reference books":"- Thermal Engineering by Ballaney, Khanna Publishern- Thermal Engineering by Domkundar& Arora, Dhanpat Rain- Steam Turbine Theory & Practice by Kearton, W.J. Pitman.n- Power Plant Engineering by Morsen- Power Plant Engineering by Domkundwarn- Power Plant Technology by El-Wakiln…..………………….……………………………………………………………………….."}
