{"course code":"MEPE-39","course title":"Computer Integrated Manufacturing","number of credits":"3.0","prerequisites":"Computer Aided Design","course type":"PE/OE","branch":"me","course learning objectives":"To introduce the importance, concepts and components of computer integrated manufacturing.","course content":"Introductionnnn## UNIT-InnIntroduction to manufacturing enterprise, External and internal changes, World- class winning criteria, Introduction to CIM concepts, Three step process for CIM implementation. (5hrs)nManufacturing SystemsnManufacturing classifications, Product development cycle, Enterprise organization. (5hrs)nnn## UNIT-IInnDesign Automation: Computer-Aided Design and EngineeringnIntroduction, General system operation, CAD classification: Hardware and software platforms, Application of CAD to manufacturing systems, Design for manufacturing and assembly, Computer-aided engineering analysis and evaluation. (5hrs)nManufacturing Planning and ControlnIntroduction, planning the manufacturing planning and control system, master production schedule, inventory management, product data management. (5hrs)nnn## UNIT-IIInnMaterial Planning, Production Scheduling and Operating SystemsnMaterial requirement planning, Capacity requirement planning, MRP II, Just-in- time manufacturing. (5hrs)nEnterprise Resoruce PlanningnMRP II – a driver of effective ERP systems, information technology, the decision to implement ERP system, Features of modern manufacturing planning and control systems. (5hrs)nnn## UNIT-IVnnProduction Support Machines and SystemsnIndustrial robots, automated material handling systems, automated guided vehicles, automated storage and retrieval systems. (5hrs)nMachine and System ControlnSystem overview, Cell control, Proprietary versus Open system interconnect software, Device control, programmable logic controllers, Computer numerical control, Automatic tracking, Network communications. (5hrs)","course outcomes":"The student is able to understand various aspects of computer integrated manufacturing from hardware and software viewpoints.","reference books":"- Computer-integrated manufacturing, James A. Rehg and Henry W. Kraebber, Pearson Education.n- Computer Integrated Manufacturing Technology and Systems, U. Rembolt,nC. Blume, R. Dillmann, Dekker, 1985.n- Computer Integrated Design and Manufacturing, D.D. Bedworth, M.R. Henderson, P.M. Wolfe, McGraw Hill.n- Systems Approach to Computer Integrated Design and Manufacturing, N. Singh, John Wiley & Sons.n…..………………….……………………………………………………………………….."}
