{"course code":"MEPE-27","course title":"Maintenance Engineering","number of credits":"4.0","prerequisites":"Nil","course type":"PE","branch":"me","course learning objectives":"To understand the basic concepts of Maintenance Engineering and apply them to address the practical maintenance problems of Industries.","course content":"Introduction:nnn## UNIT-InnImportance of maintenance engineering, definitions and concepts used in maintenance, objectives and benefits of maintenance. Maintenance Systems: Various types of industrial maintenance systems, preventive corrective and breakdown maintenance systems, their merits, demerits and applications, new maintenance practices: CBM, TPM, RCM etc. (10hrs)nnn## UNIT-IInnMaintenance Planning& Control:nPlanned maintenance procedure, maintenance schedule and maintenance programme, benefits of planned maintenance and control, Computerized Maintenance Management System. (10hrs)nnn## UNIT-IIInnReliability, Maintainability & Availability:nBasic concepts and definitions, availability models, economics of reliability, availability and maintainability, distribution of down time and its basic elements.n(10 hrs)nnn## UNIT-IVnnRepair Discard Decisions:nIntroduction, factors affecting repair –discard decisions, cost-analysis and optimum module size.nSpare Parts Management:nMaterial and store control, consideration of spare provisioning on operational availability. (10 hrs)","course outcomes":"Upon completion of this course, student would be able ton- Understand the basic concepts of Maintenance Engineering.n- Understand the fundamentals of various Industrial Maintenance Systems.n- Understand the significance of Maintenance Planning and Control.n- Analyse the relationship and economics of Reliability, Availability and Maintainability.n- Understand the relevance of Repair-Discard Decisions and Spare Parts Management.","reference books":"- R.H. Cliffton,Principles of Planned Maintenance, McGraw Hill, New York, 2001.n- A. Kelly,Maintenance Planning and Control, PHE, London, 1984.n- Heintzelman, Handbook of Maintenance Management, PHE.n- F. Phillips &Rayers,Reliability, Availability and Maintainability, M/A Press.n- E. Balagurusamy, Reliability Engineering, Tata McGraw Hill, 4th print, 2003.n- L. S. Srinath, Reliability Engineering, East West Press Pvt. Ltd., 3rd Ed., 1991.n- A.Birolini, Reliability Engineering: Theory and Practice, Springer, 5th edition, 2007.n- H.P. Garg and B.P. Gupta, Industrial Maintenance, S. Chand Publishing, revised edition, 2010.n…..………………….……………………………………………………………………….."}
