{"course code":"MEPE-30","course title":"Advanced Manufacturing Technology","number of credits":"3.0","prerequisites":"Production Technology","course type":"PE/OE","branch":"me","course content":"Course Learning Objective:n- To impart knowledge of advanced knowledge of manufacturing technology such as thread manufacturing, metal forming & die casting.n- To impart through knowledge to student about the various metal processing.nnn## UNIT-InnSpecial Processing MethodsnHot machining, Machining of Plastics, Unit heads, Plastics Tooling, Electro forming, Surface Cleaning and Surface Treatments, Surface Coatings, Paint Coating and Slushing, Adhesive Bonds, Adhesive Bond Joints, Adhesives, Surface Coating for Tooling, Graphite Mould Casting, and Vacuum Mould Process. (4 hrs)nCeramic Materials and Their ProcessingnIntroduction, Classification of ceramics, Properties of Ceramics, Processing of ceramics, Product Application, Enamels, Glass, Glass forming Constituents, Types of Glasses, forms of Glasses and their manufacture. (4 hrs)nnn## UNIT-IInnComposite Materials and Their ProcessingnIntroduction, Types of Composites materials, Agglomerated Materials, Reinforced materials, Laminates, Surface Coated Materials, Production of Composite Structures, Fabrication of particulate composite Structures, Fabrication of reinforced Composite, Fabrication of Laminates, Machining, Cutting and Joining of Composites. (6 hrs)nProcessing of PlasticsnIntroduction, Polymers, Polymerization, Addition of Polymers, Plastics, Types of plastics, Properties of Plastics, Processing of Thermoplastic Plastics, Injection Moulding, Extrusion Process, Sheet forming processes, Processing of Thermosetting Plastics, Compression Moulding, Transfer Moulding, Casting of Plastics, Machining of plastics, other processing methods of plastics. (4 hrs)nnn## UNIT-IIInnThread ManufacturingnIntroduction, casting, thread chasing, Thread Rolling, Die Threading and Tapping, Thread Milling, Thread Measurement and Inspection. (4 hrs)nAnalysis Of Metal Forming ProcessesnTheoretical basis of metal forming, classification of metal forming processes, cold forming, hot working, Warm working, Effect of variables on metal formingnprocesses, Methods of analysis of manufacturing processes, Open Die forging, Rolling Power Rolling, Drawing, Extrusion. (6 hrs)nnn## UNIT-IVnnDie CastingnIntroduction, Product Application, Limitation of Die Casting, Die Casting Machines, Molten metal Injection systems, Hot chamber machines, Cold chamber machines, Die casting Design, Design of Die casting Dies, Types of Die casting Dies, Die design, Die material, Die Manufacture, Die Lubrication and Coating, Preheating of Dies, Vacuum Die Casting, Recent trends in Die Casting Process. (6 hrs)nCost EstimationnDefinition, Cost accounting or costing, Elements of costing, cost structures, Estimation of cost elements, Methods of estimating, Data requirements of cost estimating, Steps in making cost estimate, Chief factors in cost estimating, Numerical examples, calculation of machining times, Estimation of total unit time.n(6 hrs)","course outcomes":"- Understand various surface treatment methods commonly used for materialsn- Understand ceramic materials, composite materials and plastics along with their processing to manufacture componentsn- Understand and apply thread manufacturing methods and their measurementsn- Understand and carry out metal forming process analysisn- Understand die casting machines and to carry out die designn- Understand cost accounting and apply to compute cost for manufacture of components.","reference books":"- Principles of Manufacturing by J.S.Campbell, Tata McGraw-Hilln- Production Engineering Sciences by Pandey and Sinh Standard Pub.n- A text book of Production Technology by P.C. Sharma S.Chand& Company.n- Manufacturing Materials and Processes by Lindberg Prentice Hall"}
