{"course code":"MEPE-26","course title":"Supply Chain Management And Logistics","number of credits":"3","prerequisites":"","course type":"PE","branch":"me","course learning objectives":"To understand concept of Supply chain management and apply this knowledge to understand the working of corporate world.","course content":"S:nnn## UNIT-InnUnderstanding the Supply Chain, Performance, Drivers and Obstacles Objectives of supply chain, Stages of supply chain, Supply chain process cycles, Push/pull view of supply chain processes, Importance of supply chain flows, Examples of supply chain, Strategic decisions in supply chain management. Supply Chain Performance, Supply chain strategies, Achieving strategic fit, Product life cycle, Supply Chain drivers and Obstacles, Four drivers of supply chain – inventory, transportation, facilities, and information, Obstacles to achieve strategic fit. (10 hrs)nnn## UNIT-IInnPlanning Demand and Supply in a Supply Chain,nRole of forecasting in a supply chain, Forecasting methods in a supply chain, Basic approach to demand forecasting, Aggregate planning resources. Managing economies of scale in a supply chain, Role of cycle inventory in a supply chain.n(4 hrs)nTransportation and Coordination in a Supply ChainnFacilities affecting transportation decisions, Transport selection, Modes of transportation and their performance characteristics, Trade-offs in transportation decision, Making transportation decisions in practice, Models for transportation and distribution, Third party logistics (3PL). Coordination in a Supply chain, Lack of supply chain coordination and the Bullwhip effect, Effect of lack of coordination on performance, Obstacles to coordination, Achieving coordination in practice.n(6 hrs)nnn## UNIT-IIInnSource Management and IT in Supply ChainnInventory management in supply chain, Information technology in supply chain, Typical IT solution, Reverse supply chain, Reverse supply chain Vs. Forward supply chain. (6 hrs)nAdvanced topics in SCMnGreen, Lean, Sustainable, Global and Agile supply chain Management, Quality in Supply Chain. (6 hrs)","course outcomes":"- Upon completion of this course, the students will be able ton- Understand the decision phases and apply competitive & supply chain strategies.n- Understand drivers of supply chain performance.n- Analyze factors influencing network design.n- Analyze the influence of forecasting in a supply chain.n- Understand the role of aggregate planning, inventory, IT and coordination in a supply chain.","reference books":"- Christopher Martin, “Logistics and Supply Chain Management”, Pearson Education Asia.n- Chopra Sunil and Meindl Peter, “Supply Chain Management – Strategy, planning and operation’s”, Pearson Education, Asia.n- Kapoor K K, KansalPurva, “Marketing logistics: A Supply Chain Approach”, Pearson Education Asia.n- Mohanty, R.P and Deshmukh, S.G., “Supply Chain Management”, Pearson Education Asia.n- Fawcett, S. E., Ellram, L. M and Ogden, J. A., “Supply Chain Management” Pearson Education Asia.n…..………………….……………………………………………………………………….."}
