{"course code":"MEPE- 38","course title":"Production Planning and Control","number of credits":"3.0","prerequisites":"","course type":"PE/OE","branch":"me","course learning objectives":"- To understand the basic fundamentals of Production Planning and Control, Production Planning functions and apply this knowledge to the working of Production Systems.n- To understand the basic concepts of Product Development and Design.n- To impart the knowledge of Inventory Control, V.E.D. analysis, S-D-E analysis, F-S-N analysis H-M-L analysis and ABC analysis, Safety stocks and service levels.n- To impart the knowledge of Evaluation of Material Processes and Value Analysis Tests.n- To understand the significance of various Production Control functions viz. Dispatching, Expediting, Inspection and Evaluation.","course content":"Introductionnnn## UNIT-InnBasic concepts of Production Planning and Control, Preplanning Planning, Production Planning and Control Functions: Estimating, Routing, Scheduling, Loading and Sequencing. (4 hrs)nnn## UNIT-IInnProduct Development and DesignnEffect of competition on design, Long-range Planning, Company policy, product analysis, marketing aspects, the product characteristics, functional aspect, operational aspect, durability and dependability, Aesthetic aspect; Economic analysis, Profit and competitiveness, The Three S Concept- Standardization, Simplification and Specialization, Break Even Analysis. (9 hrs)nnn## UNIT-IIInnInventory ControlnDefinition, classification, objectives of inventory control, functions, economic order quantity various inventory models. Numericals on inventory control. Inventory carrying costs, factors affecting inventory costs.V.E.D. analysis, S-D-E analysis, F-S-N analysis H-M-L analysis and ABC analysis. Safety stocks, their objectives safety stocks and service levels. (9 hrs)nnn## UNIT-IVnnEvaluation of Material and ProcessesnIntroduction, value analysis, consideration of new techniques and materials, value analysis tests, material utilization of a product or assembly. Numerical problems on material utilization of a product. Value engineering job plan and various phases of job plan in systematic value engineering approach. (10 hrs)nnn## UNIT-VnnDispatching, Expediting, Inspection and EvaluationnIntroduction, Dispatch Procedure, Expediting, Inspection, Evaluation and Corrective Action. (8 hrs)","course outcomes":"Upon completion of this course, student would be able ton- Develop the understanding of Production Systems and their important features.n- Understand the major concepts of Product Development and Design and their applications.n- Understand the importance of various Product Characteristics.n- Develop an understanding of various Inventory Control Concepts, Inventory models, Inventory Costs and ABC Analysis.n- Understand the significance of various Production Planning and Control functions viz. Dispatching, Expediting, Inspection and Evaluation.","reference books":"- Production Planning and control: Samuel Eilon The Macmillan Company, 1962.n- The Fundamental of Production Planning And Control, Stephen N Chapman, Pearson Education, 2009.n- Production Planning and Control: K.C. Aggarwal & K.C. Jain, Khaana publishers, 2014n- Production Planning and Control: Text and Cases, S.K. Mukhopadhyay, PHI,2015.n- Industrial Engg. & Operation Management by S.K. Sharma & Savita Sharma,nS.K. Kataria and Sons, 2010.n- Production Planning and Control: King J.R, Pergoan-1975.n- Production Planning and Control: Sharma, Hari Raghu Rama Sharma, Everest Publishing House, 2010.n- Production Planning and Control Seethrarama L. Narasimhan, Prentice Hall, 2ed-1994.n…..………………….……………………………………………………………………….."}
