{"course code":"MEPE-29","course title":"Gas Dynamics","number of credits":"3.0","prerequisites":"Thermodynamics, Fluid Mechanics","course type":"PE/OE","branch":"me","course learning objectives":"- To understand the Basic fundamentals equations.n- To understand the flow of compressible and normal shock waves.n- To understand the moving normal, oblique shock waves and flow phenomenon.n- To understand the measuring instruments gas dynamics.","course content":"Review of Elementary Principlesnnn## UNIT-InnIntroduction; Thermodynamic concepts for control mass analysis; Comments on Entropy; Pressure energy equation; Stagnation concept; Stagnation pressure; Energy equation; Momentum equation. (4 hrs) Introduction to Compressible FlownIntroduction; Objectives; Speed of propagation of a pressure front; Mach Number; Sonic velocity; Pressure field due to moving source of disturbance; Mach cone; Mach angle; Equation for a perfect gas in terms of Mach number; H-S & T-S diagrams. (6 hrs)nnn## UNIT-IInnOne Dimensional Compressible FlownIntroduction; Isentropic flow; General fluid- without losses; Perfect gas with losses; The reference concept; Isentropic tables; Nozzle operation; Nozzle performance; Diffuser performance; Friction effects on nozzle flow. (6 hrs) Standing Normal ShocksnIntroduction; Shock analysis; General fluid; Working equations for perfect gas; Normal shock tables; Shocks in nozzles; Thermodynamic directions of normal shock; Rankine-Hugoniat relation; Strength of shock. (6 hrs)nnn## UNIT-IIInnMoving Normal Shocks and Oblique ShocksnIntroduction; Normal shocks; Tangential velocity superimposition; Oblique shocks; Oblique shock analysis; Oblique shock tables and charts; Boundary conditions of flow direction; Boundary conditions of pressure equilibrium. (6 hrs) Fanno and Rayleigh FlownIntroduction; Analysis for general fluid; Working equations for a perfect gas; Reference state & Fanno tables; Applications; Correlation with shocks; Friction choking; Rayleigh flow; Analysis for a general fluid; Working equations for a perfect gas; Reference state and Rayleigh tables; Applications; Correlation with shocks. (6 hrs)nnn## UNIT-IVnnHigh Temperature Gas Dynamics and MeasurementsnIntroduction; Importance of high-temperature flows; Nature of high temperature flows; Pressure measurements; Temperature measurements; Velocity and direction measurements; Density measurements. (6 hrs)","course outcomes":"By the end of this education program, the students will be able to:n- Understand the fundamental laws and its concepts.n- Understand the concept of compressible flow and normal shocks.n- Understand the principle of moving normal, oblique shock waves and flow phenomenon.n- Understand the measuring instruments of gas dynamics.","reference books":"- Gas Dynamics - Video course NPTEL T. M. Muruganandam Indian Institute of Technology Madras https://nptel.ac.in/courses/101106044/1n- Gas Dynamics by E. Rathakrishnann- Fundamentals of Gas Dynamics by S. M. Yahya.n- Gas Dynamics by Beckern- Fundamentals of Gas Dynamics by R. D. Zuckern- Prof. V. Babu, Air breathing Engines NPTEL Video course, Department of Mechanical Engineering IIT Madras.n- Fundamentals of Propulsion by V. Babu ANE Student Edition, 2009n- P. G. Hill and C. R. Peterson, Mechanics and Thermodynamics of Propulsion, Addison Wesley, Third Edition, 1991.n- J. D. Mattingly, Elements of Gas Turbine Propulsion, Aeronautical and Aerospace Engineering, McGraw-Hill Series in 1996.n- G. C. Oates, Aerothermodynamics of Gas Turbine and Rocket Propulsion, AIAA Education Series, Third edition, 1997.n- G. C. Oates, Aerothermodynamics of Aircraft Engine Components, AIAA Education Series, 1985.n- H. I. H. Saravanamuttoo, G. F. C. Rogers and H. Cohen, Gas Turbine Theory, Pearson Education, Fifth edition, 2004.n- Introduction to Aeronautical Engineering online course edx by TuDelft university. (https://courses.edx.org/courses/course-v1:DelftX+AE1110x+ 2T2018/course/)n- Gas Dynamics and Propulsion - Video course by Prof. V. Babu Department of Mechanical Engineering IIT Madras (https://nptel.ac.inn/courses/112106166/).n- Jet Aircraft Propulsion (Video) by Prof. Bhaskar Roy IIT Bombay (https:// nptel.ac.in/courses/101101002/37).n- Aerospace Propulsion by Dr. P.A. Ramakrishna IIT Madras (https://nptel. ac.in/courses/101106033/4).nHyperlinks:n- http://www.grc.nasa.gov/WWW/K-12/airplane/n- http://www.rolls-royce.com/n…..………………….……………………………………………………………………….."}
