{"course code":"MEPE-18","course title":"Operations Research","number of credits":"3","prerequisites":"","course type":"PE","branch":"me","course learning objectives":"- To develop an understanding of tribology, surface topography and the importance of tribology in engineeringn- To understand the basic laws and theories of friction and wear along with measurement techniquesn- To understand the types and properties of lubricantsn- To gain knowledge regarding the mathematical equation governing thenperformance of various bearings and other transmission components","course content":"S:nIntroductionnnn## UNIT-InnIntroduction to tribological systems and their characteristic features, Analysis and assessment of surface topography, deterministic and stochastic tribo-models for asperity contacts, techniques of surface examination, tribological properties of surfaces. (6 hrs)nFrictionnQuantitative laws of sliding friction, causes of friction, adhesion theory, laws of rolling friction, measurement of friction. (7 hrs) UNIT-IInWearnIntroduction, mechanism of wear, types of wear, quantitative laws of wear, measurement of wear, wears resistance materials. (7 hrs) Lubrication and LubricantsnIntroduction, dry friction, boundary lubrication, hydrodynamic, hydrostatic and elasto-hydrodynamic lubrication, functions of lubricants, types and properties of lubricants, lubricant additives, solid lubricants. (7 hrs)nnn## UNIT-IIInnBearings and Bearing MaterialsnGeometry and pressure equation of journal bearing, hydrostatic bearings, thrust bearings, porous bearings and hydrodynamic gas bearings. Journal bearings with specialized applications. General requirements and different types of bearing materials. (7 hrs)nElasto-hydrodynamic lubricationnPrinciples, application to rolling contact bearings, cams, gears. (6 hrs)","course outcomes":"- The students will be able to analyse the contact between rough surfaces and determine important tribological characteristics.n- The students will be able to correlate material properties and other parameters with friction and wear behaviour.n- The students will be able to select lubricant and evaluate load carrying capacity, friction coefficient etc. for various bearings.n- The students will be able to explain various aspects related to advanced topics in the area of Tribology.","reference books":"- Principles of Tribology by J. Halling, Macmillann- Mechanics and Chemistry in lubrication by Dorinson and Ludema, Elseviern- Friction and wear of Materials by E. Robinowicz, John Wileyn- Principles of Lubrication by A. Cameron, Longmansn- Introduction to Tribology of Bearings by B.C. Majumdar, S Chandn- Engineering Tribology by Prasanta Sahoo, PHIn- Friction and Lubrication by E.P.Bowden and Tabor.D, Heinemann Educational Books Ltd.n…..………………….……………………………………………………………………….."}
