{"course code":"MEPE-41","course title":"Air Breathing Engines","number of credits":"3.0","prerequisites":"Thermodynamics","course type":"PE/OE","branch":"me","course learning objectives":"- To understand the Basic fundamentals of Gas dynamicsn- To understand the basic of propulsion system of air breathing engine.n- To understand the basic principle of Ramjet Engine workingn- To understand the thermodynamics of Jet engines.","course content":"Introductionnnn## UNIT-InnIntroduction, Fundamental Ideas, Normal shocks, Flow with heat addition, Rayleigh flow, Flow with friction Fanno flow, Quasi 1D flows, Oblique shocks, Prandtl -Meyer waves. Mech number. (10 hrs) UNIT-IInBasic ideas in aircraft propulsion ThrustnModes of Propulsion, Turbojet engine Operation of a turbojet and afterburning turbojet engine, Turbojet engine - Component analysis – intake and compressor, Turbojet engine- Component analysis – combustor, turbine and nozzle. (7 hrs) Turbofan enginenTurbofan engine- Component analysis – Fan, Turbofan engine emerging trends.n(6 hrs)nnn## UNIT-IIInnRamjet and turbo ramjet enginesnOperation of a Ramjet Engine and a Turboramjet Engine, Ramjet and turbo ramjet engines Component analysis – Supersonic Intake Ramjet and turbo ramjet engines Component analysis – Supersonic Intake, Combustor. (5 hrs)nnn## UNIT-IVnnScramjet, Thermodynamics of jet enginesnThrust Equation for a Turbojet and Turbofan Engine; T-s diagram of a Turbojet Engine, Thermodynamics of jet engines Component efficiencies; T-s diagram of a Turbofan Engine, Thrust calculations Turbojet and Turbofan engine, Afterburning Turbojet and Ramjet Engine Thrust calculations, Worked example. (8 hrs)","course outcomes":"By the end of this education program, the students will be able to:n- Understand the Gas dynamics laws and its concepts.n- Understand the components of air breathing analysis and its operation.n- Understand of working of Ramjet and turbo ramjet and its combustion phenomenon.n- Understand the thermodynamics analysis inside the engine and it’s numerical.nReference:n- Prof. V. Babu, Air breathing Engines NPTEL Video course, Department of Mechanical Engineering IIT Madras.n- Fundamentals of Propulsion by V. Babu ANE Student Edition, 2009n- P. G. Hill and C. R. Peterson, Mechanics and Thermodynamics of Propulsion, Addison Wesley, Third Edition, 1991.n- J. D. Mattingly, Elements of Gas Turbine Propulsion, Aeronautical and Aerospace Engineering, McGraw-Hill Series in 1996.n- G. C. Oates, Aerothermodynamics of Gas Turbine and Rocket Propulsion, AIAA Education Series, Third edition, 1997.n- G. C. Oates, Aerothermodynamics of Aircraft Engine Components, AIAA Education Series, 1985.n- H. I. H. Saravanamuttoo, G. F. C. Rogers and H. Cohen, Gas Turbine Theory, Pearson Education, Fifth edition, 2004.n- Introduction to Aeronautical Engineering online course edx by TuDelft university. (https://courses.edx.org/courses/course-v1:DelftX+AE1110x+2T 2018/course/)n- Gas Dynamics and Propulsion - Video course by Prof. V. Babu Department of Mechanical Engineering IIT Madras (https://nptel.ac.in/courses/ 112106166/).n- Jet Aircraft Propulsion (Video) by Prof. Bhaskar Roy IIT Bombay (https://nptel.ac.in/courses/ 101101002/37).n- Aerospace Propulsion by Dr. P.A. Ramakrishna IIT Madras (https:// nptel.ac.in/courses/101106033/4).nHyperlinks:n- http://www.grc.nasa.gov/WWW/K-12/airplane/n- http://www.rolls-royce.com/n…..………………….……………………………………………………………………….."}
