{"course code":"MEPE-23","course title":"Computational Fluid Dynamics","number of credits":"3.0","prerequisites":"","course type":"PE","branch":"me","course learning objectives":"- To be able to understand the concepts of PDEs, their application to CFD problems and fundamentals of discretization.n- To be able to solve problems related to heat transfer and fluid flow using Finite Difference and Finite Volume Methods.n- To be able to understand the limitations and errors involved in solution to CFD problems.","course content":"S:nnn## UNIT-InnIntroductionnIntroduction to C.F.D., models of the flow, governing differential equations – continuity equation, momentum equation, energy equation, Navier- Stokes equation, physical boundary conditions. (10hrs)nnn## UNIT-IInnMathematical behaviour of governing equationnClassification of quasi linear partial differential equation, General method of determining the Classification of partial differential equation, hyperbolic, parabolic, elliptic equations. (5hrs)nDiscretization methodsnFinite difference methods, difference equations, explicit & implicit approach, errors & analysis of stability. Basics of finite control volume method (5hrs)nnn## UNIT- IIInnHeat conduction problemnSolution of One dimensional heat conduction through a pin, solution of two dimensional steady state and transient heat conduction problems, heat conduction problems in cylindrical coordinates: axisymmetric and non-axisymmetric problems.n(5hrs)nHeat conduction with convection & diffusionnSteady state one dimensional convection and diffusion, upwinding, exact solution, exponential scheme, hybrid scheme, power law scheme, Discretization equation for two dimensions & three dimensions, false diffusion. (5hrs)nnn## UNIT- IVnnFluid flow problemnViscous incompressible flow, solution of the couette flow problem by F.D.M., calculation of the flow field using stream function –vorticity method numerical algorithms for solving complete Navier-Stokes equation – MAC method; SIMPLE method. (10hrs)","course outcomes":"At the end of the course student will be able ton- understand the concepts of PDEs, their application to CFD problems and fundamentals of discretization.n- solve problems related to heat transfer and fluid flow using Finite Difference and Finite Volume Methods.n- .to understand the limitations and errors involved in solution to CFD problems.","reference books":"- Suhas. V. Patankar, Numerical heat transfer and fluid flow, Hemispheren- John. D. Anderson, Jr, Computational fluid dynamics, McGraw Hilln- Anil .W. Date, Introduction to Computational fluid dynamics, Cambridge University Pressn- Niyogi, Chakraborty and Laha, Introduction to Computational fluid dynamics, Pearson Educationn…..………………….……………………………………………………………………….."}
