{"course code":"MEPE-16","course title":"Industrial Engineering","number of credits":"3","prerequisites":"","course type":"PE","branch":"me","course learning objectives":"- To make students aware on the concept of industrial Engineering and various Organization systems.n- To impart knowledge about production systems and Sales Forecasting methods.n- To make students aware on production planning methods.n- To enable students to learn about Inventory control and material handling.","course content":"## UNIT-InnIntroduction to Industrial EngineeringnDefinition, Techniques of Industrial Engineering, Origin & Development of Factory System, Pioneers of Scientific Management, Concept of Productivity. (5 hrs) Factory OrganizationnPrinciples of Organization, Importance and Characteristics of Organization, Types of Organization-Military or Line Organization, Functional Organization, Line and Staff Organization, Committees Organization. (4 hrs)nnn## UNIT-IInnIndustrial Production SystemsnClassification of Production Systems, Introduction to Flexible Manufacturing System. (4 hrs)nSales ForecastingnIntroduction, Objectives and Importance of Sales Forecasting, Collective Opinion Method, Economic Indicator Method, Regression Analysis, Moving Average Method, Time Series Analysis, Break Even Analysis, Numerical Problems. (6 hrs)nnn## UNIT-IIInnProduction Planning and ControlnObjectives of PPC, Functions of PPC, Preplanning and Planning, Routing, Estimating, Scheduling – Master Schedule, Daily Schedule, Gantt chart, Dispatching-Centralized v/s. Decentralized, Control and Progress Reporting.n(6 hrs)nMaterial Requirement PlanningnIntroduction to Material Requirement Planning (MRP), Capacity Requirement Planning (CRP) Enterprise Resource Planning (ERP): Objectives and Functions.n(5 hrs)nnn## UNIT-IVnnInventory ControlnIntroduction, Types of Inventory, Inventory Control Importance and Functions, Inventory Costs, Factors Affecting Inventory Control, Just in Time (JIT)nManufacturing, Various Inventory Control Models, ABC Analysis, Numerical Problems. (6 hrs)nMaterials HandlingnObjectives, Functions & Principle of Material Handling, Methods, Introduction to Concept of Palletization, Unit Load Concept and Automated Guided Vehicle (AGV) System. (4 hrs)","course outcomes":"- Students will be able to understand the Basic Concepts of Industrial Engineering as welln- as the organization structures of Industry.n- Students will be able To Understand the Various Production Systems and Salen- Forecasting Methods.n- Students will be able To Understand the Importance of Planning in the Industryn- About Everything at Every Stage of Production.n- Students will be able to know the Importance of Inventory Control and Material Handling systems.","reference books":"- Production Planning and Control by S. Eilonn- Industrial Engineering and Production management by Martland T Telsang Publication S. chandn- Production and operations management by S.N.Chary Publication Tata Mc Graw Hill (TMH)n- Modern Production Management by S.S. Buffa Publication Wileyn- Industrial Engineering and Operation Research by S.K. Sharma & Savita Sharma Publication Kataria & sonsn…..………………….……………………………………………………………………….."}
