{"course code":"MEPE-13","course title":"Nuclear Engineering","number of credits":"3","prerequisites":"PHIR-11/12","course type":"PE","branch":"me","course learning objectives":"- To be able to understand the concepts of neutron physics and various nuclear Processes involved in Nuclear Power Plants.n- To be able to calculate heat generation from nuclear reaction.n- To be able to design and analyze the performance of nuclear power plants.n- To get acquainted with applications of radioactivity.n- To be able to appreciate the hazards associated with radioactivity and the necessity of waste disposal.","course content":"## UNIT-InnConcepts of Nuclear PhysicsnThe atom, structure, the nucleus, nuclear structure, atomic transmutation of elements, detection of radio-activity, particle accelerator, decay, natural of elements, nucleus interactions, decay rates, half-life, transuranic elements. (6 hrs) Neutorn InteractionnAdvantages of using neutron, neutron moderation, fission chain reaction, thermalisation of neutrons, fast neutrons, prompt and delayed neutrons, fission products. (4 hrs)nnn## UNIT-IInnEnergy ReleasenMass energy equivalence, mass defect, binding energy, energy release in fission & fusion, thermonuclear reaction, fusion bomb. (4 hrs) Reactor MaterialsnFissile & fertile materials, cladding & shielding materials, moderators, coolants.n(4 hrs)nnn## UNIT-IIInnReactor TechnologynBasic principles, fuel assembly, neutron balance, reactor kinetics, reactor coefficients, reactor stability, excess reactivity, Xenon poisoning, burnable absorbers, reactivity control, heat balance, production& transfer of heat to the coolant, structural considerations. (10 hrs) UNIT-IVnNuclear ReactorsnTypes of nuclear reactors, pressurized water reactors, boiling water reactors, CANDU type reactors, gas cooled & liquid metal cooled reactors, fast breeder reactors. (6 hrs)nSafety Considerations & Waste DisposalnHazards, plant site selection, safety measures incorporated in; plant design, accident control, disposal of nuclear waste. (4 hrs)nHealth Physics & Radio-isotopesnRadiation: units, hazards, prevention, preparation of radio-isotopes & their use in medicine, agriculture & industry. (2 hrs)","course outcomes":"At the end of the course student will be able ton- Understand the concepts of neutron physics and various nuclear Processes involved in Nuclear Power Plants.n- Calculate heat generation from nuclear reaction.n- Design and analyze the performance of nuclear power plants.n- Get acquainted with applications of radioactivity.n- Appreciate the hazards associated with radioactivity and the necessity of waste disposal.","reference books":"- M. M. El-Wakel, Nuclear Power Engineering, McGraw Hilln- Shultis and Faw, Fundamentals of Nuclear Science and Engineering, CRC Pressn- Stephenson, Introduction to Nuclear Engineering, McGraw Hilln- Murray, Nuclear Energy, Butterworth-Heinemannn…..………………….……………………………………………………………………….."}
