{"course code":"MEPE- 40","course title":"Facilities Planning","number of credits":"3.0","prerequisites":"","course type":"PE/OE","branch":"me","course learning objectives":"- To understand the main concepts of Facility Planning and apply them to know about the practical aspects of Industrial World.n- To inculcate the skills among the students for analyzing and improving the analysis of material handling problem.n- To impart thorough knowledge to the students with respect to Industrial Acts and Safety and Engineering economics.n- To impart thorough knowledge to the students about the optimum allocation of material handling equipment Facilities Planning.","course content":"Plant locationnnn## Unit-InnNature of Location Decision, Need for facility location planning, General procedures and actors influencing location decisions, Facility Location Models, economics and cost analysis, Rural and urban location pattern in India. (4 hrs) Unit-IInFacility PlanningnDefinition, Significance and objectives of facility planning, Facility planning process, Strategic Facilities Planning, Developing Facilities Planning Strategies, Flow system patterns like RAFT, CORELAP, ALDEP & PLANET, Material flow system, Activity Relationships, Space requirements, Basic Lay out types, Lay out procedures, Algorithmic Approaches, Department Shapes and mail Aisles, The impact of changes, developing Layout Alternatives. (10 hrs)nnn## Unit-IIInnFacility design for manufacturing systemnIntroduction, fixed automation system, Flexible manufacturing system, Reduction in work in process, Just-in-time manufacturing, Facilities planning trends. (3 hrs) Unit-IVnEvaluating, Preparing and Maintaining the Facilities PlannIntroduction, Evaluating, selecting, preparing, presenting, implementing and maintaining the Facilities Plan. (3 hrs)nnn## Unit- VnnIndustrial Acts and SafetynNecessity of Industrial acts, The Indian Factories Act 1948, The industrial Dispute act1947, The minimum Wage Act 1948. Introduction to Industrial safety, Causes and sources of accidents, Accident control, safety program investigation andnanalysis of accidents, Safety devices in Machines, Welfare and safety, safety and productivity. (6 hrs)nnn## Unit- VInnEngineering economicsnConcept of Engineering economics, Risk and uncertainty, discounted cash flow techniques in changing economics, Purpose, type and requirements of depreciation methods and obsolesce, Reasons for replacement and it’s models, Present worth method of comparison and future worth method.es, Welfare and safety, safety and productivity. (6 hrs)nnn## Unit- VIInnMaterial Handling EquipmentsnScope and functions of material handling, Manual mechanical handling ratio, Principles of material handling, Analysis of material handling problem, Classification of material handling system, Salient features and applications of general purpose material handling Equipments, Material handling in stores and warehouses , Optimum allocation of material handling equipment Facilities Planning. (8 hrs)","course outcomes":"- The students will be able to Rural and Urban location pattern in India.n- The students will be able to understand Developing Facilities Planning Strategies.n- The students will be able to understand the various Necessity of Industrial acts.n- The students will be able to Basic Lay out types.n- The students will be able to understand the various material handling equipment Facilities Planning.","reference books":"- JamesA.Tompkins.,“Facilities Planning”.Edition 3, publisher J.Wiley 2003.n- S.N.Chary., “Production And Operations Management” Publisher Tata McGraw-Hill Education 2004.n- S.N.Chary., “Theory and Problems in Production and Operations Management” Tata McGraw-Hill Education, 1995."}
