{"course code":"MEPE-21","course title":"Industrial Robotics","number of credits":"3","prerequisites":"Nil","course type":"PE","branch":"me","course learning objectives":"- The overall objective of this course is to understand the concepts of Roboticsn- To understand Direct and Inverse Kinematics of Robot Manipulatorn- To understand Dynamic modeling of Robot Arm and Control of Manipulators.","course content":"S:nIntroduction to Roboticsnnn## UNIT-InnEvolution of Robots and Robotics, Laws of Robotics, Progressive advancement in Robots. Robot anatomy, Human Arm Characteristics, Design and Control issue, Manipulation and Control, Programming Robots. (3 hrs) Coordinate Frames, Mapping and TransformsnCoordinate Frames, Description of objects in space, Transformation of Vectors, Inverting a Homogeneous Transform, Fundamental Rotation matrices. (4 hrs)nnn## UNIT-IInnDirect Kinematic ModelnMechanical structure and notations, Kinematic modeling of the manipulator, DenavitHartenberg Notation, Manipulator Transformation Matrix. (4 hrs) The Inverse KinematiesnManipulator workspace, solvability of Inverse kinematics model, solution techniques, closed form solution. (4 hrs)nnn## UNIT-IIInnManipulator Differential Motion and StaticsnLinear and angular velocity of a rigid body, relationship between transformation matrix and angular velocity, manipulator Jacobian, Jacobian Inverse, Jacobian Singularities, Static Analysis. (5 hrs)nDynamic ModelingnLargrangian Mechanies, Two Degree of Freedom manipulator-Dynamic Model, Lagrange-Euler formulation Newton-Euler formulation, Inverse Dynamics. (4 hrs)nnn## UNIT-IVnnControl of ManipulatorsnOpen and Close loop control, linear control schemes, linear second order SISO model of a manipulator joint. Joint Actuators, Computed Torque Control, force control of Robitics, Manipulators, Hybrid position/force control, Impedance Force/Torque Control. (4 hrs)nRobotic SensorsnSensors in Robitcs, classification of Robotic sensors, kinds of sensors used in robotics-Acoustic sensors optic, Pneumatic, force/Torque sensors. (4 hrs) Robot ApplicationsnIndustrial Applications-Material Handling, Processing Applications, Assembly applications, inspection application, Principles for Robot application and application planning, Robert safety, Non-Industrial Application. (4 hrs) Robert Languages and ProgrammingnThe Textual Robot Languages, Generations of Robot Programming Languages, Methods of Robot Programming. (4 hrs)","course outcomes":"At the end of course students will be able to:n- Understand the concepts of Industrial Robotics.n- Understand the Kinematics and Dynamics analysis of Robot Arm.n- Understand the Robot applications, Robot language and Programming.","reference books":"- Fundamental of Robotics by Robert J. Sehilling Prentice Hall of India.n- Introduction to Robotics by SaeedB.NikuPearson Education Asia.n- Robot Modeling and kinematics by RachidManseur, Luxmi Publications.n…..………………….………………………………………………………………………..nB.Tech (Mechanical Engineering) 6th SemesternORnProject WorknB.Tech (Mechanical Engineering) 7th SemesternB.Tech (Mechanical Engineering) 7th Semester Programme Electives (PE)"}
