{"course code":"MEPE-20","course title":"Renewable Energy Systems","number of credits":"3","prerequisites":"","course type":"PE","branch":"me","course learning objectives":"- To make students aware about different renewable energy resources.n- To able to understand the conversion of energy from one form to other.n- To gain knowledge regarding the solar radiation.","course content":"-nnn## UNIT-InnIntroductionnIntroduction to energy, Relevance of energy in the development of country, conventional, non-conventional and renewable sources of energy. Status of conventional sources of energy and their conservation, Exploring renewable sources of energy. (5hrs)nnn## UNIT-IInnSolar Radiation and Applications of Solar HeatnExtraterrestrial solar radiation, components of radiation, geometry of earth and sun, geometry of collector and the solar beam, effects of earth’s atmosphere, measurements of solar radiation, type of water heaters, selective surfaces, space heating, space cooling, water desalination, solar ponds, solar concentrators, thermos- electric power system, problems. (8hrs) Photovoltaic GenerationnIntroduction, the silicon p-n junction, photon absorption solar radiation input, photovoltaic circuit properties and loads, limits to cell efficiency, solar cell construction, other types of photoelectric and thermo-electric generation. (5hrs)nnn## UNIT-IIInnHydro and Wind PowersnPrinciple of hydro power conversion, impulse turbine, reaction turbines, wind turbine types, linear momentum and basic theory, dynamic matching, characteristics of the wind, power extraction by a turbine, electricity generation, mechanical power, problems. (7hrs)nBio-FuelsnIntroduction, Bio fuels, classification, bio-mass production for energy farming, direct combustion for heat, pyrolysis (destructive distillation), alcoholic fermentation, anaerobic digestion for bio-gas, agrochemical fuel extractions.(5hrs)nnn## UNIT-IVnnWave Energy and Tidal PowernIntroduction, wave motion, wave energy and power, wave patterns, devices, the causes of tides, enhancement of tides flow power, tidal range, power, world tidal power sites. (5hrs)nOTEC and Geothermal EnergynPrinciples of Ocean Thermal Energy Conversion (OTEC), Claude cycle, Andersan cycle, Introduction to geothermal energy, dry rock and hot aquifer analysis, harnessing geothermal resources (6hrs)","course outcomes":"At the end of the course student will be able to understand about energy, its importance and different sources of energy and its conversion into different forms","reference books":"- Renewable Energy Rsources by john W. Twidell and Anthony D. Weir, published by E.& F. N. SponLtd,Lndon.n- Solar Energy by S P Sukhatme, Publisher Tata Mc Graw- Hill New Delhin- Renewable energy by Bent Sorensen by Academic pressn- Non-conventional Energy Sources by G D Rai by Khanna PublishersDelhin…..………………….……………………………………………………………………….."}
