{"course code":"PHIR11","course title":"Physics –I (Theory)","number of credits":"3 (2L +1T)","prerequisites":"-","course type":"EPR","branch":"phy","course learning objectives":"- To develop the understanding of fundamentals of Physics essential for engineering and technology.n- To introduce engineering relevance of Quantum mechanics, Electromagnetic theory, Crystal Physics, Optics, Theory of relativity, Lasers and Nuclear technology.","course content":"## UNIT-InnQUANTUM MECHANICS: Basics of quantum mechanics, De-Broglie’s hypothesis, Uncertainty principle, Probability and Wave function, Postulates of quantum mechanics, Time- dependent and Time-independent Schrodinger wave equation, Particle in a box.nELECTRO MAGNETIC THEORY: Maxwell’s equations in vacuum and medium, Electromagnetic Waves, Propagation Energy and Poynting Vector.nnn## UNIT-IInnSOLID STATE PHYSICS: Space Lattice, unit cell and translation vectors; Miller indices, Simple and close-packed crystal structures with examples, Origin of energy bands, Kronig Penney Model (qualitative), E-K diagram, Brillouin Zones, Concept of effective mass and holes, Classification into metals, Semiconductors and insulators, Liquid crystals, Hall effect.nnn## UNIT-IIInnSPECIAL THEORY OF RELATIVITY: The Michelson-Morley experiment, relativistic transformations, length contraction, time dilation, variation of mass with velocity, mass-energy equivalence.nNUCLEAR TECHNOLOGY: Interaction of radiation with matter, Nuclear reactors, Moderators, Reactor criticality & Neutron cross-sectionnnn## UNIT-IVnnENGINEERING OPTICS: Basics of Interference, Diffraction and Polarization. Lasers and characteristics, Einstein’s coefficients, He-Ne laser, semiconductor lasers, Applications of Lasers, Optical fibres; Numerical aperture, Classification of optical fibres, fibre Losses, fibre manufacturing, Applications of optical fibre in industry and communication.","reference books":"- D.J. Griffiths, Introduction to Electrodynamics, PHI Learning Publishers, New Delhi, 2012n- H.D Young and R.A Freedman, University Physics with Modern Pearsons publications, 2012.n- S.O.Pillai, Solid state Physics, New age International publishers, 2012n- A. Beiser, Concepts of Modern Physics, McGraw-Hill, 2008.n- John Lilley, Nuclear Physics, Principles and applications, Wiley, 2016","course outcomes":"- Students will be able to understand the basics of quantum mechanics and electromagnetic theory for technological applications.n- Students will be able to solve engineering problems on solid state materials and nuclear reactorsn- Students will get knowledge of latest developments in Lasers and fibre optics and their applications in technology.nB. TECH. 1ST SEMESTER PHYSICS PRACTICALS"}
