{"course code":"PHIR12B","course title":"PHYSICS – II (EE & ECE)","number of credits":"3 (2L+1T)","prerequisites":"-","course type":"EPR","branch":"phy","course learning objectives":"- To gain knowledge of the electronic, dielectric and magnetic properties of materials.n- To understand theories relevant to the engineering principles of materials and devices.n- To solve problems related to semiconductor device operation in technology.","course content":"## UNIT-InnELECTRONIC PROPERTIES OF MATERIALS: Drude and Sommerfeld’s Free Electron theory of Metals, Concept of Fermi level, Fermi-Dirac distribution function, Charge carrier densities.nNANOTECHNOLOGY: Classifications of nanomaterials (3D, 2D, 1D and 0D) and their density of states, Quantum confinement, Manifestation of quantum confinement on optical, electrical and mechanical properties, basic characterization techniques for nanomaterials, Applications of nanotechnology.nnn## UNIT-IInnDIELECTRIC PROPERTIES OF MATERIALS: Polarization, Bound Charges, Electric displacement, susceptibility, dielectric coefficient, permittivity & various relations between these, Dielectrics in ac fields, Dielectric loss factor, effect of temperature and frequency on dielectric constant and dielectrics loss factor (qualitative description), Applications of dielectrics.nnn## UNIT-IIInnSEMICONDUCTING PROPERTIES OF MATERIALS: Direct and indirect Band gap semiconductors, Elemental and compound semiconductors, Equilibrium and extrinsic carriernconcentration, carrier transport, Drift and Diffusion current, mobility, Excess carrier generation and recombination, tunnel diode, solar cell, LEDsnnn## UNIT-IVnnMAGNETIC MATERIALS AND SUPERCONDUCTORS: Orbital diamagnetism, Atomic magnetic moments, orbital diamagnetism, Classical theory of Paramagnetism, Ferromagnetism, molecular field theory and domains, applications of magnetic materials, Type I and II Superconductors, London equation, Applications of superconductivity.","reference books":"- Arthur Beiser, Tata McGraw Hill, Concept of Modern Physics, publication, 2003n- Charles Kittel, John Wiley, Introduction to Solid State Physics, publication, 2013n- Ben G. Streetman, Prentice-Hall of India, Solid State Electronic Devices, 2012n- Jaspreet Singh, John Wiley, Semiconductor Devices-Basic Principles, publication 2008n- D. K. Bhattacharya, Oxford University Press, Engineering Physics, 2015","course outcomes":"- Students will understand the physics underlying the electronic and magnetic behavior of materials.n- Students will be able to estimate materials properties and engineer these.n- Students will understand the operation mechanism of basic components of various electrical and electronic devices."}
