{"course code":"PHIR12C","course title":"Physics –II (CS & IT)","number of credits":"3(2L +1T)","prerequisites":"-","course type":"IR","branch":"phy","course learning objectives":"- To understand the basics of quantum computingn- To understand the fundamental concepts of optoelectronic devices for information technologyn- To understand the behavior of emerging magnetic materials for data storage devices and nanomaterials","course content":"## UNIT-InnPHYSICS OF QUANTUM COMPUTING: Quantum theory- simple concepts, Wave function and its physical significance, applications of Schrödinger wave equations, concept of spin, qubits and quantum computingnnn## UNIT –IInnOPTOELECTRONIC DEVICES: Optoelectronic processes and systems, Photoconductive devices, Photoemissive devices, Photovoltaic devices, Photodetectors, Light Emitting Diode, Liquid Crystal Display, Plasma display panel.nnn## UNIT- IIInnMAGNETIC MATERIALS AND DEVICES: Molecular field theory and domains, basic ideas of Magnetoresistance, types and applications of Magnetoresistance, spintronics, fundamental concepts of magnetic data storage: writing and read head sensors.nnn## UNIT-IVnnNANOTECHNOLOGY: Classification of nanomaterials (3D, 2D, 1D and 0D) and their density of states, nanocomposites, carbon nanotubes (CNTs), graphene, nanoclusters, structural, thermal and mechanical properties of nanomaterials, bottom up and bottom down synthesis processes, basic characterization techniques for nanomaterials, Applications of nanotechnology.","reference books":"- Alastair I. M. Rae, Quantum Mechanics, Taylor and Francis, 2011n- S. O. Kasap, Principles of Electronic Materials and Devices, McGraw Hill, 2006.n- John Wilson and John Hawkes, Optoelectronics: an introduction, Prentice Hall, 1997.n- S. L. Gupta, V. Kumar, A Hand Book of Electronics, Pragati Prakashan, 2012.n- Katsuaki Sato and Eiji Saitoh (Editors), Fundamentals of Magnetoresistance Effects, John Wiley publication, 2016n- Charles P. Poole, Jr, Frank J. Owens, Introduction to Nanotechnology, Wiley, 2016","course outcomes":"- Students will understand quantum computing for information technology.n- Students will be able to use the Physics of optoelectronic devices, fiber optics in engineering applicationsn- Students will be able to develop new magnetic materials and devices used for data storagenB. TECH. 2nd SEMESTER PHYSICS PRACTICALS"}
