{"course code":"PHOE13","course title":"Physics of Energy Harvesting Technologies","number of credits":"3","prerequisites":"","course type":"OE","branch":"phy","course learning objectives":"- To gain current knowledge of various energy harvesting approaches.n- To understand basic physics behind various energy harvesting systems.n- To understand hybrid approaches and design emerging energy harvesting systems","course content":"## UNIT-InnIntroduction to energy harvesting, Available energy, Experimental characterization techniques, ApplicationsnPhotovoltaic energy harvesting: Background physics, Solar cell design and strategies for optimizing figure of merit, Various types of solar cells, Future directionsnnn## UNIT-IInnThermoelectric energy harvesting: Background physics, Semiconductors and thermoelectrics, Bulk thermoelectric materials performance, Strategies for optimizing figure of merit (ZT), Thermoelectric modules, Future directionsnnn## UNIT-IIInnPiezoelectric energy harvesting: Background physics, Piezoelectric harvester design, Modeling of piezoelectric harvesters, Strategies for optimizing figure of merit, Future directionsnMagnetostrictive energy harvesting: Background physics, Magnetostrictive harvester design, Modeling of magnetostrictive harvesters, Strategies for optimizing figure of merit, Future directionsnnn## UNIT-IVnnHybrid and emerging energy harvesting approaches: Solar-thermal energy harvesting, energy for garbage, emerging nanotechnology based approaches of energy harvestingnIntroduction to other energy harvesting approaches: Bio-inspired energy harvesting approaches, Dielectric elastomer based harvesters, Electrostatic energy harvesters, Electrets based harvesters","reference books":"- D . M . Rowe (Ed.), Thermoelectrics Handbook- Macro to Nano, CRC Press, 2005n- Antonio Luque and Steven Hegedus Handbook of Photovoltaic science and engineering, Wiley, 2010n- T. J. Kazmierski and S. Beeby, Energy Harvesting Systems: Principles, Modeling and Applications, Springer-Verlag, 2011n- S. Priya, D. J. Inman (Eds.), Energy Harvesting Technologies, Springer, 2009","course outcomes":"- Students will have knowledge of the physics of various energy harvesting approaches.n- Students will be able to analyze practical problems on various energy harvesting techniques.n- Students will be able to design energy harvesting systems"}
