{"course code":"PHOE10","course title":"LASER TECHNOLOGY","number of credits":"3","prerequisites":"-","course type":"OE","branch":"phy","course learning objectives":"LIST OF EXPERIMENTSn- To find the value of Planck’s constant by photo electric cell.n- To calibrate an electromagnet using Guoy’s balance.n- To measure Hall’s co-efficient of Germanium and calculation of charge carrier concentration.n- To measure the velocity of ultrasonic waves in organic liquids.n- To study the decay of charge on a capacitor and to find its capacitance.n- To determine the resistivity of a semiconductor by four probe method.n- To determine the band gap of germanium from the variation of its resistivity with temperature.n- To study the intensity response of a cadmium sulphide cell.n- To calibrate a voltmeter by using potentiometer.n- To study the shunting effect of a voltmeter on voltage measurementn- To measure i) Saturation magnetization ii) coercivity and iii) retentivity in a given ferromagnetic material.n- To study the dielectric properties of a dielectric at different frequencies by resonance method.n- To draw the I-V characteristics of a solar cell under constant illumination.n- To verify Stefan’s radiation law by using incandescent filament.n- To verify the inverse square law of gamma ray using GM countern- To familiarize the students in the field of laser physics and their spectroscopic applications in different fields of science and technology.n- To understand the interaction of light and matter and physical principles underlying the fabrication of laser systems.","course content":"## UNIT-InnLaser Fundamentals: Concept of Laser emission, Characteristics of Lasers, Main components of Laser system, Necessary and sufficient conditions for Laser action, Einstein coefficients, population inversion, laser pumping, two, three and four level laser systems.nnn## UNIT-IInnLaser Beam Propagation and Transformation: Optical cavities, Types of optical resonator, Stability criterion (stable and unstable resonator), Threshold gain coefficient, Resonator modes (longitudinal and transverse modes), Threshold condition of laser oscillation, Q-switching and mode locking.nnn## UNIT-IIInnTypes of Laser: Solid State laser (Ruby laser, Nd: YAG, Nd: Glass etc), Gas laser (CO2 and Argon ion laser) and Dye laser, Excimer laser, Free electron laser, Chemical laser and Semiconductor laser, Homojunction Laser (Laser Diode) and Heterojunction Laser.nnn## UNIT-IVnnLaser Applications: Laser in materials processing and industry, Lasers in Micro- and Nano- fabrication and metrology, Lasers in spectroscopy, Lasers in communication and Holography, Lasers induced fusion, Laser systems for biomedical and remote sensing applications.","reference books":"- W.T. Silfvast: Laser Fundamentals, Cambridge University Press, 2004n- B.B. Laud: Lasers and Non-linear Optics, Wiley Eastern Limited, 2nd Edition 1991n- Laser in Bioscience, Industry, and Defence by Mansharamani Narain, Defence Research & Development Organisation (India) 2012n- Principle of Lasers, 5th Edition, Orazio Svelto, Springer New York 2010n- Lasers: Fundamentals and Applications, K Thyagarajan and Ajoy Ghatak, Springer, USA, 2010n- Fiber Optics and Lasers: The two revolutions, Ajay Ghatak and K. Thyagarajan, Macmillan India, 2006, Reprint 2008-09n- Modern Physics, G.Kaur and Gary R. Pickrell, McGraw Hill education, 2014","course outcomes":"- Students will become aware of latest developments in laser technology and their applications in science, technology and research.n- Students will be able to understand the utilization of laser technology modern devices and technologies based on lasers.n- Students will be able to use laser technology in spectroscopic and industrial applications."}
