{"course code":"PHOE 12","course title":"Industrial Physics","number of credits":"3","prerequisites":"","course type":"OE","branch":"phy","course learning objectives":"- To gain current knowledge of energy generation techniques, environmental effects and its industrial impactn- To understand basic Physics and chemistry behind various industrial devices/ processes.n- To gain knowledge in designing of emerging devices/ processes","course content":"## UNIT-InnEnergy- environment and its industrial impact: Energy and power- principles, demands outlook, transformation of energy and its cost, thermal pollution, electrical energy from fossil fuels, hydroelectric generation- principles and problems, costs, capacity, storage, reserves, efficiency, new environmental effects, electrical energy from nuclear reactors, fusion power, solar power, biomass, etc.nnn## UNIT-IInnChemical energy scavenging: Absolute activities of joint dilute solution in common solvent, Volta potential, equilibrium, non-cosmic membrane and contact examples of electrochemical, general treatment of electromotive force-electrochemical transport, fuel cells.nnn## UNIT- IIInnLithography and nano-devices: Nano-manipulation, E beam lithography Ion beam lithography, Deep UV lithography, X-ray based lithography, Dip pen lithography, diffraction effects in nanolithography, MEM/ NEMS- basics and fabrication, NEMS/MEMS based oscillators, sensors and detectornnn## UNIT-IVnnIndustrial application of vacuum: Fundamentals of vacuum science, Vacuum measurements, Vacuum coating, vacuum impregnation, freeze drying, space simulation, ion implantation, vacuum distillation,nSensors: Fabrication of sensors, gas sensors, magnetic sensors, piezoelectric sensors, optical sensors, etc., sensing mechanisms in different sensors","reference books":"- Kenneth J. Skipka, Louis Theodore, Energy Resources: Availability, Management, and Environmental Impacts, CRC Press, 2014n- Sugiyama, Masakazu, Fujii, Katsushi, Nakamura, Shinichiro (Eds.), Solar to Chemical Energy Conversion- Theory and Application, Springer, 2016n- Sergy Edward Lyshevski, Micro-Electro Mechanical and Nano-Electro Mechanical Systems, CRC Press, 2005n- Mick Wilson et al, Nanotechnology-Basic Science and Emerging Technologies, Overseas Press, 2002n- A. Roth, Vacuum Technology, A. Roth, Elsevier, 1990","course outcomes":"- Student will understand various energy generation techniques, environmental effects and its economicsn- Student will be able to solve technical problems on various industrial devices/ processes.n- Student will be able to design emerging devices of current industrial importance."}
