{"course code":"PHOE11","course title":"NUCLEAR TECHNOLOGY","number of credits":"3","prerequisites":"-","course type":"OE","branch":"phy","course learning objectives":"- To gain knowledge of nuclear physics and implement it in Science and Technology.n- To learn about nuclear radiations and their detection and understand the biological effect of radiation.n- To learn about nuclear physics and instrumentation in different fields of science, technology and research.","course content":"## UNIT-InnGeneral Properties of Atomic Nucleus: Alpha, Beta and Gamma radiation and their properties. Properties of Nucleus, Binding Energy, Nuclear stability, Radioactivity: Natural and artificial, half life, Mean life, Laws of radioactivity, Radioactive equilibrium.nnn## UNIT-IInnInteraction and Detection of Nuclear Radiation: Interaction of radiation with matter (Charge particle, Electromagnetic and Neutron) Stopping Power, cross section, Gas filled radiation detectors, Scintillation detectors, Semiconductor detectors, SSNTD and their applications.nnn## UNIT-IIInnNuclear Reactors: Nuclear reaction and their type, Conservation laws, Direct and compound nucleus reaction, Nuclear fission, fission products, Mass and energy distribution of fission products, nuclear fission reactors, Fast Breeder reactor, Nuclear Fuel, Control rods, nuclear fusion–controlled thermonuclear reactions.nnn## UNIT-IVnnAccelerators and their applications: Accelerators: Cyclotron, Tandem, LINAC and Pelletron, Ion source, Role of accelerators in research and Technology.nRadiation dosimetry: Radiation monitoring and dosimeters, Physical and biological effects. Applications of radiation in medical and forensic sciences, Radiation Therapy.","reference books":"- Glenn F Knoll, Jhon Wiley & Sons Inc. Singapore, Radiation detection and measurement, 2012n- R M Singru, Wiley Eastern Pvt. Ltd ,New Delhi, Experimental Nuclear Physics, 2011n- Roy and Nigam, Himalaya Publishing House, Nuclear Physics: Theory and Experiment, 2016n- D C Tayal, John Wiley & Sons Ltd; Nuclear Physics, 2015","course outcomes":"- Students will be able to understand the nuclear processes and reactions in various phenomena.n- Students will learn to apply nuclear physics in research and devolvement for science and technology.n- Students will become aware of latest developments in nuclear reactors and detectors and their applications in science, technology and research."}
