{"course code":"PRIR11","course title":"Introduction to Production and Industrial Engineering","number of credits":"2.0","prerequisites":"Nil","course type":"EPR","branch":"pie","course learning objectives":"- To introduce the basic concepts and principles of Production and Industrial Engineering.n- To demonstrate importance of Production & Industrial Engineering in present day scenario.n- To highlight the latest developments in Production and Industrial Engineering.","course content":"## UNIT InnHistory and evolution of production and industrial engineering and its applications, developments in production and industrial engineering: timeline; case studies. [3 hrs]nnn## UNIT IInnEngineering materials: metals, alloys, ceramics, composites, polymers; their properties and applications, selection criteria of materials for engineering applications, introduction to manufacturing, selection criteria of manufacturing processes, classification of manufacturing processes: additive, subtractive, formative and assembly. [8 hrs]nnn## UNIT IIInnIntroduction to industrial engineering: objectives, functions, concepts of productivity, manufacturing systems, plant layout and material handling, fundamentals of NC, CNC & DNC, product development cycle, production planning and control, quality control and reliability, work study and ergonomics. [8 hrs]nnn## UNIT IVnnLatest developments in production and Industrial engineering: advanced manufacturing processes, Rapid prototyping, Micro and nano fabrication, Green manufacturing, Lean manufacturing, SMED, usability engineering and human computer interaction [9 hrs]","course outcomes":"The students will learn about then- Basic concepts of materials and manufacturing processesn- Principles of selection of materials and manufacturing processes for engineering applicationsn- Basic concepts of industrial engineering and its applications.n- Recent development in the field of Production & Industrial Engineering.","reference books":"- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.n- M P Groover, Principles of Modern Manufacturing, Wiley.n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.n- Amitabha Ghosh & Ashok Kumar Malik, Manufacturing Science, East-West Press.n- Avraham Shtub & Yuval Cohen, Introduction to Industrial Engineering, CRC Press.n- Richard C. Vaughn, Introduction to Industrial Engineering, Lowa state University Press.n- Everett E. Adam and Ronald J. Ebert, Production and Operations Management: Concepts, Models, and Behavior, Prentice-Hall.n- Chary, Production and Operations Management, Tata McGraw-Hill Education."}
