{"course code":"PRPC-10","course title":"Thermodynamics","number of credits":"04","prerequisites":"Nil","course type":"PC","branch":"pie","course learning objectives":"- Students will understand the basic terminologies related to thermodynamicsn- Students will be able to use energy conservation law in different energy systems.n- Students will be able to make exergy analysis of different thermodynamic systemsn- Students will be able to relate different thermodynamic properties and will use them for analysis of different systems involving energy transformation","course content":"## Unit-InnConcepts of ThermodynamicsnIntroduction to basic concepts of thermodynamics, thermodynamic properties, thermodynamic equilibrium, Quasi-static process, zeroth law of thermodynamics, Temperature scales, work and heat transfer. [04hrs]nProperties of FluidsnProperties of liquids and vapours; P-V, P-T, T-S and H-S diagrams for a pure substance (water), Tables of properties, Expansion of steam, Hyperbolic , Isentropic and throttling processes; determination of dryness fraction, Properties of a perfect gas; Equation of state; Property relation for internal energy, enthalpy & heat capacities of an ideal gas, P-V-T surface, Triple point , Real gases, properties of real gases, Vander Waals equations, Properties of ideal gas mixtures.n[06hrs]nnn## Unit-IInnThe First Law of ThermodynamicsnThe First Law of Thermodynamics, PMM-I, First law for a closed system; Application of the First Law to non-flow processes viz constant volume, constant pressure, constant internal energy processes; Reversible adiabatic and reversible polytropic processes; Enthalpy, First Law as a Rate Equation, First Law Applied to a Control Volume – The SSSF AND USUF Processes, Limitations of the First Law. [10hrs]nnn## Unit-IIInnThe Second Law of ThermodynamicsnHeat source & sink, Heat engine, Refrigerator & Heat Pump, Kelvin Planck and Clausius statements of second law of thermodynamics; Reversible & Irreversible processes; The efficiency of a Carnot Cycle and introduction to absolute Temperature Scale, Clausius Inequality, Entropy, characteristics of Entropy, Entropy change for open & closed systems, Third Law of Thermodynamics, Validity & limitations of the Laws of Thermodynamics. [10hrs]nnn## Unit-IVnnAvailabilitynAvailability and the Gibbs function, Availability of a closed system, Availability of steady flow system, The Gibbs function and the steady flow system. [05hrs]nGeneral Thermodynamic RelationsnMaxwell Relations, specific heat relations, energy equations; relations involving internal energy and entropy, Joule Thomson Coefficient, Clausius Clapeyron’s equation using thermodynamic relations. [05hrs]","course outcomes":"- Students will be able to understand the different thermodynamics systems, properties of thermodynamic systems, properties of steam and thermodynamic processes.n- Students will be able to understand laws of thermodynamics and application of the laws for the analysis of different thermodynamics systems.n- Students will be able to make exergy analysis of different thermodynamic processes and cycles.n- Students will be able to derive thermodynamics relations expressing non measurable properties in terms of measurable properties.","reference books":"- Engg. Thermodynamics: Roger, GFC & Mayhew, Y.R, ELBSn- Engg. Thermodynamics: Nag, P.K., TMHn- Fundamentals of classical thermodynamics by Gordon J. Van Wylenn- Engg. Thermodynamics: Achuthan, M., TMH.n- Thermodynamics An Engineering Approach: Cengel, McGraw Hill Education; Eighth editionn- An Introduction to Thermodynamics: Rao, Y.V.C., Universities Press"}
