{"course code":"PRPC-20","course title":"Strength of Materials","number of credits":"4","prerequisites":"-","course type":"PC","branch":"pie","course learning objectives":"- To learn about the simple and compound stresses at a point in a material and its evaluation.n- To understand the concept of strain energies that forms the basis of analysis in many cases.n- To know about the shear forces, bending moments, bending stresses and shear stresses in a beam.n- To study various methods to find the deflection of beams under various load conditions.n- To study the various theories of failure of materials.n- To study torsion of shafts and to know the stresses and deflections of various types of springs.n- To learn about various types of stresses in thin cylindersn- To study Euler theory and other formulae to find the stresses in long columns and struts.","course content":"## UNIT- InnSimple Stress and StrainnConcept of stress and strain, normal and shear stresses, Hooke’s law, principle of St. Venant, Modulus of elasticity, Modulus of rigidity, stress-strain diagram, composite sections, statically indeterminate systems, temperature stresses, strain analysis, Poisson’s ratio, volumetric strain, factor of safety, tensile test diagram, elastic constants, relation between elastic constants. (5hrs)nCompound Stress and StrainnStresses on an inclined plane, principal stresses and principal planes, Mohr’s stress circle, three coplanar stresses, ellipse of stress, strain analysis, principal strains. (5hrs)nnn## UNIT- IInnShear Force and Bending Moment DiagramsnTypes of supports and beams, shear force, bending moment, relation between load, shear force and bending moment, shear force and bending moment diagrams for various types of loading and supports, maximum bending moment and point of contra flexure.n(5hrs)nStrain Energies and Theories of FailurenStrain energy, resilience, strain energy in 3-D system, shear strain energy, shear strain energy in 3-D system, stresses due to various types of loading, Different theories of failure, significance, graphical representation. (4hrs)nnn## UNIT- IIInnBending Stress in BeamsnStresses due to simple bending, moment of inertia, beams with uniform bending strength, composite or flitched beams, Shear stress distribution, Variation of shear stress in beams of various sections. (5hrs)nSlope and DeflectionnBeam differential equation, slope and deflection at a point, double integration method, Macaulay’s method, moment-area method, Castigliano’s theorem. (4hrs)nnn## UNIT- IVnnTorsionnDerivation of torsion equation and its assumptions, applications of the equation to the hollow and solid circular shafts, torsional rigidity, combined torsion and bending of circular shafts, close coiled helical springs. (4hrs) Thin Cylinders and SpheresnThin cylinders subjected to internal pressure, Circumferential and longitudinal stresses and strains, Maximum shear stress, thin spherical shells subjected to internal pressure, wire winding of thin cylinders. (4hrs)nColumns and StrutsnColumns under axial load, concept of instability and buckling, slenderness ratio, various end conditions, Euler's theory for initially straight columns, assumptions and limitations, empirical formulae. (4hrs)","course outcomes":"After studying this course, students should be able ton- Determine the values of stresses in materials under simple and compound loadingn- Draw shear force and bending moment diagrams for beams under different load conditionsn- Evaluate strain energies in materials under gradual, sudden and impact loadingn- Find shear and bending stresses in beamsn- Find slope and deflection of beams using different methodsn- Explain different theories of failuren- Find the stresses in shafts under torsionn- Find stresses in the thin cylindersn- Deduce expressions for crippling load for columns with various types of end conditions","reference books":"- G H Ryder, “Strength of Materials”, ELBS, 3rd edition, 1969n- S S Rattan, “Strength of Materials”, Tata McGraw Hill, India, 3rd Edition, 2017n- Beer P F and Johnston (Jr) E R, “Mechanics of Materials”, McGraw Hill Education, 7th edition, 2015.n- Sadhu Singh “Strength of Materials”, Khanna Publishers, 3rd edition, 2001.n- D K Singh, “Strength of Materials”, Ane Books India, 1stEdition, 2007.n- Popov E P, “Engineering Mechanics of Solids”Prentice Hall of India, New Delhi, 2nd edition, 1999."}
