{"course code":"PRPC-16","course title":"Production Technology- I","number of credits":"04","prerequisites":"Manufacturing Processes (PRPC11), Engineering Practice (MEIR11)","course type":"PC","branch":"pie","course learning objectives":"- The objective of this course is to impart fundamental knowledge and basic concept of various conventional machining operations such as turning, milling, drilling, slotting, etc. and salient features of various machine tools namely lathe, radial drilling machine, slotting machine, shaper, etc.n- The other objective of this course is to prepare the students to understand the selection criteria of conventional machining techniques.n- To learn how to interpret a tool geometry and gain knowledge regarding the various tools.","course content":"## Unit InnMetal CuttingnConcept of generatrix and directrix; Classification of machining processes: Orthogonal and oblique, machining, single point and multi-point machining; Tool geometry: Single point cutting tool geometry, specifications in different standards, selection of tool angles; Cutting tool materials, different types of cutting tools, Chip formation: Mechanism, chip types, chip control; Mechanics of single point orthogonal machining: Merchant’s circle, force, velocity, shear angle, and power consumption relations.nCutting Tool Wear and Life:nWear Mechanism, wear criterion, Taylor’s tool life equation, flank wear, crater wear, variable affecting tool life, machinability and its measures.nThermal Aspects of Machining:nCutting temperature and factors affecting it, measurement, cutting fluids and its types, selection of cutting fluids.nAnalysis of Machining ProcessesnMechanics of machining of turning, boring, shaping and planning, milling (Slab and face milling), drilling, machining time calculations of above operations.nEconomics of metal machining:nElements of machining cost, machining economics and optimization for single pass turning operation. [28 hrs]nnn## Unit IInnHole Making OperationsnIntroduction, drilling, reaming, boring, tapping, other hole making operations. [3 hrs]nnn## Unit III MillingnnIntroduction, milling machines types, milling cutters, milling operations, dividing head and indexing types, Up milling down milling, milling operations, special set-ups. [6 hrs]nnn## Unit IVnnReciprocating Machine ToolsnConstruction and working of shaper, planer, and slotter, quick-return mechanism, job holding devices. [3 hrs]","course outcomes":"After learning this course, the students will be able to:n- Develop their communication skills in oral, written and visual modes.n- Function effectively in teams and within a diverse environment.n- Understand professionalism, ethics and the associated responsibilities.n- Decide and recommend appropriate conventional machining processes for a product under given conditions and constraints.","reference books":"- Manufacturing Technology by P N Rao Vol. 2n- Principles of Modern Manufacturing by M P Groovern- Manufacturing Processes for Engineering Materials by Kalpakjiann- Manufacturing Science by Ghosh & Mallikn- DeGarmo's Materials and Processes in Manufacturing by DeGarmo, Black & Kohsern- Fundamentals of Metal Cutting and Machine Tools by G. Boothroyed."}
