{"course code":"PRPC-19","course title":"Machine Drawing","number of credits":"04","prerequisites":"ENGINEERING GRAPHICS (CEIR11)","course type":"PC","branch":"pie","course learning objectives":"The student will acquire knowledge of fastening arrangements such as welding, riveting, and the different styles of attachment for shaft. The student also is enabled to prepare the assembly of various machine or engine components and miscellaneous machine components.n- Study the conventions and rules to be followed by engineers for making accurate drawings.n- Understand the basic dimensioning practices that have to be followed in the preparation of drawings.n- Help the student in the visualization of assembly and sub assembly of various machine elements.n- Train the students in the preparation of assembly drawings","course content":"## Unit-InnFastenersnConventional representation of materials, common machine elements and parts such as Screw Threads screws, nuts, bolts, keys, cotters,. Rivets and riveted joints. Welds and welded jointsn. [7 hrs]nMachine DrawingnFree hand drawing of simple machine parts i.e. cotter joint, knuckle joint and shaft couplings, pipe fittings and pipe joints. [7 hrs]nBearingnSimple solid, bushed, pedestal, footstep bearings, I.S. conventional representation of ball and roller bearings, bracket and hangers of different types and bracket bearings, Plumber block etcn[14 hrs]nnn## Unit-IInnIntroductionnIntroduction of unit assembly drawing, Practice in drawing details and assembly of simple units.n[7 hrs]nnn## Unit-III ValvesnnFeed Check Valve, Blow off Cock, Stop Valve, Safety Valves [21 hrs]nnn## Unit-IVnnSimple Steam and I.C. Engine PartsnPistons, piston rod, cross head, stuffing box and glands, connecting rods, piston and connecting rod for I.C. engine. [10 hrs]n.nNote: Drawings should be in first angle method of projection.","course outcomes":"At the end of the course students are able to:n- Drafting their technical ideasn- Creating knowledge about the various practices with regard to the dimensioning, sectioning and development of views.n- Understanding the importance of the linking functional and visualization aspects in the preparation of the part drawingsn- Preparation of the part or assembly drawings as per the conventions.n- Interpretation of machine drawings that in turn help the students in the preparation of the production drawings and to enhance the ability to work as practicing mechanical engineers in manufacturing Industries and consulting firms.","reference books":"- Machine Drawing - N.D. Bhatt, Charotar Pubs.n- Machine Drawing - Sidheshwar, Tata McGraw-Hilln- A text book of Machine drawing - R.B. Gupta, Satya Prakasham Tech. Pub.n- Machine Drawing –K.L.Narayana, P.Kannaiah& K. Venkata Reddy / New Age/ Publishersn- Machine Drawing – P.S.Gill.n- Machine Drawing – Luzzadern- Machine Drawing – Rajput"}
