{"course code":"PRPC-27","course title":"Tool Engineering","number of credits":"4","prerequisites":"NIL","course type":"PC","branch":"pie","course content":"Course Learning Objective:n- To impart knowledge of engineering tool such as single & multi point cutting tools, jigs & fixture, dies etc. for manufacturing a product.n- To understand the various designs and planning aspect for controlling quality.nnn## UNIT-InnCutting Tool DesignnBasic concepts of single and multi-point tool geometry and tool angles, design of single point cutting tools, design of multi-point cutting tools for milling, drilling, reaming, and broaching operations, design of form tools. (9hrs)nnn## UNIT-IInnJigs and FixturesnIntroduction, difference between jig and fixture, principles of location and clamping, locating methods and devices, clamping methods and clamping devices, calculation of clamping force, Jig bushes, Types of jigs and Milling fixtures: Turning fixtures, Grinding fixtures, Boring and broaching fixtures,assembly and welding fixtures, hydraulic and pneumatic clamp actuation, indexing devices, Different Materials for jigs and fixtures, Economics of Jigs and Fixtures, drawing and design of jigs and fixtures for given components. (9hrs)nnn## UNIT-IIInnSheet metal die designnTypes of dies: Progrssive, compound and combination, Die construction: screws and dowels, die block, Punch design: Plain punches, pedestal punches, punches mounted in punch plates, perforator type punches, Quill punches, back-up plate, slug ejection, Pilots, stripper and stock guide: channel and spring stripper, Die stops: solid stop, pin stop, latch stop, pivoted auto stop, stock strip layout, component design for blanking, strip development. (7hrs)nForging die designnParting plane, draft, fillet and corner radii, shrinkage allowance, die wear allowance, finish allowance, cavities, drop forging die design: flash, stock, fullering impression, edging impression, blocking impression, finishing impression, location of impressions, Die inserts, Upset forging die design. (7hrs)nnn## UNIT-IVnnProcess PlanningnProduct cycle in manufacturing, product quality: accuracy of machining, accuracy of assembly, part print analysis: functional surfaces; tolerance stacking, errors in machining: location errors, elastic deformation of machining complex, effect of clamping force, cutting tool wear, thermal deformations; operation selection: classifying operations, eliminating operations, planning for cylindrical surfaces; Tolerance analysis.n(8hrs)","course outcomes":"- The students will be able to design different types of single and multipoint tool geometry.n- The students will be able to understand jigs & fixtures and clamping devices.n- The students will be able to understand the various operations and design of sheet metal dies.n- The students will be able to design forging die.n- The students will be able to understand the various process planning for controlling quality.nRefrence Books:n- Rodin, R., “Design and Production of Metal-Cutting Tools”,Mir Publishers, 1968n- Arshinov, V., Alekseev, G., and Weinstein, N., “Metal Cutting Theory and Cutting Tool Design”, Mir Publishers, 1976n- Bhattacharyya, A., and Ham, I., “Design of Cutting Tools”, ASTME 1969n- Hoffman, E.G., “Jigs and Fixture Design”, Thomson Delmar Learning 2003 5..Grant Hiram E, “Jigs & Fixtures”, Tata McGraw Hill,1994.n6..Curtis Mark A, “Tool Design for Manufacturing”, John Wiley & Sons,1996. 7..Donaldson Cyril, “Tool Design”, Tata McGraw Hill 1997.n8..Sharma P C, “ Production Engineering”, S Chand & Company,1997.n- Joshi, P.H., Jigs and Fixtures, TMH.n- Hinman, Press Working of Metals, McGraw-Hill.n- P.N. Rao, Manufacturing Technology, TMHn- Pandey and Singh, Production Engineering Sciences 15.ASTME: Fundamentals of Tool Design, Prentice-Halln- S.A.J. Parsons, Production tooling equipments, Macmillan, Londonn- Eary,D.P. and Johnson, G.E., Process Engineering, Prentice-Hall, 1962."}
