{"course code":"PRPC-14","course title":"Theory of Machines","number of credits":"04","prerequisites":"Engineering Mechanics (PRPC12)","course type":"PC","branch":"pie","course learning objectives":"- To understand the basic concepts of machines and mechanisms.n- To analyze the motions of various mechanisms.n- To prepare the students for dynamic analysis of machines.","course content":"## Unit-InnMechanisms and MachinesnKinematics, Dynamics: Introduction to analysis and synthesis of Mechanisms, Links, pairs, Degree of freedom in Machines and Mechanisms [5 hrs.]nVelocity and Accelerations AnalysisnVelocity determination: Relative velocity method, Instantaneous centre method Kennedy theorem. Acceleration determination by graphical method, coriole’s components of acceleration [6 hrs.]nnn## Unit- IInnClutches & BrakesnType of Clutches: Plate and Cone Clutches. Type of Brakes: external shoe brakes, band & block brakes, internal expending shoe brakes [5 hrs.]nGears and Gear TrainsnTypes of gears, gear terminology, condition for correct gearing, cycloidal and involute profiles of gear teeth, pressure angle, path of contact, arc of contact, interference, minimum number of teeth to avoid interference. Simple, compound, reverted and epicycle gear trains and their solutionsn[6 hrs.]nnn## Unit- IIInnDynamic Forces in MechanismsnDynamics of reciprocating parts, piston efforts, Crank effort, Turning moment diagram for single cylinder and multi-cylinder engines, coefficient of fluctuation of energy, coefficient of fluctuation of speed flywheel and its function. [6 hrs.]nGovernorsnType of Governor: Watt, porter, proell, spring, loaded centrifugal, inertia. Sensitiveness, stability, isochronisms, hunting, effort and power of governor [6 hrs.]nnn## Unit-IV BalancingnnStatic and dynamic balancing of rotating parts, balancing of I.C. Engines, balancing of multi- cylinder engine: V-engines and radial engines. [5 hrs.]nBelts, Ropes and ChainsnOpen and crossed belt drives, velocity ratio, slip, material for belts, length of belt tensions, centrifugal tension, power transmitted by belts and ropes, initial tension, chain drive, chain length, classification of chains. [4 hrs.]","course outcomes":"At the end of the course students will be able to:-n- Understand the common mechanisms and machinesn- Perform velocity and acceleration analysis of mechanismsn- Perform dynamic analysis of machinesn- Describe the working of different types of clutches, brakesn- Understand important gear trains and their practical applications.","reference books":"- Theory of Machines by S.S Rattan, Tata McGraw Hilln- Theory of Mechanisms and Machines by Jagdish Lal, Metropolitgan Book Co.n- Theory of Machines by Sadhu Singh, Pearson Publishern- Theory of machines by P.L. Ballaney, Khanna Publisher"}
