{"course code":"PRPC-18","course title":"Production Technology-II","number of credits":"4.0","prerequisites":"Production Technology-I (PRPC16)","course type":"PC","branch":"pie","course learning objectives":"- The objective of this course is to impart an in-depth knowledge of different manufacturing processes such as grinding, super-finishing, sheet metal working, metal forming and threading to the undergraduates.n- The other objective of this course is to prepare the students to understand the selection criteria of conventional machining techniques.n- To learn how to interpret a tool geometry and gain knowledge regarding the various tools.","course content":"## Unit 1nnOperations and applications of surface, cylindrical, centre less and internal grinding processes, dressing, truing and balancing of grinding wheels, grading and selection of grinding wheels, Mechanics of grinding, machining time calculation. Principles and applications of honing, super finishing, lapping, polishing, buffing, peening, and burnishing. [11 hrs]nnn## Unit 2nnIntroduction, classification of presses, shearing action, cutting forces, clearance and its effect, shear, angular clearance, stripper, center line of pressure and its mathematical calculation. Die materials, Die types, construction details of die set, auxiliary equipment, safety devices. Lathes: Centre, Capston and Turret. Universal Bar equipment, tool layout for simple parts. Automatic lathe: Introduction, classification, tooling layout. [12 hrs]nnn## Unit 3nnPlastic deformation and yield criteria, relationship between tensile and shear yield stresses, Friction conditions in metal working, Analysis of forming processes: Rolling, forging, wire drawing, extrusion, temperature and lubrication aspect in metal forming, forming defects. [12 hrs]nnn## Unit 4nnIntroduction; applications of screw threads, threads terminology, classification, methods of thread manufacturing: casting, thread cutting: single point & multi point tools, thread rolling, die threading, thread milling, thread grinding and tapping, calculation of blank size. [8 hrs]","course outcomes":"By the end of this course, the student will have the:n- Knowledge of various types of grinding and super-finishing operations. The students will be able to select proper grinding wheels and processes for particular material.n- Knowledge of sheet metal operations, die-design and proper selection of dies for required product.n- Knowledge of detailed analysis of metal forming processes, temperature and lubrication aspects in metal forming to minimize the energy losses and wear of equipments used for metal forming.n- Knowledge of different methods for thread production as per the requirements.","reference books":"- DeGarmo, E. P., Black, J.T., and Kohser, R.A., “Materials and Processes in Manufacturing”, Prentice-Hall of India.n- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.n- Groover, M.P., “Fundamentals of Modern Manufacturing”, John Wiley & Sons.n- Lindberg, R.A., “Processes and Materials of Manufacture”, Prentice-Hall of India.n- Boothroyed, G. et al., Fundamentals of Metal Cutting and Machine Tools, McGraw Hill.n- Rao,P.N., “Manufacturing Technology”, Vol 1 & 2, Tata McGraw-Hill.n- Ghosh and Mallik, “Manufacturing Science”, E.W. Press.n- Pandey and Singh,“Production Engineering Science”.n- Avitzur, B., “Metal Forming: Processes and Analysis”, Mc-Graw Hill."}
