{"course code":"PRPC-26","course title":"Non-Conventional Manufacturing Processes","number of credits":"4.0","prerequisites":"Production Technology- II (PRPC18)","course type":"PC","branch":"pie","course learning objectives":"- To understand the basic concepts of Non-conventional machining processes.n- To understand the principle and material removal mechanism of various Non-conventional machining processes.n- To study the effect of various process parameters on the process outcomesn- To understand the application of Non-conventional machining methods in various fieldsn- To understand the basic concepts of Rapid prototyping and rapid tooling processes.","course content":"## Unit-I IntroductionnnUnconventional machining processes, Rapid prototyping processes, their classification, considerations in process selection. [3 hrs]nnn## Unit-IInnUltrasonic MachiningnElements of process, design of cutting tool, metal removal mechanism, effect of parameters, economic considerations, limitations and applications, surface finish. [3 hrs]nnn## Unit-IIInnElectrochemical MachiningnElements of process, process chemistry, metal removal mechanism, tool design, accuracy, surface finish and work material characteristics, economics advantages, limitations and applications, Electrochemical grinding, deburring and honing, Chemical machining. [6 hrs]nnn## Unit-IVnnElectric Discharge MachiningnPrinciple and mechanism of metal removal, generators, electrode feed control, electrode material, tool electrode design, EDM wire cutting, surface finish, accuracy and applications. [6 hrs]nnn## Unit-VnnJet MachiningnPrincipal and metal removal mechanism of abrasive and water jet machining, process variables, design of nozzle, advantages, limitations and applications. [4 hrs]nnn## Unit-VInnOther Machining ProcessesnPlasma arc machining, Electron beam machining, laser beam machining, their principles and metal removal mechanism, process parameters, advantages and limitations, applications. [4 hrs]nnn## Unit-VIInnRapid Prototyping ProcessesnFundamentals, process chain, physics of processes, principles and process mechanism of SLA, SGC, LOM, FDM and SLS processes, their advantages and limitations, applications of RP processes, RP data formats, STL file format, STL file problems, STL file repair, other translators and formats. [7 hrs]nnn## Unit-VIIInnRapid Tooling ProcessesnIntroduction, fundamentals, classification, indirect RT processes, Principles of Silicone Rubber Molding, Epoxy Tooling, Spray Metal Tooling, Pattern for Investment Casting, Vacuum Casting, and Vacuum forming processes, direct RT processes, Shape Deposition manufacturing, their advantages, limitations and applications. [7 hrs]","course outcomes":"At the end of the course, student will be able ton- Explain the principle of working and mechanism of material removal of the various Non- conventional machining processesn- Classify and compare the various non-conventional machining processesn- Select suitable Non-conventional machining process for processing a particular materialn- Decide optimum process parameters for the respective Non-conventional machining processn- Explain the basic concepts of Rapid prototyping and rapid tooling processes.","reference books":"- Modern machining processes by P.C. Pandey and H.S. Shan, TMH.n- Machining Science by Ghosh and Mallik, Affiliated East Westn- Nontraditional Manufacturing processes by G.F. Benedict, Marcel Dekker.n- Non-Conventional Machining, P. K. Mishra, Narosa Publicationn- Manufacturing Processes and Systems, P. F. Ostwald, J. Munoz, John Wiley Sons.n- Advanced Machining Processes, H El-Hofy, McGraw Hill Publicationn- Advanced Methods of Machining by J.A. McGeongh, Chapman and Hall.n- Electrochemical Machining of Metals by Rumyantsev and Davydov, Mir Publis.n- Rapid prototyping: Principles and applications in Manufacturing, Chee Kai Chua, Kah Fai Leong, World Scintific Publishing"}
