{"course code":"PRPC-23","course title":"Production Planning and Control","number of credits":"4.0","prerequisites":"Production Technology-II (PRPC18)","course type":"PC","branch":"pie","course learning objectives":"This subject provides students with:-n- An understanding of the concepts of production and service systems.n- The ability to apply principles and techniques in the design, planning and control of these systems to optimise/make best use of resources in achieving their objectives.n- The ability to identify different strategies employed in manufacturing and service industries to plan production and control inventory.n- To measure the effectiveness, identify likely areas for improvement, develop and implement improved planning and control methods for production systems.","course content":"## Unit-InnIntroduction, functions of production planning and control, objectives of PPC, importance of PPC, preplanning, production planning, production control, other components of PPC, simplification and standardization, time and motion study. [4 hrs]nManufacturing SystemnProduction system, Job production, Batch production, continuous production, size of plants, type of industry. [3 hrs]nnn## Unit-IInnIntroduction to MRP and JITnIntroduction, MRP concept , inputs to MRP , working of MRP, MRP outputs, MRP calculations, lot sizing in MRP, MRP-II, concept of JIT manufacturing system, characteristics, goal and elements of JIT, push and pull production system. [4 hrs]nSupply chain managementnIntroduction and overview of SCM, concept of supply chain, value creation in supply chain, value chain models, supply chain activities, SCM business process integration, strategic consideration for supply chain, distribution, logistics engineering, inbound and out bound logistics. [4 hrs]nnn## Unit-IIInnSales forecastingnIntroduction, definition, objectives and importance of forecasting, need for forecasting, types of forecasting, process of sales forecasting, factors affecting forecasting, criteria for a good sale, forecasting techniques: casual and time series analysis, moving average, exponential smoothing. Trend and seasonality. [6 hrs]nInventory ControlnDefinition, classification, objectives of inventory control, functions, economic order quantity, deterministic and probabilistic inventory models. Numerical on inventory control. Inventory carrying costs, factors affecting inventory costs. V.E.D. analysis, S-D-E analysis, F-S-N analysis H-M-L analysis and ABC analysis. Safety stocks, their objectives safety stocks and service levels. [8 hrs]nnn## Unit-IVnnProject scheduling with CPM and PERTnIntroduction, objectives and applications of network analysis, basic concept in networks, difference between CPM and PERT, network conventions, numbering of events (Fulkerson’s rule), determination of critical path, optimizing through CPM, PERT, resources allocation.n[8 hrs]nLoading and SchedulingnIntroduction, Scheduling Procedure, Master Schedule, its objectives, Order scheduling, Loading by scheduled period, Dispatching, Job card, Job order. Commercial Loading & Scheduling Devices. [5 hrs]","course outcomes":"Upon completion of the subject, students will be able to-n- Apply the systems concept for the design of production and service systems.n- Make forecasts in the manufacturing and service sectors using selected quantitative and qualitative techniques.n- Apply the principles and techniques for planning and control of the production and service systems to optimize/make best use of resources.n- Understand the importance and function of inventory and to be able to apply selected techniques for its control and management under dependent and independent demand scenerios.","reference books":"- Production Planning and control: Samuel Eilonn- Production Planning and Control: K.C. Aggarwal & K.C. Jainn- Industrial Engg. & Operation Management by S.K. Sharma & Savita Sharma.n- Production Planning and Control: King J.R.n- Production Planning and Control: Sharma, Hari Rraghu Rama."}
