{"course code":"PRPC-13","course title":"Fluid Mechanics & Machines","number of credits":"4","prerequisites":"Engineering Mechanics (PRPC12)","course type":"PC","branch":"pie","course learning objectives":"- To familiarize with the properties of fluids and the applications of fluid mechanics.n- To familiarize with the conservation principles of mass, momentum and energyn- To understand basic principles of fluid flow applicable to fluid machines.","course content":"## UNIT InnIntroductionnFluid, properties of fluid, Metacentric height, Buoyancy, Stability. Fluid Statics: Fluid pressure, Pascal’s law, general equation of fluid statics, pressure head of a fluid, simple and differential manometers, mechanical gauges. [10 hrs]nnn## UNIT IInnFluid KinematicsnLagrangian and Eulerian methods, types of flow, velocity and acceleration, continuity equation (cartesian co-ordinates), stream function, velocity potential function, flow nets, types of motion: linear translation, linear deformation, angular deformation and rotation. Fluid Dynamics: Euler’s equation, Bernoulli’s equation, energy equation, practical applications of Bernoulli’s equation in venturimeter, orifice meter and pitot tube. Reynold’s experiments. [10 hrs]nnn## UNIT IIInnPrinciples of Hydraulic MachinesnImpact of jet on stationary and moving flat and curved plates, forces on series of vanes, radial vanes. Hydraulic Turbines: Introduction, development of hydraulic turbines, classification of turbines. Turbines: Pelton, Francis, Propeller, Kaplan; working and essential components of these turbines. [10 hrs]nnn## UNIT IVnnHydraulic PumpsnCentrifugal pumps: working and its various components, classification, losses and efficiencies. Reciprocating pumps: working and its various components, classification, comparison with centrifugal pumps, air-vessels. Hydraulic Systems: Hydraulic accumulator, hydraulic intensifier, hydraulic lift, hydraulic crane, hydraulic coupling, torque converter, hydraulic ram. [10 hrs]","course outcomes":"At the end of the course student will be able ton- Identify and obtain the values of fluid properties and relationship between them and understand the principles of continuity, momentum, and energy as applied to fluid motionsn- Apply the conservation principles of mass, momentum, and energy to fluid flow systemsn- Apply the basic principles, the laws, and the pertinent equations to engineering design of the fluid machines for required applications.","reference books":"- Fox, McDonald and Pritchard, Fluid Mechanics, Wiley, 8th Edition, 2013n- Yunus A. Cengel and John M. Cimbala, Fluid Mechanics: Fundamentals and Applications, McGraw Hill-Education, 3rd Edition, 2014n- S. K. Som, G. Biswas and S. Chakraborty, Introduction to Fluid Mechanics and Fluid Machines, McGraw Hill-Education, 3rd Edition."}
