{"course code":"PRPC-15","course title":"Material Science","number of credits":"04","prerequisites":"Nil","course type":"PC","branch":"pie","course learning objectives":"- To develop an understanding of the mechanisms of plastic deformation, work hardening along with various other strengthening mechanisms and also to understand the correlation between crystal structure and the macroscopic mechanical properties of engineering materials.n- To understand the various failure mechanisms (fracture, fatigue and creep) and the factors affecting failure.n- To learn how to interpret a phase diagram and gain knowledge regarding the various heat treatment processes.n- To understand the properties of ceramics and the various steps involved in powder metallurgy technique.","course content":"## Unit InnPlastic DeformationnTypes of defects in crystals- point, line and surface defects, deformation by slip, slip planes, twinning, mechanical and annealing twins, dislocation- edge and screw dislocation, critical resolved shear stress, dislocation loop, energy of dislocation, force on dislocation, stress field around dislocation, dislocation motion, perfect, extended and sessile dislocation, jogs, dislocation density, Frank Read source, dislocation pile-up, interaction between dislocation and vacancies.nWork HardeningnWork hardening of single crystal and polycrystalline materials, mechanism of work hardening, work softening, Bauschinger’s effect, grain boundaries, its effect on crystal and on strength, grain size, low angle grain boundaries, polygonization, solid solution hardening, yield point phenomenon, strain aging, dispersion of second phase particles, preferred orientation, recovery and its mechanisms, recrystallization - mechanisms and laws, grain growth, hot working and cold working and their effects on mechanical properties. [10 hrs]nnn## Unit II FailurennIntroduction, theories of failure, stress concentrationnFracturenIntroduction, types fracture, theoretical cohesive strength of metals, Griffith's theory of brittle fracture and its modification, stages in development of ductile fracture, methods of fracture protection.nCreepnCreep test, creep curve, creep curve equations, creep curve at constant temperature, stress- rupture test, effects of metallurgical variables on creep, creep mechanisms.nFatiguenIntroduction, factors to cause fatigue failure, stress cycles, S-N curve, fatigue test, theories of fatigue-Orowan theory, fatigue limit theory, Wood's theory and dislocation movement theory, effect of stress concentration on fatigue, size effects, corrosion fatigue, fretting, low temperature and high temperature fatigue.nElastic Wave PropagationnOne-Dimensional Wave Equation and Motions of an Elastic Material, Compression waves, Shear waves, Reflection and transmission at an interface. [16 Hrs]nnn## Unit IIInnPhase DiagramsnIntroduction, plotting of binary diagram, equilibrium cooling of an alloy, solid solutions, eutectic, eutectoid and peritectic systems, Iron-Iron carbide (Iron carbon) equilibrium diagram- various phases present, various reactions involved, critical points, explanation of Iron carbon diagram; phase rule.nHeat TreatmentnTTT diagram, pearlite transformation and bainite transformation, continuous cooling and TTT diagram- transformation of austenite, factors affecting critical cooling rate, heat treatment processes- annealing, normalizing, spheroidizing, hardening and tempering, austempering, martempering, precipitation hardening, case hardening- carburising, nitriding, cyaniding, flame hardening, induction hardening. [10 hrs]nnn## Unit IVnnCeramics and Powder MetallurgynClassification of ceramic materials, ceramic and non- ceramic materials, mechanical and magnetic properties of ceramics, classification and properties of composite materials, whiskers and whisker composites, various methods of preparations of raw powders, blending, compacting, sintering, finishing operations-sizing, impregnation, infiltration, advantages and disadvantages, typical applications of powder metallurgy. [10 hrs]","course outcomes":"The students will learn about:n- The mechanisms of plastic deformation, work hardening and the basic principles pertaining to various other strengthening mechanisms.n- Failure analysis.n- Information given by a phase diagram and various heat treatment techniques.n- Advancements in ceramic technology and powder metallurgy.","reference books":"- Material Science and Engineering - V. Raghavan, Prentice Halln- Materials Science and Engineering An Introduction - W.D. Callister, John Wileyn- Mechanical Behaviour of Materials - McClontock & Argon, Addison-Wesleyn- Mechanical Behaviour of Materials - Courtney, McGraw-Hilln- Mechanical Metallurgy-Dietern- 'Introduction to Elastic Wave Propagation' by A. Bedford & D. S. Drumheller"}
