{"course code":"PRPC-21","course title":"Operations Research","number of credits":"4","prerequisites":"NIL","course type":"PC","branch":"pie","course learning objectives":"Operations research has many applications in science, engineering, economics, and industry and thus the ability to solve OR problems are crucial for both researchers and practitioners. Being able to solve the real life problems and obtaining the right solution requires understanding and modeling the problem correctly and applying appropriate optimization tools and skills to solve the mathematical model.nThe goal of this course is to-n- Give a glimpse of the need of Operations research, its objectives, methodology and different OR modelsn- Teach the students to formulate, analyze, and solve mathematical models that represent real-world industrial problems.n- Make students enable to understand real world optimization problems and the basics of OR techniques such as linear programming, specific applications of LP such as transportation model, assignment model etcn- Make students understand the decision making under conditions of uncertainly and risk","course content":"## Unit-InnIntroductionnDevelopment of operations Research, characteristics and scope of operations research in management, Models in operations research, Model formulation, Types of mathematical models, limitations of operations Research. [4 hrs]nLinear programmingnL.P. models, simplex method, the algebra of simplex method. (Minimization and Minimization problems). The big M method, post optimality analysis, essence of duality theory, application of sensitivity analysis. [8hrs]nnn## Unit-IInnTransportation and AssignmentnIntroduction to Model, matrix terminology, formulation and solution of Transportation model (least cost method, Vogel’s Approximation method), least time transportation problem, assignment problems. [6 hrs]nDecision AnalysisnSteps in decision theory approach, Decision making environment, Decision making under certainty and uncertainty, Decision making under conditions of risk, Decision trees, Advantages and limitations of decision tree solutions, post-optimality analysis. [8 hrs]nnn## Unit-III SimulationnnIntroduction, applications of simulation, advantages and limitations of simulation technique. generation of random numbers, Time-flow mechanism, simulation languages. [4 hrs]nQueuing TheorynIntroduction, Applications of queuing theory, Waiting time and idle time costs, single channel queuing theory and multi channel queuing theory with Poisson arrivals and exponential services, Numerical on single channel and multi channel queuing theory. [6 hrs]nnn## Unit-IVnnGame TheorynTheory of games, competitive games, Rules and Terminology in game Theory, Rules for game theory- saddle point, dominance , mixed strategy (2 x 2 games), mixed strategy ( 2x n games or m x 2 games), mixed strategy (3 x 3 games), two person zero sum games, n –person zero sum games. [4 hrs]","course outcomes":"Upon completion of this course, students will be able to:n- Formulate a real-world industrial problem such as product mix problem, blending problem or portfolio management problem as a mathematical programming model.n- Apply the theoretical workings of the simplex method for linear programming and perform iterations of it by hand.n- Make decisions under conditions of risk and certainty and construct the multistage decision problem in the form of a decision treen- Solve specialized linear programming problems like the transportation and assignment problems, network models like the shortest path, minimum spanning tree, and maximum flow problems","reference books":"- Introduction to Operation Research by Hiller and Lieberman, McGraw-Hill.n- Operations Research by P.K. Gupta and D.S. Hira, S. Chand Publishers.n- Operations Research: An Introduction by Hamady A. Taha, Pearson."}
