{"course code":"PRPC-28","course title":"Work Study and Ergonomics","number of credits":"4.0","prerequisites":"Nil","course type":"PC","branch":"pie","course learning objectives":"- To understand the basic concepts of production and productivity and to study the methods of productivity improvement.n- To understand the main concepts of Work Study and apply them to know about the practical aspects of Industrial World.n- To inculcate the skills among the students for analysing and improving existing methods of working on the shop floor of an organisation.n- To impart thorough knowledge to the students with respect to allowances, rating, determination of basic and standard time for various operations in an organisation.n- To understand the basic concepts of Ergonomics and to apply them in real work environment.","course content":"## UNIT InnProductivitynConcept and definition, Difference between production and productivity, Reasons for low productivity, factors influencing productivity, productivity measures, measurement models, methods/techniques to improve productivity, work-study and productivity, Work content [5 hrs]nnn## UNIT IInnIntroduction to Work-StudynImportance, Human considerations in work-study Relationship of work-study man with management, supervisor & workers, qualities of a work-study man. [8 hrs]nnn## UNIT IIInnMethod-StudynDefinition, objectives, step-by-step procedure, questioning techniques, charts and diagrams for recording data. outline process charts, flow process charts, multiple activity charts, two handed process chart, string diagram, travel chart, cycle graph, Chrono-cycle graph, Therbligs, Micro motion study and film analysis, SIMO chart, Principles of motion economy, development and installation of new methods. [10 hrs]nnn## UNIT IVnnWork–MeasurementnDefinition, various techniques of work-measurement work-sampling, stop-watch time study & its procedure, Job selection, Equipment and forms used for time study, rating, methods of rating, allowances and their types, work sampling, normal time, standard time, numerical problems,nPredetermined Motion Time System and its types, Work Factor System, Method Time Measurement and Basic Motion Time. [10 hrs]nnn## UNIT VnnErgonomicsnIntroduction, history of development, objectives, man-machine system and its components, design of Man Machine Systems, introduction to structure of the body- features of the human body, stress and strain, metabolism, measure of physiological functions- workload and energy consumption, biomechanics, types of movements of body members, strength and endurance, speed of movements, Applied Anthropometry - types, use, principles and applications, design of work place and seat design, visual displays for static information, visual displays of dynamic information, auditory, tactual and olfactory displays and controls, effect of vibration, noise, temperature and illumination on performance. [12 hrs]","course outcomes":"At the end of the course, student will be able ton- Understand the production and productivity concepts.n- Understand the Work Study concepts and their applications.n- Understand and apply the method study procedure tools and techniques.n- Analyse the Predetermined Motion Time System, Work Factor System, Method Time Measurement and Basic Motion Time.n- Understand the prime concepts of Ergonomics and its significance in relation to the design of work place and controls etc.","reference books":"- Barnes Ralph M., Motion & Time study: Design and Measurement of Work, Wiley Text Books, ed. 7th, 2001.n- Marvin E, Mundel & David L, Motion & Time Study: Improving Productivity, Pearson Education, 2000.n- Benjamin E Niebel and Freivalds Andris, Methods Standards & Work Design, McGraw Hill, 2013.n- International Labour organization, Work-study, Oxford and IBH publishing company Pvt. Ltd., New Delhi, 2001.n- Sanders Mark S and McCormick Ernert J, Human Factors in Engineering and Design, McGraw-Hill Inc., 1993.n- Sharma S K and Sharma Savita, “Work Study and Ergonomics”, S K Kataria & Sons., Delhi, 2014."}
