{"course code":"PRPC-25","course title":"MACHINE DESIGN","number of credits":"04","prerequisites":"Strength of Materials (PRPC20), Theory of Machines (PRPC14),","course type":"PC","branch":"pie","course learning objectives":"- To understand the behavior of a machine component subjected to different loads and recognizing the failure criterion.n- To identify the stresses induced in a machine component and design it to avoid failure using theories of failure.n- Apply design methods for mechanical components such as gears, springs to meet the required criteria, along with strength requirements.n- Apply engineering principles to open ended design problems.","course content":"## Unit-InnBasics Concepts & Design for StrengthnDesign methodology, Design criterion based on fracture, deformation and elastic stability, design stress, factor of safety Selection of Engineering Materials, Theories of Failure [4 hrs]nStress concentration, causes and mitigation, Endurance limit, Notch sensitivity, Factors affecting endurance limit, Design for finite and infinite life. Soderberg and Goodman diagram. [4hrs]nnn## Unit-IInnDesign of Joints:nRiveted joints for boiler shell according to I.B.R., riveted structural joint and riveted joint with eccentric loading. Types of welded joints, strength of welds under axial load, welds under eccentric loading. Designation of various types of bolts and nuts. Design of bolted joints, bolts of uniform strength. Bolted joints with eccentric loads. [5 hrs]nnn## Unit-IIInnDesign of Shaft, Keys and Couplings:nDesign of shafts subjected to pure torsion, pure bending load. Combined bending and torsion, combined torsion, bending and axial loads. Design of keys, Types of shaft couplings. Design of sleeve or muff coupling, flange coupling and bush type flexible couplings. [5 hrs]nnn## Unit-IVnnDesign of Mechanical Springs:nIntroduction, Helical springs: stress analysis, deflection analysis, spring materials, styles of ends. Design against static and fluctuating loads: Design of leaf springs [6 hrs]nnn## Unit-VnnDesign of Gears:nIntroduction: spur gear, helical gear. Calculation of load carrying capacity, design of spur and helical gears for dynamic and wear loads, bearings reactions [6 hrs]nnn## Unit-VInnDesign of Bearings:nIntroduction, Classification of bearings, selection of bearings, sliding contact bearings. types, materials, lubricants, properties of lubricants, hydrodynamic lubrication and design of hydrodynamic journal bearing: Rolling contact bearings: types, selection of rolling contact bearings and comparison of rolling and sliding contact bearing. [6 hrs]","course outcomes":"At the end of the course student will be able ton- Apply and implement design conceptsn- Design a machine component to meet strength requirementsn- Identify the failure modes and design the components like gears, springs etc.","reference books":"- Shigley, J.E., and Mischke, C.R., Mechanical Engineering Design, McGrawHill International Editions, New York, Edition VI, 2003n- V B Bhandari, Design of Machine Elements, 2nd Ed., Tata Mcgraw Hill, 2007.n- Design Data Book of Engineers, Compiled by Faculty of Mechanical Engineering, PSG College of Technology, Publisher KalaikathirAchchagam, Coimbataore, 2009.n- M.F Spotts, T.E Shoup, L.E. Hornberger, S.R Jayram, and C. V. Venkatesh, Design of Machine Elements, 8th Ed., Person Education, 2006n- Paul H Black and O. E. Adams, P., Machine Design, 3/e, Mc Graw Hill Book Company, Inc., New York, USA., 2007.n- R. C Juvinall and K. M Marshek, Fundamentals of Machine Component Design, 3rd Ed., Wiley Student Edition, 2007.n- Robert L. Norton,Machine Design – An Integrated Approach, Prentice-Hall Inc.n- V B Bhandari, Machine Design Data Book"}
