{"course code":"PRPC-29","course title":"Quality Control and Reliability","number of credits":"4","prerequisites":"Production Technolgy- II (PRPC18), Production Planning and Control (PRPC23)","course type":"PC","branch":"pie","course learning objectives":"- To understand the fundamentals of Quality, Economics of Quality and T.Q.M.n- To understand the basic statistical concepts, decision preparatory of the control charts,their applications and Process Capability Behaviour.n- To understand the concepts of Acceptance Sampling, Sampling Plans and their applications.n- To understand the Reliability and its relationship with Availability and Maintainability.","course content":"## UNIT- InnIntroductionnQuality – Basic Concepts: Issues in Quality, factors affecting quality, creating quality by design, product development cycle, economics of quality, Various definitions, ISO definition of quality and its meanings, and various phases till TQM and its meaning to industries, customers and employees, contribution of quality gurus etc. towards quality concepts. Total Quality management: its scope application and implementation. Quality circle: its objectives, structure and techniques, Variability concept in manufacturing –cycle, fishbone diagrams, charts in time philosophy. [8 hrs]nnn## UNIT -IInnQuality ControlnBasic statistical concepts, various types of distributions, General theory X and R chart. Decision preparatory to the control charts. Trial control limits. Selection of sub-groups. Charts with variable subgroups. Reject and Revoke, limits for average on X charts, modified control limits, specification limits, practical limitations. Control charts for fraction defectives, calculation and plotting of control limits, sensitivity of p chart, applications, and Control charts for Defects, difference between defect and defective, calculation and plotting of control limits, application. Pi charts and u charts, plotting of charts. Tests for various control charts. Tests for various control charts, process capability- inherent and potential capability. [12 hrs]nnn## UNIT- IIInnAcceptance SamplingnPurpose, Acceptance by Attributes, single sampling plans. O.C. curve selection of sampling plans, Acceptance number, Type A and Type B errors, O.C. curves, Double sampling plan and its analysis, Multiple and sequential sampling , A.O.Q.L., Acceptance sampling plans under risk. Design of various sampling plans, Dodge- Roming type system for acceptance sampling bynattributes (use of various tables). Determination of process average, Acceptance sampling by variables. [10 hrs]nnn## UNIT- IVnnReliabilitynConcepts of Reliability, factors affecting Reliability, pattern of Failure, Mean Time to Failure, Fundamental of Statistical Concepts, consideration of Reliability in Series and Parallel System, effect of Redundancy and Reliability, method of Reliability Evaluation, Reliability Optimization, Availability and Maintainability, means to improve Reliability, Reliability Control during manufacture. [10 hrs]nCourse Learning Outcomes:n- Students will be able to understand the fundamentals of Quality, Economics of Quality and T.Q.M.n- Students will be able to understand the basic statistical concepts, decision preparatory of the control charts their applications and Process Capability Behaviour.n- Students will be able to understand the concepts of Acceptance Sampling, Sampling Plans and their applicationsn- Students will be able to understand the Reliability and its relationship with Availability and Maintainability","reference books":"- Statistical Quality Control by Grant and Leaven, Mc Graw-Hill.n- Quality Control and Reliability by Mahajan, Dhanpat Rai.n- Quality Control by Hansen, Prentice-Hall.n- Statistical Quality Control, a modern introduction by Douglas C. Montgomery.n- Elementary Statistical Quality Control, 2nd Edition - CRC Press Book By. John T. Burr.n- Total Quality Management – An Integrated Approach Paperback – 2016 by DR. Kirann- Handbook of Reliability Engineering and Management Book by Clyde F. Coombs Jr. and William Grant Ireson.n- Practical Reliability Engineering Book by Patrick D. T. O'Connor.n- Maintenance, Replacement, and Reliability: Theory and Applications, Second Edition.Book bynA. K. S. Jardine and Albert H. C. Tsang.n- Reliability Engineering Book by A.K. Goel."}
