{"course code":"PRPC-17","course title":"Thermal Engineering","number of credits":"4","prerequisites":"Thermodynamics (PRPC10)","course type":"PC","branch":"pie","course learning objectives":"- To integrate the concepts, laws and methodologies from the first course in thermodynamics into the analysis of cyclic processes.n- To apply the concepts of thermodynamics to various thermal applications such as IC engines, steam nozzles and turbines.n- To understand the working of SI and CI engines.n- To apply the concepts of thermodynamics to refrigeration and air-conditioning systems.","course content":"## Unit InnOverview of thermodynamicsnThermodynamic system, thermodynamic properties, thermodynamic equilibrium, quasi-static state, Zeroth law of thermodynamics, work and heat, First law of thermodynamics for a closed system, non-flow process, steady flow energy equation, Second law of thermodynamics, Concept of entropy. [3 hrs]nnn## Unit IInnSteam Generation and PowernBoilers: Introduction, Classification of boilers, Fire tube and water tube boilers, boiler mountings and accessories, Natural draught and artificial draught.nSteam Nozzle: Function, Steady flow energy equation, Nozzle efficiency, Critical pressure ratio. Steam Turbine: Introduction, Classification of steam turbines, Impulse and Reaction turbines, working principle, velocity diagrams. [13 hrs]nnn## Unit IIInnInternal Combustion EnginesnIntroduction, Classification, cycle of operation in four stroke and two stroke I.C. engine, Valve timings, Otto cycle, Diesel cycle, Brayton cycle, Dual cycle, Comparison between these cycles, Air standard efficiency, specific work output, work ratio and mean effective pressure (with simple numerical problems).nCombustion in SI Engines, stages of combustion, abnormal combustion, Octane rating Combustion in CI engines, stages of combustion, delay period, knock, Cetane ratingnFuel injection and Ignition systems, Lubrication and cooling, Engine Performance [14 hrs] Unit IVnRefrigeration & Air –conditioningnIntroduction, Carnot refrigeration and heat pump, COP of refrigerator and heat pump, vapour refrigeration system.nAir Refrigeration: Basic principle of operation of air refrigeration, Bell Coleman Air refrigerator. Simple Vapour Compression Refrigeration System.nIntroduction to air conditioning systems, Difference in air conditioning and refrigeration, Psychrometric properties of moist air (wet bulb, dry bulb, dew point temperature, relative and specific humidity), winter and summer air-conditioning systems, Room sensible heat factor.n[10 hrs]","course outcomes":"Upon the completion of this course the students will be able ton- Apply thermodynamic concepts to boilers and steam turbines.n- Solve problems related to different air standard cycles.n- Explain the functioning and features of IC engines, components and auxiliaries.n- Calculate performance parameters of Refrigeration and Air-conditioning systems.","reference books":"- Thermal Engineering by Ballaney, Khanna Publishern- Steam and gas Turbine by R. Yadav, CPHn- Internal Combustion Engines by Mathur & Sharma, Dhanpat Rai& Sonsn- Internal Combustion Engine by Ganesan, TMHn- Refrigeration and Air Conditioning by C.P.Arora, TMHn- Refrigeration & Air Conditioning by Arora & Domkundwar, Dhanpat Rai & Sons"}
