{"course code":"PRPC-24","course title":"Metrology","number of credits":"4.0","prerequisites":"Production Technology- II (PRPC18)","course type":"PC","branch":"pie","course objectives":"- To educate students on different measurement systems and different types of errors identified.n- To introduce measuring equipment for linear and angular measurements.n- To familiarize students with roundness, surface roughness, screw, threads and gear elements on inspection machines.","course content":"## Unit -InnMeaning of Metrology, Objectives of Metrology, Necessity and Importance of Metrology, Precision Measurement –Its need. Limits, Fits and Tolerance, Classification of Measuring Instruments, Classification of Methods of Measurements.nDefinitions, Classification of Measuring Equipments, Principles of Mechanical Measuring Instruments, Principles of Optical Instruments -Reflection, Refraction, Lenses, Interference, Optical prisms & Optical projectors, Principles of Electrical Measuring Instruments, Principles of Pneumatic Measuring Instruments. [10 hrs]nnn## Unit -IInnCalipers, Vernier Calipers, Vernier Height Gauge, Vernier Depth Gauge, Micrometers - Description of micrometer, types of micrometers, Advantages and Limitations of commonly used Precision Instruments.nAngular Measurements, Introduction, Instruments for Angular Measurement -Protractors, Sine bars, Sine table, Sine center, Angle gauges, Spirit level & Clinometers, Taper Measurement - Gauges for Tapers, Taper Measuring Instruments. [10 hrs]nnn## Unit-IIInnIntroduction, Classification of Threads, Elements of Screw Threads, Specifications of screw Thread, Measuring Elements of a Screw thread, External Screw Thread Measurements, Internal Screw Thread Measurements, Screw Thread Gauges.nIntroduction, Types of Gears, Methods of making Gears, Forms of Gear Teeth, Involutes curve, Gear Tooth Terminology, Measurement of Tooth thickness, Measurement of Tooth Profile, Measurement of pitch.nCircularity, Roundness and Circularity, Measurement of Circularity-Devices Used, V-block and dial indicator, Precision measuring instruments, Measurement of Roundness of Machined Shafts.n[10 hrs]nnn## Unit- IVnnThe Comparator, Desirable Features of a Comparator, Use of Comparators, Types of Comparators, Mechanical Comparators -Dial Indicator, Optical Comparators, Electrical and Electronic Comparators, Pneumatic Comparators, Limit Gauges, Toolmaker’s Microscope. Methods of Measuring Surface Finish, Profile Projector, Combination set, Surface Plate, and Miscellaneous Gauges. [10 hrs]","course outcomes":"- Students will have the knowledge of various equipments needed for precise measurement in the industries.n- Students will be able to work in quality control and quality assurances divisions in industries.n- Students will be able to maintain quality in engineering products.","reference books":"- A.K. Bewoor & V.A. Kulkarni, “Metrology and Measurements”, McGraw Hill Education.n- N.V. Raghvendra & L. Krishnamurthy, “Engineering Metrology and Measurements”, Oxford Higher Education.n- O.P.Khanna, “Metrology and Instrumentation”, Dhanpat Rai Publications.n- M. Mahajan, “A Text Book of Metrology”, Dhanpat Rai Publications.n- R.K. Jain, “Engineering Metrology”, Khanna Publications."}
