{"course code":"PRPC-12","course title":"Engineering Mechanics","number of credits":"4","prerequisites":"NIL","course type":"PC","branch":"pie","course learning objectives":"- Comprehensive, theory based understanding of the underpinning natural and physical sciences and the engineering fundamentals applicable to the engineering discipline.n- In-depth understanding of specialist bodies of knowledge within the engineering disciplinen- Application of established engineering methods to complex engineering problem solvingn- Application of systematic engineering synthesis and design processes.","course content":"## Unit-InnComposition and Resolution of ForcesnIntroduction, Resultant of two forces which are not parallel, resolution of a single force into components, a graphical method of determining the resultant of a system of coplanar forces, principle of triangular of forces, Lami’s theorem.nFrictional resistance, angle of friction, angle of repose, laws of friction, cone of friction, equilibrium of a body on a rough inclined plane. [8 hrs]nnn## Unit-IInnCentre of Gravity and Moment of InertianCentre of gravity, moment of an area, centroid of a uniform lamina, centroid of laminae of various shapes (triangle, circle, semi-circle, trapezium, built up section), moment of inertia of a laminae of different shapes (rectangular, circular, triangular and composite sections) [7 hrs]nnn## Unit-IIInnLifting MachinesnMachine, ideal Machine, Practical Machine, Law of a Machine, Lifting Machine, Reversibility of a machine, Simple pulley, First order, Second Order and Third order system of pulleys, wheel and axle, wheel and differential axle, Weston pulley block, screw thread, screw jack, purchase crab winchesnVirtual WorknPrinciple of virtual work, positive and negative work, application of principle of virtual work to practical problems. [12 hrs]nnn## Unit-IVnnCouple & Motion of RotationnCouples, a couple and its effect on a body, angular momentum or moment of momentum.nMomentum, Work & EnergynImpulse, principle of conservation of momentum, work done by a force of varying magnitudes, transformation of energy, conservation of energy, Pile and Pile hammer. [9 hrs]","course outcomes":"Upon successful completion of the course, the student should be able to:n- Use scalar and vector analytical techniques for analyzing forces in statically determinate structuresn- Apply fundamental concepts of kinematics and kinetics of particles to the analysis of simple, practical problemsn- Apply basic knowledge of mathematics and physics to solve real-world problems","reference books":"- Engineering Mechanics (Dynamics), Hibbeler, Pearson Education (Singapore), Pvt. Ltd.n- Engineering Mechanics (Statics).- Hibbelern- Engineering Mechanics: Statics and Dynamics – Shames, Prentice-Hall (India).n- Engineering Mechanics, Bhavikantti, S.S. and Raja Shekharappa New Age Intn.(P) Ltd.n- Vector Mechanics for Engineers (Statics)- Bear & Johnston.n- Applied Mechanics: S. Ramamurtham, Dhanpat Rai & Sons.nSCHEME OF EXAMINATIONnB. TECH. (3rd SEMESTER) PRODUCTION AND INDUSTRIAL ENGINEERING"}
