{"course code":"PRPC-22","course title":"Production Technology-III","number of credits":"4.0","prerequisites":"Production Technology-II (PRPC18)","course type":"PC","branch":"pie","course learning objectives":"- To understand the basic concepts of powder metallurgy.n- To understand the gear manufacturing and their finishing processes.n- To understand the basic concepts of composite materials.n- To understand the fundamental concepts of welding and design considerations in casting.","course content":"## Unit-InnPowder MetallurgynTheory of powder metallurgy, manufacture of metal powders, sintering, secondary operations, properties of finished parts, design considerations and applications. [5 hrs]nnn## Unit-IInnGear Manufacturing and BroachingnClassification of gear production methods, gear forming, gear generation: gear hobbing, gear shaping, production of helical, spur, and bevel gears, gear finishing methods: shaving, burnishing, grinding, lapping, honing, Broaching: Broach, cutting action of broach, broaching operations, broaching machines, mechanics of broaching and machining time calculation. [5 hrs]nnn## Unit-IIInnComposite Materials and Their Processing:nIntroduction, Types of Composites materials, Agglomerated Materials, Reinforced materials, Laminates, Surface Coated Materials, Production of Composite Structures, Fabrication of particulate composite Structures, Fabrication of reinforced Composite, Fabrication of Laminates, Machining, Cutting and Joining of Composites. [5 hrs]nnn## Unit-IVnnTheory of WeldingnThermal effects in welding, structure in weld and heat affected zone, distortion and residual stresses, weldability or joinability, weld quality, welding of Cast Iron, Stainless Steel, Aluminium, non-destructive examiniation of weldments/materials/castings: Magnetic particle test, Liquid penetrant test, Electromagnetic methods, Radiography, Holography, Ultrasonic methods; gas and arc cutting. [12 hrs]nnn## Unit-VnnFoundry and castingnSand testing, solidification phenomenon, melting furnaces; Cooling and solidification of castings, cooling curves, nucleation and dendrite formation, gating system : Pouring time, choke area, sprue, pouring basin, sprue base well, Gating ratios, in-gate design, Slag trap systems : runner extension, whirl gate, Riser Design: Caine’s method, Modulus method, Naval research laboratory method, feeding distances, chills, grouping castings, feeding aids. [13 hrs]","course outcomes":"At the end of the course, student will be able ton- Explain the applications of powder metallurgy in manufacturing sectorn- Classify the various gear manufacturing process along with their finishing processesn- Fabricate the composite materialsn- Test the weld quality and design the various elements of casting.","reference books":"- Sharma P C, “ Production Engineering”, S Chand & Company,1997.n- Heine, R.W., Loper, C.R. and Rosenhal, P.C., “Principles of Metal Casting”, TMH.n- Flinn, R.A.,” Fundamentals of Metal Casting”, Addison-Wesley.n- P.N. Rao, “Manufacturing Technology”, TMHn- Pandey and Singh, “Production Engineering Sciences”n- Ghosh & Mallik, Manufacturing Science, Affiliated East West Press.n- DeGarmo, E. P., Black, J.T., and Kohser, R.A., “Materials and Processes in Manufacturing”, Prentice-Hall of India.n- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.n- Groover, M.P., “Fundamentals of Modern Manufacturing”, JohnWiley & Sons.n- Malhotra, “Handbook on Non-destructive Testing of Concrete”, Publisher: CRC Press, 2002.n- Mix, Paul E, “Introduction to Nondestructive Testing: A Training Guide”, John Wiley and Sons Ltd, 1999.n- Blitz and Jack, “Electrical and Magnetic Methods of Nondestructive Testing”, Institute of Physics Publishing, 2001.n- Henrique L M, “Non Destructive Testing and Evaluation for Manufacturing and Construction”, Hemisphere Publishers, New York, 2001.n- Kuo, S., “Welding Metallurgy”, John Wiley & Sons 2003n- Dieter, G.E., “Mechanical Metallurgy”, McGraw-Hill 1988."}
