{"course code":"PRPE-39","course title":"Materials Management","number of credits":"3.0","prerequisites":"Production Planning and Control (PRPC23)","course type":"PE","branch":"pie","course learning objectives":"- To understand the concepts of materials management.n- To understand the basic fundamentals of purchasing function.n- To understand the basic concepts of inventory management and economic order quantity.n- To understand the basic concepts of stores management and its applications.","course content":"## Unit-InnIntegrated approach to Materials Management:nIntroduction, materials productivity and role of materials management techniques in improved materials productivity. Cost reduction and value improvement, value analysis for right choice and rationalization of materials. [8 hrs]nnn## Unit-IInnPurchasing Function:nObjectives, purchase requisitions/Demand, types of specification, centralized versus decentralized purchasing, timing of purchases. Mode of Tender, Tender Enquiry, Tender Opening, Techno Commercial Evaluation, Tender Purchase Committee / Negotiation Committee Purchase Order / Contract, Post Contract Management, vender selection and vender rating. Purchase price analysis and price determination. Purchasing organizations, procedures, forms, records and reports. Purchasing as a dynamic profession like e-procurement and e-publishing. Overview of Government e-Marketing (GeM). [12 hrs]nnn## Unit-IIInnInventory Management:nInventory concepts, reasons for holding inventory, types of inventory, inventory reduction tactics. Inventory turnover ratio. Selective Inventory management: ABC, VED, and FSN analysis etc., identifying critical items with selective inventory management, assumptions for Wilson’s lot size model, inventory costs, hidden costs, composition of costs, estimation of inventory related costs, lead time, stock out point, number of time periods, calculating Economic Order Quantity (EOQ), sensitivity analysis of EOQ model. [12 hrs]nnn## Unit-IVnnStores managementnIntroduction, stores functions, stores organization, stores systems and procedures, Receipt & Inspection Note (RIN), Certified Receipt Voucher (CRV), stores accounting and verification systems, stores address systems, stores location and layout, store equipment. [8 hrs]","course outcomes":"Students will be able ton- Develop the concepts of materials management.n- Develop the basic fundamentals of purchasing function.n- Develop the basic concepts of inventory management and economic order quantity.n- Develop the basic concepts of stores management and its applications.","reference books":"- Arnold and Chapman “Introduction to Materials Management”, Pearson Education Asia, Fourth Edition, (2001)n- Narsimhan, Mcleavey & Billington, “Production Planning & Inventory Control”, Prentice Hall of India, Second Edition (2003)n- Dobler Donald W., Burt David N., “Purchasing and Supply Management”, Tata McGraw Hill, Sixth Edition (2001)n- Menon K S, “Purchasing and Inventory Control”, Wheeler Publishing New Delhi, Third Edition (1997)n- Krajewski L J and Ritzman L P, “Operations Management”, Pearson Education Asia, Sixth Edition (2004)"}
