{"course code":"PRPE-11","course title":"Engineering Economy","number of credits":"03","prerequisites":"NIL","course type":"PE","branch":"pie","course learning objectives":"This course emphasizes the strong correlation between engineering design and manufacturing of products/systems and the economic issues they involve. The following learning objectives are to be achieved-n- The basic concepts of the time value of money and economic equivalencen- To incorporate different cash flows, the cost of funds, capital, operational and maintenance costs, salvage value, depreciation, amortization, and taxation in the economic analysis of engineering projectsn- To apply different economic analysis methods – like present worth, annual-equivalent worth, rate-of-return, life-cycle cost etc in evaluation of the economic viability of a projectn- To enable the students to make replacement decisions, capital-budgeting decisions, and evaluate project risk and uncertainty.","course content":"## Unit-I IntroductionnnNature and purpose of engineering economy studies, functions of engineering economy, physical and economic laws, consumer and producer goods. [4 hrs]nInterest and Annuity RelationshipsnProductivity of capital, nominal and effective interest, interest factors, CAF, PWF, SPWF, SCAF, SFF, and CRF, deferred annuities, perpetuities and capitalized cost, equivalence, gradient factors, GPWF and GUSF. [6 hrs]nnn## Unit-II DepreciationnnClassification of depreciation, methods of computing depreciation, economic life and mortality data, capital recovery and return. [6 hrs]nIndustrial CostingnClassification of costs: Direct material, direct labour and overheads, fixed and variable cost, semi- fixed cost, increment, differential and marginal cost, sunk cost and its reasons, direct and indirect cost, prime cost, factory cost, production cost and total cost. [6 hrs]nnn## Unit-IIInnCost AnalysisnBreak-even analysis, two and three alternatives, graphical solution, break-even charts, effects of changes in fixed and variable cost, minimum cost analysis, economic order quantity, effect of risk and uncertainty on lot size. [4 hrs]nReplacement StudiesnReason of replacement, evaluation of proposals, replacement because of inadequacy, excessive maintenance, declining efficiency, obsolescence, MAPI formula. [6 hrs]nnn## Unit-IVnnCost EstimationnDifference between cost estimation and cost accounting, qualifications of an estimator, estimating procedure, estimate of material cost and labour cost, estimate of cost in machining, forging, welding and foundry operations. [6 hrs]nEconomy Study PatternsnBasic economy study patterns and their comparison, effect of taxation on economic studies.n[4 hrs]","course outcomes":"The course is targeted at enabling the students to-n- Apply the appropriate engineering economics analysis method(s) for problem solving: present worth, annual cost, rate-of-return, payback, break-even, benefit-cost ratio.n- Evaluate the cost effectiveness of individual engineering projects using the methods learned and draw inferences for the investment decisions.n- Compare the life cycle cost of multiple projects using the methods learned, and make a quantitative decision between alternate facilities and/or systems.n- Compute the depreciation of an asset using standard depreciation techniques to assess its impact on present worth.","reference books":"- Leland Blank, Anthony Tarquin; Engineering Economy, McGrawhill Education (India), New Delhi, 2017.ISBN13: 978-1-25-902740-6n- William G. Sullivan, C. Patrick Koelling; Engineering Economy, Pearson Education (Asia), 2017.n- Grant, E.L., Grant, W., and Leavenworth, R.S., Principles of Engineering Economy, John Wiley & Sons, 2015.n- Eschenbach , T.G., Engineering Economy by Applying Theory to Practice, Oxford University Press, 3rd edition, ISBN-13: 978-0199772766"}
