{"course code":"PRPE-23","course title":"Industrial Tribology","number of credits":"3 (L T P : 2 0 2)","prerequisites":"-","course type":"PE","branch":"pie","course learning objectives":"The students are required to deliver a seminar on some emerging areas of Industrial Engineering such as:nThe student will deliver a power point presentation for about 30 minutes in the seminar on any of the above topics. This will be followed by question answer session for about 10 minutes. The questions/queries on the topic will be asked by the teacher and class students. The students will also prepare a detailed report in MS word and after proper binding (spiral form) will submit it to the teacher concerned. The report is to be submitted at least one week prior to the presentation. The awards will be given according to the student’s presentation, report submitted, topic of presentation and the discussion or question answering after the presentation.nThe objective of this course is to impart the theoretical and practical knowledge of tribological phenomena, concepts of friction, modes of wear and lubrication which is required to design and develop the engineering surfaces in contact.","course content":"## Unit 1: Introduction and Concept of FrictionnnIntroduction to tribology, different scales of tribology, engineering surfaces, structural and topographical states of surface, contact of engineering surfaces, concept and classification of friction, laws of friction, theories of dry friction. (6hrs)nnn## Unit 2: Lubrication and WearnnIntroduction, lubricant viscosity, basic modes of lubrication, types of lubricants, lubricant additives,mechanism of pressure generation in lubricant. Introduction to wear, different modes and mechanisms of wear, wears resistance materials, corrosion and tribo-corrosion phenomenon. (7hrs)nnn## Unit 3: Surface Engineering TechniquesnnSurface hardening methods, diffusion coatings, hot dip coatings, galvanized coating, weld over-lay methods, introduction to thermal spraying and its applications, vapour deposition methods, friction surfacing, laser and microwave processing. (7hrs)nnn## Unit 4: Bearings and Bearing MaterialsnnGeometry and pressure equation of journal bearing, hydrostatic bearings, thrust bearings, journal bearings with specialized applications, general requirements and different types of bearing. (7hrs)nList of Practical:n- To determine the co-efficient of friction and dry-sliding wear behaviour of a given material with the help of a pin-on-disc tribometer.n- To determine the co-efficient of friction and sliding wear behaviour of a given material under lubricating condition with the help of a pin-on-disc tribometer.n- To evaluate the wear scar properties and co-efficient of friction of a lubricant with the help of a four-ball tester.n- To determine the load wear index and weld point of a lubricant on a four-ball tester.n- To study the pressure distribution of a journal bearing using a journal bearing apparatus.n- To evaluate the shear stability of a given lubricant with the help of a shear stability tester.n- To determine abrasion index of a material with the help of a dry abrasion test rig.n- To determine the reciprocating wear behaviour of a given material under dry and lubricating conditions.n- To determine the reciprocating wear behaviour of a given material at high temperature.","course outcomes":"By the end of this course, the student will have the:n- Knowledge of different scales of tribology, surface topography, and emerging concepts.n- Knowledge of the friction, wear, and lubrication mechanisms and will be able to apply them for practical engineering problems.n- Knowledge to design and develop new engineered surfaces for the better life of mechanical components.n- The students will be able operate the various types of tribometers to measure the wear of different materials under dry and lubricating conditions.n- The students will be able to measure the wear performance of different types of lubricants and greases for tribological applications.","reference books":"- Principles and Applications of Tribology, by B. Bhushan, John Wiley & Sons.n- Microstructure and wear of materials, by K.H. Zumgahr, Tribology series, Elsevier, Amsterdam.n- Coatings tribology: properties, mechanisms, techniques and applications in surface engineering, by K. Holmberg & A. Matthews, Tribology and interface engineering series, Ed. 2nd, Elsevier, Oxford.n- Fluid Film Lubrication, By B. Hamrock, NASA Reference Publication.n- Engineering Tribology, by G. Stachowiak and A.W. Batchelor, Tribology series 24, Elsevier, Amsterdam."}
