{"course code":"PRPE-27","course title":"Computer Aided Manufacturing","number of credits":"3","prerequisites":"Production Technology II (PRPC18),nProduction Planning and Control (PRPC23)","course type":"PE","branch":"pie","course learning objectives":"The student is expected to take up a project under the guidance of teacher from the Institute. The project must be based on the Production and Industrial Engineering problems. The student may be asked to work individually or in-group with not more than four students. Viva-voce is based on the preliminary report submitted by student(s) related to project.n- To understand the basic concepts of Computer –Aided Manufacturing and its scopen- To understand the basic concepts of Group Technology and Cellular Manufacturing, clustering algorithm as well as methods to carry out arrangement of machines with in a celln- To understand Computer aided process planning and its types and associated aspects.n- To understand Flexible manufacturing systems and related aspectsn- To understand CNC manual part programming and prepare part programs","course content":"## Unit-InnIntroduction to ManufacturingnBasic definitions, design activities for manufacturing systems, Planning and control activates for manufacturing system, Manufacturing control, Types of production –low, Medium and high quantity production. [6 hrs]nGroup Technology and Cellular ManufacturingnPart families, parts classifications and coding, Production flow Analysis, cellular Manufacturing- composite part concept, machine cell design, applications of group technology, Grouping parts and machines by Rank order clustering technique, Arranging machines in a G.T. cell. [10 hrs]nnn## Unit- IInnProcess PlanningnIntroduction, Manual process planning, Computer aided process planning – variount, generative, Decision logic- decision tables, decision trees, Introduction to Artificial intelligence. [6 hrs]nnn## Unit-IIInnFlexible ManufacturingnIntroduction, FMS components, Flexibility in Manufacturing – machine, Product, Routing, Operation, types of FMS, FMS layouts, FMS planning and control issues, deadlock in FMS, FMS benefits and applications. [8 hrs]nnn## Unit- IVnnCNC Basics and Part ProgrammingnIntroduction, Principle of CNC, Classification of CNC/NC – point to point and continuous path, positioning system- fixed zero and floating zero, Dimensioning- absolute and incremental, Coordinate system, Basic requirements of CNC machine control, CNC/NC words, Manual part programming, (G&M codes only) canned cycles, tool length and radius compensation. [10 hrs]","course outcomes":"At the end of the course, the students will be able to:n- Understand Scope of Computer aided manufacturingn- Apply knowledge of Group Technology and Cellular Manufacturing for formation of cells as well as arrangement of machines within a celln- Understand CAPP and its general architecture as well as types and related conceptsn- Understand FMS, manufacturing flexibility, production planning and control in FMS and related issues such as deadlockn- Prepare manual part programs of simple components","reference books":"/ Journals:n- Automation, Productions systems and Computer-Integrated Manufacturing by M.P. Groover, Prentice – Halln- Computer Aided Manufacturing by Chang, Wang & WysKn- Computer Numerical Control by Peter Smidn- International Journal of Production Researchn- International Journal of Flexible Manufacturing system"}
