{"course code":"PRPE-21","course title":"Heat Transfer","number of credits":"03","prerequisites":"Thermal Engineering (PRPC17)","course type":"PE","branch":"pie","course objectives":"- To understand the fundamentals of heat transfer mechanisms in fluids and solids and their applications in various heat transfer equipment in process industriesn- To apply scientific and engineering principles to analyze and design aspects of engineering systems that relate to conduction, convection and radiation heat transfer; use appropriate analytical and computational tools to investigate conduction, convection and radiation heat transfer; are both competentn- confident in interpreting results of investigations related to heat transfer and thermal design; recognize the broad technological and historical context of where heat transfer is important.","course content":"## Unit-I IntroductionnnDefinition of heat; Modes of Heat Transfer; Basic Laws of heat transfer; Electrical Analogy of heat conduction; Conduction through composite walls; Overall heat transfer coefficient. [5 hrs]nnn## Unit-II ConductionnnThe General heat Conduction equation in Cartesian, cylindrical and spherical coordinates; steady one dimensional heat conduction without internal heat generation: the plane slab; the cylindrical shell; the spherical shell; Critical thickness of insulation; Variable thermal conductivity, Steady one dimensional heat conduction with uniform internal heat generation: the plane slab; cylindrical and spherical systems. Fins of uniform cross-section: Governing equation; Temperature distribution and heat dissipation rate; Efficiency and effectiveness of fins. [12 hrs]nnn## Unit-III ConvectionnnFree and forced convection; Newton’s law of cooling; convective heat transfer Coefficient; Nusselt number; Dimensional analysis of free and forced convection; Analytical solution to forced convection problems: the concept of boundary layer; hydrodynamic and thermal boundary layer; Momentum and Energy equations for boundary layer. Exact solution for laminar flow over an isothermal plate using similarity transformation. The integral approach; integral momentum and energy equations; solution of forced convection over a flat plate using the integral method. Analysis of free convection; governing equations for velocity and temperature fields. Relation between fluid friction and heat transfer, Reynolds analogy. Dimensionless numbers: Reynolds, Prandtl, Nusselt, Grash off and Stanton Numbers and their significance, Heat transfer with change of phase; Nusselt theory of laminar film Condensation. [13 hrs]nnn## Unit-IV RadiationnnTheories of thermal radiation; Absorption, reflection and transmission; Monochromatic and total emissive power; Black body concept; Planck’s distribution law; Stefan Boltzman law; Wien’sndisplacement law; Lambert’s cosine law; Kirchoff’s law; Shape factor; Heat Transfer between black surfaces. [5 hrs]nnn## Unit-VnnHeat ExchangersnIntroduction; classification of heat exchangers; Logarithmic mean temperature difference; Area calculation for parallel and counter flow heat exchangers; Effectiveness of heat exchangers; NTU method of heat exchanger design. Applications of heat exchangers. [5 hrs]nCourse Outcome:n- The students will be able to understand about the different modes of heat transfer.n- The students will be able to apply related heat transfer lawsn- The students will be able to calculate the heat flow rate in different engineering applications and its implications on temperature.n- The students will be able to design Fins and heat exchangers for industrial applications","reference books":"- A Text Book on Heat transfer - S.P. Sukhatme, University Pressn- Heat Transfer Holman, McGraw-Hilln- Heat & Mass Transfer. D.S. Kumar, S.K. Katariyan- A Text Book on Heat transfer by S.P. Sukhatme, University Pressn- Heat and Mass Transfer by Cengel and Ghajar, McGraw-HillnORnProject WorknB.Tech (Production & Industrial Engineering) 7th SemesternB.Tech (Production & Industrial Engineering) 7th Semester Programme Electives (PE)"}
