{"course code":"PRPE -32","course title":"Entrepreneurship","number of credits":"3","prerequisites":"NIL","course type":"PE","branch":"pie","course learning objectives":"This course is designed to help students ton- Evaluate the business skills and commitment necessary to successfully operate an entrepreneurial venture and review the challenges and rewards of entrepreneurship.n- Students will learn about themselves, their decisions, and their goals to determine how entrepreneurship can play a role in their lives.n- Students will also be introduced to entrepreneurship from an economic perspective and the concepts of environmentally sustainable practices and social entrepreneurship and ability to recognize a business opportunity that fits the individual studentn- Demonstrate the understanding of how to launch the individual's entrepreneurial career and to recognize the innate entrepreneurial potential within themselves;n- Recognize the critical importance of values and ethics when engaged in entrepreneurial activities.","course content":"## Unit-InnEngineering EconomicsnDefinition and concept, Importance of economics for engineers, present value and future value, Wealth, Goods, Wants, Value and price, capital, money, utility of consumer and producer goods.n[4 hrs]nCostingnIntroduction, Elements of cost, Prime cost, Overhead, Factory cost, Total cost, Selling price, Nature of cost, Types of cost. [6 hrs]nDepreciationnDefinition and concept, Causes of depreciation, Methods of calculating depreciation. [4 Hrs]nEconomic analysis of investment and selection of alternativesnIntroduction, Nature of selection problem, Nature of replacement problem, Replacement of items which deteriorate, Replacement of machines whose operating cost in crease with time and the value of money also changes with time, methods used in selection of investment and replacement alternatives. [8 Hrs]nnn## Unit-II EntrepreneurshipnnEntrepreneurship, Characteristics of an entrepreneur, some myths and realities about entrepreneurship. [4 hrs]nProduct Planning and DevelopmentnIntroduction, Requirement of a good product design, Various controlling agencies involved -their role and formalities for getting clearance before starting individual venture. [4 hrs]nnn## Unit-IIInnFinancial ManagementnFinancial concept for small-scale industries, financial requirements Financial support programmer of banks, government financial agencies, Hire-purchase facilities alternate sources of finance.n[4 hrnMarketingnThe modern concept of marketing, Definitions, functions and principle of marketing,STPD , 4Ps, Marketing research, Advertising [2 hrs]nnn## Unit-IVnnSmall scale IndustriesnIntroduction, Role and scope of small scale industries, concept of small scale and ancillary industrial undertakings, How to start a small scale industry, Steps in launching own venture, procedure for registration of small scale industries, various developmental agencies-their functions and role in industrial and entrepreneurship development, Infrastructure facilities available for entrepreneurship development in India. MSMEs [4 hrs]nPreparation of feasibility Project ReportnTools for evaluation of techno economic feasibility project report, SWOT analysis. [2 hrs] Course outcomes:nAbility to recognize a business opportunity that fits the individual student:n- Demonstrate the ability to provide a self-analysis in the context of an entrepreneurial careern- Demonstrate the ability to find an attractive market that can be reached economically and create appropriate a business modeln- Apply effective written and oral communication skills to business situations.n- Analyze the global business environment and analyze the local business environment and use critical thinking skills in business situations.n- Apply an ethical understanding and perspective to business situations.","reference books":"- The practice of Entrepreneurship - By G. G. Meredikh, R.E. Nelson and P.A. Neckn- Handbook of Entrepreneurship - Rao and Pareekn- Entrepreneurship, 4e - Barringer,Pearson Publicationn- Entrepreneurship Development and Small Bussiness Enterprises,- Charanthimath, Pearson Publicationn- Engineering Economics- Tarachandn- Industrial Engineering and Management- Ravi Shankarn- Industrial Engineering and Organization Management by S.K.Sharma and Sawita Sharman- Industrial Engineering and Management- O.P. KhannanB.Tech (Production & Industrial Engineering) 8th SemesternB.Tech (Production & Industrial Engineering) 8th Semester Programme Elective (PE)"}
