{"course code":"PRPE-35","course title":"Maintenance Engineering","number of credits":"3.0","prerequisites":"Production Planning and Control (PRPC23)","course type":"PE","branch":"pie","course learning objectives":"- To understand the basic fundamentals of Maintenance Engineering.n- To understand the basic concepts of Maintenance Systems.n- To impart the knowledge of Maintenance Planning, Maintenance schedule and programme.n- To impart the knowledge of Reliability, Maintenance & Availability concepts and apply them to know about the practical aspects of the Industrial Systems.n- To understand the basic concepts of Repair Discard Decisions.","course content":"## UNIT-InnIntroductionnImportance of maintenance engineering, definitions and concepts used in maintenance, objectives and benefits of maintenance. [6 hrs]nnn## UNIT-IInnMaintenance SystemsnVarious types of industrial maintenance systems maintenance systems, their merits, demerits and applications etc. [8 hrs]nnn## UNIT-IIInnMaintenance PlanningnPlanned Maintenance procedure, maintenance schedule and maintenance programme, benefits of planned maintenance. [10 hrs]nnn## UNIT-IVnnReliability, Maintainability & AvailabilitynBasic concepts and definitions, availability models, economics of reliability, availability and maintainability, distribution of down time and its basic elements. [10 hrs]nnn## UNIT-VnnRepair Discard DecisionsnIntroduction, factors affecting repair -discard decisions, cost-analysis and optimum module size.n[6 hrs]","course outcomes":"Upon completion of this course, student would be able ton- Understand the basic concepts of Maintenance Engineeringn- Understand the fundamentals of various Industrial Maintenance Systemsn- Understand the significance of Maintenance Planning and Controln- Understand, analyse and apply knowledge of Reliability, Availability and Maintainability.n- Understand the relevance of Repair-Discard Decisions","reference books":"- Principles of Planned Maintenance by R.H Clifton, McGraw Hill.n- Maintenance Planning and Control by Anthony Kelly, P.H.E.n- Handbook of Maintenance Management by Heintzelman, P.H.E.n- Reliability, Availability and Maintainability by Faster Phillips & Rayers, M/A Press."}
