{"course code":"PRPE-18","course title":"Refrigeration and Air Conditioning","number of credits":"03","prerequisites":"Thermal Engineering (PRPC17)","course type":"PE","branch":"pie","course learning objectives":"- To analyze the refrigeration cycles and method of improving of performance.n- To familiarize the components of basic refrigeration systems.n- To understand vapor compression system and vapor absorption system.n- To design air condition systems using cooling load calculations.n- To know the applications of refrigeration and air conditioning systems.","course content":"## UNIT-InnIntroductionnBasics of heat pump & refrigerator, Carnot refrigeration and heat pump, units of refrigeration, COP of refrigerator and heat pump, Carnot COP, Ice refrigeration, evaporative refrigeration, refrigeration by expansion of air, refrigeration by throttling of gas, vapour refrigeration system, steam jet refrigeration, thermo- electric cooling, adiabatic demagnetization. [4 hrs]nAir RefrigerationnBasic Principle of operation of air refrigeration system, Bell Coleman air refrigerator, advantages of using air refrigeration in air craft, disadvantage of air refrigeration in comparison to other cold producing methods, simple air refrigeration in air craft, simple evaporative type, air refrigeration in air craft, necessity of cooling the air craft. [4 hrs]nnn## UNIT-IInnSimple Vapour Compression réfrigération SystemnSimple vapour compression refrigeration system, different compression processes (wet, dry and saturated Compression, superheated compression), Limitations of vapour compression refrigeration system if used on reverse Carnot cycle, representation of theoretical and actual cycle on T-S and P H charts, effects of operating conditions on the performance of the system, advantages of vapour compression system over air refrigeration system. [4 hrs]nAdvanced Vapour Compression refrigeration systemnMethods of improving COP, flash chamber, flash inter cooler, optimum inter stage pressure for two stage refrigeration system, single expansion and multi expansion cases, basic introduction of single load and multi load systems, cascade systems. [5 hrs]nVapour absorption refrigeration system and special topicsnBasic absorption system, COP and maximum COP of the absorption system. Actual NH3 absorption system, function of various components, Li-Br absorption system, Selection of refrigerant and absorbent pair in vapour absorption system, Electro-Lux refrigerator, comparison of compression and absorption refrigeration system, Nomenclature of refrigerants, desirable properties of refrigerants, cold storage and Ice Plants. [4 hrs]nnn## UNIT-IIInnAir ConditioningnDifference between refrigeration and Air Conditioning, Psychrometric properties of moist air (web bulb, dry bulb, dew point temperature, relative and specific humidity temperature of adiabatic saturation), empirical relation to calculate PV of moist air. [3 hrs]nPsyschrometrynPsychrometry chart, construction and use, mixing of two air streams, sensible heating and cooling, latent heating and cooling, humidification and dehumidification, cooling with dehumidification, cooling with adiabatic humidification, heating and humidification, By- pass factor of coil, sensible heat factor, ADP of cooling coil, Air washer. [4 hrs]nnn## UNIT-IVnnAir Conditioning systemnClassification, factors affecting air conditioning systems, comfort air conditioning system, winter air conditioning system, summer Air Conditioning system, year round air conditioning system, unitary air conditioning system, central air conditioning system, Room sensible heat factor, Grand sensible heat factor, effective room sensible heat factor. [5 hrs]nCooling Load calculationnInside design conditions, comfort conditions, components of cooling load, internal heat gains from (occupancy, lighting, appliances, product and processes), system heat gain (supply air duct, A.C. fan, return air duct), External heat gain (heat gain through building, solar heat gain through outside walls and roofs), sol-air temperature, solar heat gain through glass windows, heat gain due to ventilation and infiltration. [5 hrs]nIndustrial and commercial applicationnTransport air conditioning, evaporative condensers, cooling towers, heat pumps. [2 hrs]","course outcomes":"- Students should be able to understand the need and importance of various refrigeration and air conditioning cycles, the typical and some advanced and innovative schematic designs, and the goals of R&AC systems.n- Students should be able to design the VCRS and VARS with improving performance parameters.n- Students should be able to describe the working of different types of air conditioning systems.n- Student should be able to understand the actual applications of R&AC.","reference books":"- Refrigeration and Air Conditioning - C.P. Arora, Tata McGraw-Hilln- Basic Refrigeration and Air Conditioning- Ananthana and Rayanan, McGraw-Hilln- Refrigeration and Air Conditioning- Arora and Domkundwar, Dhanpat Rai."}
