{"course code":"PRPE-19","course title":"Computer Aided Design","number of credits":"03","prerequisites":"Strength of Materials (PRPC20), Theory of Machines (PRPC14)","course type":"PE","branch":"pie","course learning objectives":"- To understand 2D & 3D geometric transformation techniques in CAD.n- Develop mathematical models to represent curves and surfaces.n- To develop skills for programming for designing different types of curves, surfaces etcn- To understand and generate solid geometries.","course content":"## UNIT-InnIntroductionnIntroduction to CAD/CAM, Historical developments, Industrial look at CAD/CAM, Introduction to CIM, Basics of geometric and solid modeling, explicit, implicit, intrinsic Polar envelope and parametric equations coordinate systems. Torsion, Frenet-Serret formulae. [6 hrs]nnn## UNIT-IInnTransformationsnIntroduction, transformation of points and line, 2-D rotation, reflection, scaling and combined transformation, homogeneous coordinates, 3-D scaling, shearing, rotation, reflection and translation, combined transformations orthographic, Axonometric, Oblique and perspective projections. [8 hrs]nnn## UNIT-IIInnCurvesnAlgebraic and geometric forms, Analytical & Synthetic Curves, tangents and normal, blending functions, re-parametrization, straight lines, conics, cubic splines, bezier curves and B-spline curves; Rational curves, Non-uniform Rational curves, NURBS; Curve manipulation. [10hrs]nnn## UNIT- IVnnSurfacesnAlgebraic and geometric forms, Analytical and Synthetic Surfaces, tangents and twist vectors, normal, blending functions, re-parametrization, sixteen-point form, four curve form, plane surface, ruled surface, surface of revolution, tabulated cylinder, bi-cubic surface, Bezier surface, B-spline surfaces, Coons surface, Blending surface, Offset surface, Triangular patches, Sculptured surfaces, Rational parametric surfaces; surface manipulation. [10 hrs]nnn## UNIT- IVnnSolidsnSolid models and representation scheme, Fundamentals of Solid Modeling, boundary representation, constructive solid geometry, sweep representation, cell decomposition, spatial occupancy enumeration, Half spaces, Octree Encoding, Pure Primitive Instancing. [6 hrs]","course outcomes":"At the end of the course student will be able ton- Perform transformations of 2D & 3D objects (such as lines, surfaces and solids)n- Generate curves and surfaces by developing mathematical modelsn- Model components using solid modeling techniquesn- Apply computer aided design techniques in industry.","reference books":"- CAD/CAM by Groover and Zimmer, Prentice Halln- CAD/CAM: Theory and Practice by I. Zeid, Tata McGraw Hilln- Mathematical Elements for Computer Graphics by Rogers & Adams, McGraw Hill.n- Computer Aided Engineering Design by AnupamSaxena and Birendra Sahay, Springer"}
