{"course code":"PRPE-29","course title":"Mechanical Vibrations","number of credits":"3","prerequisites":"Strength of Materials (PRPC20), Theory of Machines (PRPC14)","course type":"PE","branch":"pie","course learning objectives":"- To learn effects of periodic disturbance due to external excitation; due to rotating and reciprocating unbalance; due to excitation of the support on performance of a Machine.n- To learn method of vibration analysis of Mechanical Systems.n- To learn Mathematical Modelling of Mechanical Systems for vibration analysis.n- To learn methods of Vibration isolation of Mechanical systems under periodic inputs.","course content":"## UNIT - InnFundamental of VibrationsnIntroduction, Definitions, Kinematics of simple vibrating motions, Simple harmonic motions, Vector Method and Complex Method representation of a harmonic motion, Fourier series representation of periodic Inputs, Mathematical Model for Vibration Anaysis. [4 hrs]nFree Vibrations of a Single Degree of Freedom SystemsnDegrees of freedom, equations of motions, general solution of equation of motions, Undamped and Damped free vibrations of Mechanical Systems. [4 hrs]nnn## UNIT - IInnForced Vibrations of a Single Degree of Freedom SystemsnUndamped and damped forced vibrations, Transient and Steady state response, Viscous damping, Coulomb damping, Forced vibration – due to external excitation; due to rotating and reciprocating unbalance; due to excitation of the support, Transmissibility and isolation and Vibration measuring Instruments. [10 hrs]nnn## UNIT - IIInnTwo Degrees of Freedom SystemsnUndamped free vibration, principal modes, Damped Free Vibrations, Forced Vibration with Harmonic excitation and Vibration Absorber. [6 hrs]nMulti-Degrees of Freedom SystemsnExact Analysis: Undamped Free Vibrations, Influence Numbers, Undamped Forced Vibration, Generalized Coordinates, Coordinate Coupling, Principal Coordinate. [4 hrs]nnn## UNIT - IVnnMulti-Degrees of Freedom SystemsnNumerical Methods: Dunkerley’s Method, Method of Matrix iteration, Holzer’s method, Rayleigh’s method, Rayleigh–Ritz method. [6 hrs]nContinuous SystemsnTransverse vibration of strings, longitudinal vibration of bars, lateral vibration of beams, torsional vibration of circular shafts. [4 hrs]nCritical speeds of shaftsnCritical speed of Undamped and Damped light shaft having Single Disk. [2 hrs] Course Outcomes:nAt the end of the course, student will be able ton- Make mathematical model of a Mechanical system for vibration analysis.n- Write differential equations of motion of the Mathematical model of the Mechanical system for vibration analysis.n- Solve governing equation of motions of the Mechanical systems using Numerical Methods as well as exact analysis.n- Predict response of the Mechanical Systems under periodic inputs.n- Deal with mechanical systems involving vibration isolation and rotating and reciprocating unbalance.","reference books":"- Mechanical vibration by G.K. Grover, Nemchand & Brothersn- Mechanical vibration by S. S. Rao, Pearson Educationn- Mechanical Vibration by Thomson, Prentice Halln- Mechanical Vibration by Den Hartog, McGraw-Hilln- Introductory course on Mechanical Vibrations by Rao and Gupta, Wiley Eastern"}
