{"course code":"PRPE -25","course title":"Finite Element Method","number of credits":"3","prerequisites":"Strength of Materials (PRPC20), Numerical Methods and Computer Programming (Practical (PRPL16)","course type":"PE","branch":"pie","course objectives":"- To make students learn basic principles of finite element analysis procedure.n- To make students learn the theory and characteristics of finite elements that represent engineering structures.n- To make students use this method and commercial software package to solve problems in heat transfer, mechanics of materials and machine design.n- Learn to model complex geometry problems and solution techniques.","course content":"## Unit-InnIntroduction to Finite Element MethodnBasic Concept, Historical background, Engineering applications, general description, Comparison with other methods. [4 hrs]nnn## Unit-IInnIntegral Formulations And Variational MethodsnNeed for weighted-integral forms, relevant mathematical concepts and formulae, weak formulation of boundary value problems, variational methods, Rayleigh-Ritz method, and weighted residual approach. [6 hrs]nnn## Unit-IIInnFinite Element TechniquesnModel boundary value problem, finite element discretization, element shapes, sizes and node locations, interpolation functions, derivation of element equations, connectivity, boundary conditions, FEM solution, post-processing, compatibility and completeness requirements, convergence criteria, higher order and isoparametric elements, natural coordinates, Langrange and Hermite polynomials. [12 hrs]nnn## Unit-IVnnApplications To Solid Mechanics ProblemsnExternal and internal equilibrium equations, one-dimensional stress-strain relations, plane stress and strain problems, axis-symmetric and three dimensional stress-strain problems, strain displacement relations, boundary conditions, compatibility equations, computer programs. [8 hrs]nnn## Unit-VnnApplications To Heat Transfer ProblemsnVariational approach, Galerkin approach, one-dimensional and two-dimensional steady-state problems for conduction, convection and radiation, transient problems. [5 hrs]nnn## Unit-VInnApplications To Fluid Mechanics ProblemsnInviscid incompressible flow, potential function and stream function formulation, incompressible viscous flow, stream function, velocity-pressure and stream function-vorticity formulation, Solution of incompressible and compressible fluid film lubrication problems. [5 hrs]","course outcomes":"Upon successful completion of this course the student will be able to:n- Understand the concepts behind variation methods and weighted residual methods in FEM.n- Identify the application and characteristics of FEA elements such as bars, beams, plane and isoparametric elements, and 3-D element.n- Develop element characteristic equation procedure and generation of global stiffness equation will be applied.n- Able to apply Suitable boundary conditions to a global structural equation, and reduce it to a solvable form.n- Able to identify how the finite element method expands beyond the structural domain, for problems involving dynamics, heat transfer, and fluid flow.","reference books":"- The Finite Element Method by Zienkiewicz, Tata McGraw Hilln- The Finite Element Method for Engineers by Huebner, John Wileyn- An Introduction to the Finite Element Method by J.N.Reddy, McGraw Hill"}
