{"course code":"PRPE-43","course title":"Computer Integrated Manufacturing","number of credits":"3","prerequisites":"Computer Aided Manufacturing (PRPE27)","course type":"PE","branch":"pie","course learning objectives":"- To Understand CIM and its scopen- To Understand hardware and software requirements for CIMn- To Understand product design in CIM and concurrent engineeringn- To understand group technology and cellular manufacturingn- To Understand operations planning in CIM environment","course content":"## Unit-InnManufacturing Enterprise and Manufacturing SystemsnIntroduction, External Challenges, Internal Challenges, World-Class winning criteria, learning CIM concepts, Manufacturing classifications, product development cycle, Enterprise organizationn[4 hrs]nMeaning and Scope of CIMnDefinition of CIM, CIM Wheel, Evolution of CIM, Benefits of CIM [4 hrs]nnn## Unit- IInnComputers in ManufacturingnPresent status, Needs of CIM: Hardware, CIM software, CIM workstations [4 hrs]nProduct DesignnNeeds of the market, design process, design for manufacturability, computer-aided design: areas of application, benefits of CAD, concurrent engineering [6 hrs]nnn## Unit- IIInnGroup Technology and Cellular ManufacturingnPart families, parts classifications and coding, Production flow Analysis, cellular Manufacturing- composite part concept, machine cell design, applications of group technology, Grouping parts and machines by Rank order clustering technique, Arranging machines in a G.T. cell. [8 hrs]nnn## Unit- IVnnProduction/Operations PlanningnOperations management, manufacturing planning and control: production planning, master production schedule, product data management MRP, MRP-II, introduction to production activity control, Just-in Time manufacturing, synchronized production, ERP and beyond [14 hrs]","course outcomes":"At the end of the course, the students will be able ton- Understand CIM and its scopen- Understand hardware and software requirements for CIMn- Understand product design in CIM and concurrent engineeringn- Apply knowledge of group technology and cellular manufacturing to form the cell and arrangement of machines in a celln- Understand operations planning in CIM environmentnRecommended Books/ Journals:n- Automation, Productions systems and Computer-Integrated Manufacturing by M.P. Groover, Prentice – Hall.n- Computer Aided Manufacturing by Chang, Wang and Wysk.n- Computer- Integrated Manufacturing by Rehg, J. A. and Kraebber, H.W., Second edition, Pearson Education Asia.n- Principles of Computer-Integrated Manufacturing by Vajpayee, S. K., Prentice-Hall of India Pvt. Ltd.n- International Journal of Production Researchn- International Journal of Computer Integrated Manufacturing"}
