{"course code":"PRPE-34","course title":"Power Plant Engineering","number of credits":"3.0","prerequisites":"Thermal Engineering (PRPC17)","course type":"PE","branch":"pie","course learning objectives":"- To understand the basic Fundamental Power plant cycles and Diesel power plant.n- To understand operations of gas power plant and its principle.n- To make understand on advanced supercritical boilers technology.n- General understanding of challenges in nuclear power plant.","course content":"## UNIT-InnIntroductionnClassification of Power Plants, Future Planning for Power Generation, Review of Thermodynamics Cycles Related to Power Plants, Fuels and Combustion, Atomic Energy, Highlights of the Nuclear Power Programme. [5 hrs]nDiesel Power PlantsnIntroduction; Field of use; Outline of diesel electric power plant; Different systems of diesel power plant; Supercharging of diesel engines; Performance of diesel power plant; Advantages and disadvantages of diesel plants over thermal power plants. [5 hrs]nnn## UNIT-IInnGas Power PlantnClassification of Gas Turbine Power Plant, Elements of Gas Turbine Power Plants, Gas Turbine Cycles, Gas Turbine Cycles- Performance Evaluation, Gas Turbine Cycles- Modifications, Problem Solving, Centrifugal Compressors, Regeneration and Reheating, Cogeneration, Auxiliary Systems, Control of Gas Turbines, Gas Turbine Efficiency, Combined Cycle Power Plants, Applications of Gas Turbine, Advantages of Gas Turbine Power Plant, Disadvantages. [10 hrs]nnn## UNIT-IIInnSteam Power PlantnLayout and component of modern power plant, Rankine Cycle, Supercritical Boiler & ultra- supercritical plants, Design types, Water & Steam Flow, circulating fluidized bed boiler, boiler key features, arrangements, Furnace wall design, spiral & vertical tubes, Steam turbine features, Challenges, fuel, water, emissions, flexibility, Water Walls, Pulverized Coal, Steam Generators,nFire Tube Boilers, Water Tube Boilers, Boiler Mountings and Accessories, High Pressure Boilersn[10 hrs]nnn## UNIT-IVnnNuclear Power PlantnNuclear Power Generation, Nuclear Fusion Reactors, Basic theory and terminology; Nuclear fission and fusion processes; Fission chain reaction; Moderation; Fertile materials; Nuclear fuels;nGeneral components of nuclear reactor; Different types of reactors; Breeder reactors; Nuclear power plants in India; Disposal of nuclear waste and Challenges [6hrs]","course outcomes":"By the end of this education program, the students will be able to:n- Understand the over view of power plant.n- Understanding the components of gas turbine power plant and its requirement.n- Analysis of super and ultra-critical power plant for need of power generation.n- Understand the nuclear technology and its future need.","reference books":"/ Videos:n- Energy Resources & Technology (Video) Prof. S. Banerjee IIT Kharagpur NPTEL Video course (https://nptel.ac.in/syllabus/108105058/)n- Steam and Gas Power Systems (Video) Prof. Ravi Kumar ( https://nptel.ac.in/syllabusn/112107216/ )n- Power Plant Engineering by Morsen- Power Plant Engineering by Domkundwarn- Power Plant Engineering by P.C. Sharman- Power Plant Technology by El-Wakil"}
