{"course code":"PRPE-28","course title":"Modeling And Simulation","number of credits":"3","prerequisites":"NIL","course type":"PE","branch":"pie","course learning objectives":"- Define the basics of simulation modeling and replicating the practical situations in organizationsn- Generate random numbers and random variates using different techniques.n- Develop simulation model and explain Verification and Validation of simulation model.n- Analysis of Simulation models using input analyzer, and output analyzer","course content":"## Unit – InnIntroduction to Simulation: Simulation, Advantages, Disadvantages, Areas of application, System environment, components of a system, Model of a system, types of models, steps in a simulation study. Simulation Examples: Simulation of Queuing systems, Simulation of Inventory System, Other simulation examples [7 hrs]nnn## Unit- IInnGeneral Principles: Concepts in discrete - event simulation, event scheduling/ Time advance algorithm, simulation using event scheduling.nRandom Numbers: Properties, Generations methods, Tests for Random number- Frequency test, Runs test, Autocorrelation test. [ 06 hrs]nnn## Unit-IIInnAnalysis of Simulation Data Input Modelling: Data collection, Identification and distribution with data, parameter estimation, Goodness of fit tests, Selection of input models without data, Multivariate and time series analysis. Verification and Validation of Model – Model Building, Verification, Calibration and Validation of Models [7 hrs]nnn## Unit-IVnnOutput Analysis – Types of Simulations with Respect to Output Analysis, Stochastic Nature of output data, Measures of Performance and their estimation, Output analysis of terminating simulation, Output analysis of steady state simulations.nSimulation Softwares: Selection of Simulation Software, Simulation packages, Trend in Simulation Software. [6 hrs]nList of Experiments:n- Features of simulation Package and Input Modelingn- Simulation of Manufacturing System In- Simulation of Manufacturing System IIn- Simulation of Service Operations In- Simulation of Service Operations IIn- Simulation of JIT Kanban Multi Product Assembly line Systemn- Modelling Live Problems of manufacturing industries and service organizations","course outcomes":"At the end of the course, the students will be able ton- Describe the role of important elements of discrete event simulation and modeling paradigm.n- Conceptualize real world situations related to systems development decisions, originating from source requirements and goals.n- Develop skills to apply simulation software to construct and execute goal-driven system models.n- Interpret the model and apply the results to resolve critical issues in a real world environment.nRecommended Books:n- Banks, J., Nelson, B.L., Carson, J. S., and Nicol, D., “Discrete Event System Simulation”, Pearson Education, 2000.n- Law, A.M., and Kelton, W.D., “Simulation Modeling and Analysis”,McGraw-Hill,1999.n- Schwarzenbach, J., and Gill, K.F., “System Modeling and Control”,Butterworth- Heinemann,1992.n- Carrie, A., “Simulation of Manufacturing Systems”, John Wiley &Sons, 1988.n- Viswanadham, N., and Narahari, Y., “Performance Modeling of Automated Manufacturing System”, Prentice-Hall of India, 1992.n- B.P. Zeigler, Taqgon Kim and Herbert Praehofer, “Theory of Modeling & Simulation”, Academic Press.n- Jerry Banks, “Handbook of Simulation: Principles, Methodology, Advances, Applications & Practice”.n- Khoshnevis, “Discrete Systems Simulation”.n- Charles Harrell and KerimTumay, “Simulation Made Easy”, Engineering and Management Press.n- W. David Kelton, Randall P. Sadowski, and Deborah A. Sadowski, “Simulation with Arena”, McGraw-Hill.n- “ProModel Software - Student Version”, Published by the Day Grp."}
