{"course code":"PRPE-17","course title":"Industrial Robotics","number of credits":"03","prerequisites":"Strength of Materials (PRPC20), Theory of Machines (PRPC14)","course type":"PE","branch":"pie","course learning objectives":"- To understand the basic concepts of robotics, their classification and applications, direct and inverse kinematics of standard industrial robots.n- To understand the workspace analysis, workspace fixtures, trajectory planning with different types of tool motions and motion rate controls of redundant robots.n- To understand the direct and inverse dynamics of different industrial robots and robot controls.n- To understand the concepts of template machining, shape analysis, perspective transformations and task planning using robots.","course content":"## Unit-InnRobotic ManipulationnAutomation and robots, Robot classification, Applications, Robot specifications. (3 hrs)nnn## Unit-IInnDirect Kinematics (The Arm Equation)nDot and Cross products, Coordinate frames, Homogeneous coordinates, Link Coordinates, The arm equation, Five-axis articulated robot (Rhino XR-3), Four-axis SCARA robot (Adept One), Six- axis articulated robot (Intelledex 660). (4 hrs)nnn## Unit-IIInnInverse Kinematics (Solving the Arm Equation)nThe Inverse kinematics problem, General properties of solutions, Tool Configuration, Inverse kinematics of Five-axis articulated robot (Rhino XR-3), Inverse Kinematics of Four-axis SCARA robot (Adept One), inverse kinematics of Six-axis articulated robot (Intelledex 660), and Inverse kinematics of a three-axis planar articulated robot, a robotic work cell. (6 hrs)nnn## Unit- IVnnWorkspace Analysis and Trajectory PlanningnWorkspace analysis, Work envelope of a five-axis articulated robot (Rhino XR-3), Work envelope of a four-axis SCARA robot (Adept One), Workspace fixtures, The pick and place operations, Continuous path motion, Interpolated motion, Straight line motion. (4 hrs)nnn## Unit-VnnDifferential Motion and StaticnThe tool configuration and Jacobean matrix, Joint space singularities, Generalized inverses, Resolved motion rate controls, rate control of redundant robots, rate control using {1}-inverses, The manipulator Jacobean, Induced joint torque and forces. (5 hrs)nnn## Unit-VInnManipulator DynamicsnLagrange’s equation, Kinetic and potential energy, Generalized force, Lagrange-Euler dynamic model, Dynamic model of a two-axis planar articulated robot, Dynamic model of a three-axis SCARA robot, Direct and inverse dynamics, Recursive Newton-Euler formulation, Dynamic model of a one-axis robot (inverted pendulum). (6 hrs)nnn## Unit-VIInnRobot ControlnThe control problem, State equations, Constant solutions, Linear feedback systems, Single axis PID control, PD gravity control, Computed torque control, Variable structure control. (5 hrs)nnn## Unit-VIII Robot VisionnnImage representation, Template matching, Polyhedral objects, Shape analysis, Segmentation, Iterative processing, Perspective transformations, Structured Illumination, Camera Calibration.n(4 hrs)nnn## Unit-XnnTask PlanningnTask level programming, Uncertainty, Configuration space, Gross motion planning, Grasp Planning, Fine motion planning, Simulation of planar motion. (3 hrs)","course outcomes":"At the end of the course student will be able ton- Understand the basic concepts of robotics, their classification and applications, direct and inverse kinematics of standard industrial robots.n- Understand the workspace analysis, workspace fixtures, trajectory planning with different types of tool motions and motion rate controls of redundant robots.n- Understand the direct and inverse dynamics of different industrial robots and robot controls.n- Understand the concepts of template machining, shape analysis, perspective transformations and task planning using robots.","reference books":"- Industrial Robotics by M.P. Groover, McGraw Hilln- Industrial Robotics and Automation by S.R.Deb Tata McGraw Hill"}
