{"course code":"PRPE-33","course title":"Advanced Welding Technology","number of credits":"3.0","prerequisites":"Production Technology- II (PRPC18)","course type":"PE","branch":"pie","course content":"Course Objective:nThe objective of this course is teach the undergraduates about the fundamentals and advanced technology in the field of welding engineering.nnn## Unit-InnIntroduction to welding, classification of welding processes, volt-ampere characteristics, duty Cycle, AC/DC power sources, metal transfer in welding, residual stresses; measurement and control, welding metallurgy, weldability of some commercial alloys, welding defects and prevention. [9 hrs]nnn## Unit -IInnHigh-energy density welding processes; concept and mechanism of keyhole welding, plasma welding, control of plasma welding, pulsed plasma welding, applications, laser welding; types of lasers, beam characteristics, plasma formation and control in laser welding, applications, electron beam welding; fundamentals, developments, applications. [9 hrs]nnn## Unit -IIInnSolid state welding processes; friction stir welding (FSW), process parameters, FSW of aluminium alloys, ultrasonic welding, explosive welding, diffusion bonding, Non-conventional welding; underwater welding, microwave hybrid joining, adhesive weld bonding, magnetic impelled arc butt welding(MIAB), [9 hrs]nnn## Unit-IVnnAdvanced tungsten inert gas welding; high frequency pulsed GTAW, cold and hot wire feeds, multi-cathode GTAW, Pulse & Synergic-MIG, cold-metal transfer (CMT) welding, narrow-groove welding techniques; joint preparation, narrow gap GTAW torch, twist arc GMAW technique.n[9 hrs]nCourse outcome:n- The students will have the understanding of conventional welding processes and fundamentals.n- The students will have the in-depth knowledge of high-energy density welding processes and their applicationsn- The students will have the understanding of advanced solid state welding processes as well as non-conventional welding techniques.n- The students will gain the knowledge about latest developments in the GTAW and GMAW process.","reference books":"- Hoffman. D.J., Welding, 2nd Ed., Pearson.n- Little, R.L., Welding and Welding Technology, McGraw-Hill.n- Norrish, J., Advanced Welding Processes, Woodhead Publishing.n- Misra, R., Friction Stir Welding and Processing: Science and Engineering, Springer.n- AWS Welding Handbooks, 9th Edition, Vol. 1 & 3, AWS Publications.n- Kou, S., Welding Metallurgy, Wiley-Interscience.n- Parmar, R.S., Welding Engineering and Technology, Khanna Publishers."}
