{"course code":"PRPE-40","course title":"Marketing and Financial Management","number of credits":"3","prerequisites":"NIL","course type":"PE","branch":"pie","course learning objectives":"- Understand the place and contribution of marketing to the business enterprise.n- The objective of this course is to train students to apply concepts and techniques in marketing so that they become acquainted with the duties of a marketing manager.n- More specifically, they will be exposed to the development, evaluation, and implementation of marketing management in a variety of business environments","course content":"## Unit-I IntroductionnnNeed, Want, Demand, Production, Product, Selling, Marketing and societal concepts of marketing, Types of goods. [4 hrs]nnn## Unit-IInnMarketing ProcessnAnalyzing marketing opportunities, Researching and selecting target markets, Positioning the offer, Designing and marketing strategies, Planning marketing program, Organizing, Implementing & controlling marketing efforts. [4 hrs]nnn## Unit-IIInnConsumer Behavior & Market ResearchnFactors affecting consumer behavior, stages in purchasing, Market research, Market segmentation and target market selection. [4 hrs]nnn## Unit-IVnnOrganizational BuyingnSalient features, Factors affecting organizational purchase marketing mix, Product, Product levels, Product hierarchy, Product line, Types of distributions, Channel management decisions, Product mix, Product life cycle, Procedure for new product development, Branding and packaging. [6 hrs]nnn## Unit-V PricennPricing objectives, Price elasticity of demand, Methods of pricing, Discounts, Discriminatory pricing. [4 hrs]nnn## Unit-VI DistributionnnNeed for middleman and their functions, Vertical marketing system. [4 hrs]n.nnn## Unit-VII Promotion MixnnAdvertising, media selection, Frequency and timing of advertisement, steps in developing effective communication, Sales promotion, Personal selling, Publicity. [5 hrs]nnn## Unit-VIIInnSales Force ManagementnRecruitment, Training, Motivating sales representatives, Controlling and evaluating. [5 hrs]nnn## Unit-XnnBasic Valuation Concepts:nTime value of money, Methods of dealing with time value of money, Future value of a single cash flow, Future value of annuity, Present value of a single cash flow, Present value of annuity, Risk and return concept, Valuation of bonds, Securities and equities, Principles of accounting, Balance sheet, Income statement, Financial ratios. [5 hrs]","course outcomes":"The student will be able to:n- Define primary and secondary sources of information; give examples of methods used to collect primary data; give examples of sources for secondary data; compare and contrast the advantages and disadvantages of both types of datan- Describe major bases for segmenting consumer and business markets; define and be able to apply the three steps of target marketing: market segmentation, target marketing, and market positioning; understand how different situations in the competitive environment will affect choices in target marketingn- Describe the major types of consumer buying behavior, the stages in the buyer decision process and completely outline the components of the marketing mix; identify how the firms marketing strategy and marketing mix must evolve and adapt to match consumer behavior and perceptions of the product (e.g., classification of products and services, brand image, price and value), the stage in the product life cycle and the competitive environment; summarize the importance of measuring and managing return on marketingn- Identify the roles of advertising, sales promotion, public relations, personal selling, and direct marketing in the promotion mix; compare and contrast integrated marketing communications with a non-integrated approach to the promotional mixn- Illustrate how the international trade system, economic, political-legal, and cultural environments in a foreign country affect a company’s international marketing decisions","reference books":"- WinerRusselS , “Marketing Management”, Prentice Hall of India, 1998.n- Guilitinan Joseph P , Gordon W Paul and Thomas J Maddaen, “Marketing Management: Strategies and Programs”, McGraw Hill Publication, 1996.n- Dolan Robert J, “Marketing Management: Text & Cases”, McGraw Hill Publication, 2000.n- Lamb Charles W and McDaniel Carl D., “Marketing”, South Western College Publication, 2004."}
