{"course code":"PRPE-20","course title":"Renewable Energy Systems","number of credits":"03","prerequisites":"Thermal Engineering (PRPC17),nFluid Mechanics and Machines (PRPC13)","course type":"PE","branch":"pie","course learning objectives":"- To provide knowledge of solar energy concept and applications.n- To impart knowledge of geothermal, ocean and tidal energy and their applications.n- To understand the design of wind mills and applications.n- To understand the turbines and generators for small scale hydroelectric generation.n- To understand the important parts of a biogas plant, design and principle of bio-diesel.","course content":"## Unit-InnEnergy Related Environmental Problems and Renewable Energy TechnologiesnAcid rain, ozone layer depletion, global climate change, history of solar energy, introduction and scope of solar energy, solar collectors and its applications, introduction and scope of bio energy, biogas, bio fuels and its applications, introduction to wind energy, wind energy potential in India and world, wind farms and mills & their applications, small scale hydroelectric, classification of small hydro power stations, advantages and limitations of small scale hydro-electric.nnn## Unit-IInnGeothermal and Oceans EnergynPotential sites, estimations of geothermal power, nature of geothermal sites, hot-dry rocks resources, magma resources, systems for energy generation, applications of geothermal energy, environmental issues, basic theory of ocean thermal energy conversion, potential and application of technologies, basic theory of wave energy, potential and technologies, basic theory of tidal energy, potential and technologies, methods of ocean thermal electric power generation.nnn## Unit-IIInnM.H.D. Generator and Thermoelectric GeneratorsnIntroduction, Principle of working, different types of M.H.D. generators, M.H.D. materials, M.H.D. power generation systems, economic aspects of M.H.D. generation.nIntroduction, thermoelectric effects, thermoelectric generator, types of thermoelectric generators, economic aspects of thermoelectric generation.nnn## Unit-IVnnFuel Cells and Hydrogen EnergynIntroduction, principle of fuel cells, thermodynamic analysis of fuel cells, types of fuel cells, fuel cell batteries, applications of fuel cells.nHydrogen as a renewable energy source, sources of hydrogen, fuel for vehicles, hydrogen production- direct electrolysis of water, thermal decomposition of water, biological and biochemical methods of hydrogen production.","course outcomes":"- Get the knowledge of solar concepts, solar collector and solar desalination.n- Get the knowledge of geothermal applications, energy generation, power generation by tidal energy.n- Get the knowledge of design of wind mills and energy estimations and also wind energy applications.n- Get the knowledge the turbines and generators for small scale hydroelectric generation and advantages and limitations of small scale hydro-electric.n- Get the knowledge of design of bio gas plant and bio diesel applications.","reference books":"- Twidell & A. W. Wier, Renewable energy resources, English Language book, Society I E & F N Spon (1986).n- N. K. Bansal, M. Kleeman & M. Mielee, Renewable Conversion Technology, Tata Mc Graw Hill, New Delhi.n- T. John and W. Tony, Renewable Energy Resources, Taylor & Francis."}
