{"course code":"PRPE-15","course title":"Composite Materials","number of credits":"03 Credits, 03 Lectures/week","prerequisites":"Material Science (PRPC15), Production Technology- I (PRPC16)","course type":"PE","branch":"pie","course content":"Course Learning Objective:nThe objective of this course is to impart the knowledge of various types of composites, their uses, properties, manufacturing, designing, testing and selecting a composite for particular requirement.nnn## Unit -InnIntroduction of Composite materials; concept of composite, application areas of composite materials, classification of composites, advantages of composites and their limitations, reinforcements; types of fibres and particles, matrix; types of matrix materials. [8 hrs]nnn## Unit -IInnFibres; glass fibres, carbon fibre, aramid fibre, boron fibre, ceramic & metallic fibres, properties and their manufacturing techniques, Matrices; metal matrix, polymer matrix, ceramic matrices, selection criteria, properties and manufacturing, [8 hrs]nnn## Unit -IIInnManufacturing of metal matrix composites; liquid infiltration, squeeze casting, ultrasonic stir casting, spray forming/thermal spraying, powder metallurgy, etc,, Manufacturing of polymer matrix composites; hand layup, spray-up, filament winding, pultrusion, etc, Ceramic matrix composites; slurry impregnation, sol-gel, chemical vapour deposition. Laminated composites; centrifugal casting, adhesive bonding, vacuum bagging, explosive bonding, etc. [10 hrs]nnn## Unit -VInnMechanics of composites; mass, volume fraction, density, mechanical properties; prediction of elastic constants, mechanics of load transfer from matrix to reinforcement, fatigue and fracture behaviour of composites, testing and failure analysis of the composites [8 hrs]nCourse outcome:n- The students will have the understanding of various types of composite materials, their properties and application area.n- The students will have the knowledge of manufacturing of different types of composites.n- The students will be able to select the existing or design the new composite materials for a particular requirement.n- The students will be able to evaluate the performance and cause of failure of composite materials in-service.","reference books":"- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.n- Groover, M.P., “Fundamentals of Modern Manufacturing”, John Wiley & Sons.n- Chawla, K.K., “Composite Material: Science & Technology”, Springer.n- Berbero, E.J., “Introduction to Composite Materials Design”, CRC Press.n- ASM Handbook, Volume 21: Composites, ASM InternationalnB.Tech (Production & Industrial Engineering) 5th SemesternB.Tech 5th (Production & Industrial Engineering) Semester Programme Elective (PE)"}
