{"course code":"PRPE -36","course title":"Total Quality Management","number of credits":"3","prerequisites":"Production Technology- IIn(PRPC18)","course type":"PE","branch":"pie","course objectives":"To understand concept of quality management and apply this knowledge to understand the working of corporate word.","course content":"## UNIT-InnConcept of QualitynProducts and services, quality of products and services, definition of quality, dimensions of quality and their measure. [4 hrs]nnn## UNIT-IInnQuality Management PracticesnVarious approaches to control and management of quality,: inspection oriented, statistical process control oriented, assurance oriented and TQM oriented approaches. [8 hrs]nnn## UNIT-IIInnCost of QualitynProductivity and quality relationship, concept of cost of quality, cost of conformance, prevention, appraisal and failure cost, internal and external failures, quality cost estimation in engineering and service industries [4 hrs]nnn## UNIT-IVnnOrganizing for QualitynCompany wide organization for quality management, prevention, control and improvement, continuous improvement process. [4 hrs]nnn## UNIT-VnnHuman Aspects in Management of QualitynCommitment, motivation, and involvement for quality, top management, management and worker participation, zero defects, quality circle, small group activity. [4 hrs]nnn## UNIT-VInnQuality SystemsnIntroduction, ISO 9000 Series of standards, Other quality systems, ISO 14000 series standards, concepts of ISO 14001, requirements of ISO 14001, EMS benefits. [6 hrs]nnn## UNIT-VIInnSome Case Studies TQMnMinimum four Case Studies to be explained. [4 hrs]","course outcomes":"- Upon completion of this course, the students will be able ton- Develop an understanding of quality management philosophies and framework.n- Discuss the need of customer expectations, employee involvement and supplier partnership.n- Analyze the TQM tools and techniques to improve the product and process quality.n- Apply modern tools to improve quality of the product.n- Describe ISO 9001, Environmental Management Standards and ISO 14001 Certification process.","reference books":"- Besterfield, D.H, Michna, C.B, Besterfield, G. H and Sacre, M.B, “Total Quality Management” Pearson Education Asia.n- Mukherjee, P. N., “Total Quality Management” Prentice Hall of India.n- Rajaram, S., “Total Quality Management” Biztantra.n- Ramasamy, S. “Total Quality Management” Mc Graw Hill Education."}
