{"course code":"PRPE-45","course title":"Energy Management","number of credits":"3","prerequisites":"Thermal Engineering (PRPC17), Fluid Mechanics and Machines (PRPC13)","course type":"PE","branch":"pie","course learning objectives":"- To understand the basics and importance of energy audit and apply them to address the practical applications.n- To understand the basic concepts and applications of heating and cooling management.n- To impart the knowledge to the students about various contemporary methods to utilize different sources of energy management.n- To impart the knowledge to the students about energy conservation management.","course content":"## Unit-1nnPlanning for Energy ManagementnInitiation phase, Audit and analysis phase, Implementation phase, General methodology for building and site energy audit, Site survey, Methodology, Site survey-electrical system, Steam and water systems, Building survey methodology, Basic energy audit instrumentation, Measurement for building surveys. [8 hrs]nnn## Unit-IInnManagement of Heating and CoolingnGeneral principles, The requirements for human comfort, Description of typical systems-dual duct HVAC system. Multi zone HVAC systems, Variable and volume systems, Terminal repeat system, Evaporative systems, Package system, Basic principle governing HVAC system, Package system, Basic principle governing HVAC system operation, Energy management opportunities in HVAC systems. [8 hrs]nnn## Unit-IIInnElectrical Load and Lighting ManagementnGeneral principles, illumination and human comfort, Basic principles of lighting system, Typical- illumination system and equipment, Fundamentals of single phase and 3 phase A.C. circuits, energy management opportunities for lighting systems, Motors and electrical heat, Electrical and analysis and their parameters, Peak, demand control. [10hrs]nnn## Unit-IVnnManagement of Process EnergynGeneral principles, Process heat, Combustion, Energy saving in condensate return, Steam generation and distribution, Automotive fuel control, Hot water and water pumping, Direct and indirect fired furnaces over, Process electricity, Other process energy forms-compressed air and manufacturing processes, Problems. [7 hrs]nThe Economics of Efficient Energy UsenGeneral consideration, Life cycle costing, Break-even analysis, Cost of money, Benefit/cost analysis, Pay back period analysis, Prospective rate of to return, Problems. [7 hrs]nCourse Outcome:n- The students will be able to understand importance of energy management.n- The students will be able to utilize concepts and applications of heating and cooling management in engineering applications.n- The students will be able to work on different contemporary methods to utilize sources of energy management.n- The students will be able to understand and make energy audit report.nReference Book:n1. Energy Management Principles by Criag B. Smith, Published by Pergamon Press."}
