{"course code":"PRPE-10","course title":"Plant Layout & Material Handling","number of credits":"3.0","prerequisites":"Production Technology-I (PRPC16)","course type":"PE","branch":"pie","course learning objectives":"The main objectives of this course aren- To enable the students to be acquainted with basic concepts of plant layout including the objectives of good layout, principles and MH systemsn- To study about selection of material handling equipments and site location.n- To explore the layout planning by following different algorithms, especially for designing of assembly line layout.n- To make the students understand the different production layouts, their applications, features and limitations","course content":"## Unit-InnBasic Concepts of Plant LayoutnIntroduction of plant layout, Principles and objectives of effective layout, Advantages of good layout, Factors influencing plant layout- Material, Machinery, Man, Movement, Waiting, Service etc. Types of plant layout, their features, applications and comparison. Selection of appropriate layout and breakeven analysis [06 hrs]nPlanning the LayoutnBasic steps in layout planning, computation of equipment requirements, plan general flow pattern, determination of space requirements, Tools and techniques of layout planning:- Operation process chart, Flow process chart, Flow diagram, String diagram, Travel Chart etc. [06 hrs]nnn## Unit-IInnQuantitative layout analysisnLoad distance analysis, Travel Chart, Operation Sequence analysis, Activity relationship chart, Systematic layout planning, Objectives of Line Balancing, Constraints in Line Balancing problems, Preventive measures to achieve a balanced production line, Types of Line Balancing; (a) Assembly Line Balancing (b) Fabrication Line Balancing, heuristic and other methods of Line Balancing. Numerical problems on Line Balancing. [06 hrs]nPlant LocationnObjectives of location decision, factors influencing location, General procedure of site selection, evaluation of location- breakeven analysis, Median model, gravity model, Factor rating methods, multi-attribute models and dimensional analysis model [06 hrs]nnn## Unit-IIInnMaterial HandlingnObjectives of material handling, Functions and principles of material handling, Methods of material handling, Types of material handling systems, Basic features of material handling, Various material handling considerations including combined handling, Space for movements.n[06 hrs]nMaterial Handling EquipmentnIntroduction, Types of material handling equipment, Selection and maintenance of material handling equipment, characteristics of material handling equipment such as Conveyers, Cranes, Hoist, Mobile equipment etc., Economical and Technical considerations of handling equipment.n[06 hrs]","course outcomes":"- The students will be able to select appropriate location for establishing industrial plants by applying the concepts of location selection.n- The students will be able to plan and design plant and production layouts through basic strategies.n- The students will be able to identify and analyze the problems in the existing layout/ material handling system and shall be able to modify the layout/ material handling systemn- The students will be able to apply basic concepts for planning layouts for typical applications in the industries and Suggesting appropriate material handling strategies in the industries.","reference books":"- Plant Layout and Materials Handling by G.K. Aggarwal, M/S Jain Brothers, New Delhin- Plant Layout and Design by James Moore, The Macmillan Co, New York.n- Practical Plant Layout by Richard Muthern- Manufacturing Plant Layout: Fundamentals and Fine Points of Optimum Facility Design by Edward J. Phillips, Society of Manufacturing Engineers"}
