{"course code":"PRPE-41","course title":"Soft Computing","number of credits":"3","prerequisites":"NIL","course type":"PE","branch":"pie","course learning objectives":"- To understand basics of Artificial Neural Network , Genetic Algorithm, Particle Swarm optimization and fuzzy logicn- To learn soft computing techniques so as to build computationally intelligent systems that possess human like abilities to reason, learn and handle the uncertainty and vagueness often inherent in real world problems.n- To solve complex practical problems for which conventional mathematical and analytical methods are inefficient.n- To implement the soft computing solutions using appropriate tools.","course content":"## UNIT-1nnIntroduction to soft computing, Hard Computing versus Soft Computing, Introduction to artificial neural network, Biological Neural network, Comparison between Artificial and Biological Neural Network , Model of an Artificial Neuron, Characteristics of Neural Network , Basic building blocks of Artificial Neural Network: Network Architecture, Learning methods, Activation function [5 hrs]nnn## UNIT-IInnMcCulloch Pitts Neuron Model, Simple perceptron model, Limitations of Perceptron Single layer feed forward network, Learning process in single layer feed forward network, Multi layer feed forward neural network, Back propagation learning, Stopping criteria, Problems with backpropagation [8 Hrs]nnn## UNIT-IIInnIntroduction to Genetic Algorithm, Advantages and Disadvantages, GA’s Basic Terms, Implementation of GA, Fitness function, genetic operators, Representation/Encoding Schemes, Selection of parents, cross over methods and rate, mutation operator and rate, Convergence of genetic algorithm, Optimizing numerical functions using GA, difference and similarities between GA and other traditional methods [9 hrs]nnn## UNIT-IVnnBasic Particle Swarm Optimization, Global Best PSO, Local Best PSO, gbest versus lbest PSO, Velocity Components, Algorithm Aspects: ( particle initialization, stopping conditions and defining the terms iteration and function evaluation) Social Network Structures, Basic PSO Parameters, Basic variations: velocity clamping, Inertia weights [6 hrs]nnn## UNIT-VnnFuzzy versus crisp, Crisp set Theory , operation on crisp sets, properties of crisp sets ,crisp relation, Fuzzy sets: Membership function, basic fuzzy set operations, properties of fuzzy setsn,fuzzy relations, Crisp logic, Predicate Logic, Fuzzy logic, Fuzzy quantifiers, Fuzzy inference, Fuzzy rule based system, De-fuzzification methods [12 Hrs]","course outcomes":"- Student will be able to understand concept of soft computing and fundamental theory and concepts of neural networksn- Student will be able to apply neural networks to prediction and pattern classification problemsn- Student will be able to apply Genetic Algorithm to solve optimization problemsn- Student will be able to apply Particle swarm optimization to solve optimization problemsn- Students will be able to apply fuzzy logic to solve engineering problems having uncertainty","reference books":"- Saroj Kauhik and Sunita Tiwari, Soft computing fundamentals, Techniques and Applications , McGraw Hill Education Private Limitedn- S. Rajasekaran & G. A. Vijayalakshmi Pai, Neural Networks, Fuzzy Logic and Genetic Algorithms: Synthesis & Applications, PHI, 2003.n- David.E. Goldberg, Genetic Algorithms in Search, Optimization and machine learning, Addison Wesley, 1999.n- S. N. Sivanandam & S. N. Deepa, Principles of Soft Computing, Wiley - India, 2007.n- Saroj Kaushik, Artificial Intelligence, Cengage Learning, 2007.n- M. Mitchell, An Introduction to Genetic Algorithms, Prentice-Hall, 1998.n- S. N. Sivanandam , Sumuthi & S. N. Deepa, Introduction to Neural Networks using MATLABn- S. N. Sivanandam , Sumuthi & S. N. Deepa, Introduction to fuzzy logic using MATLABn- Timothy ,J.Ross Fuzzy Logic with Engineering Applications,Wiley,2016nPRPE42 VEHICLE DYNAMICS"}
