{"course code":"PRPE-37","course title":"Experimental Design","number of credits":"03","prerequisites":"NIL","course type":"PE","branch":"pie","course learning objectives":"- To introduce the basic concepts of experimental design such as randomization, replication, blocking, hypothesis testing, regression, ANOVA etc.n- To expose students to different types of experimental designs like Latin Square Design, randomized block design nested designs etc.n- To understand the full factorial designs, fractional factorial designsn- To understand Taguchi’s DOE Approach and Response Surface Methodology","course content":"## UNIT-InnIntroduction:nObjectives for experimental designs, Basic design concepts, Steps for the design of experiments, Types of experimental designs, Analysis of Means, Experimental designs and six sigma (4 hrs)nCompletely Randomized Design:nModel for a completely randomized design with a single factor, ANOVA for a completely randomized design, Randomized Block Design, Incomplete Block Designs, Latin Square Design, Graeco-Latin Square Design (4 hrs)nnn## UNIT-IInnFull Factorial Designs with two Levels:nNature of Factorial Designs, Deleterious Effects of Interactions, Effect Estimates, The 23 Design, Built –In- Replication, Role of expected mean squares in experimental designn(5 hrs)nFractional Factorial Designs with two Levels:n2k-1 Designs, Effect Estimates and Regression Coefficients, 2k-2 Designs, Design Efficiency, John’s ¾ Designs (5 hrs)nnn## UNIT-IIInnRobust Designs:nDOE and Taguchi Approach, Experimental Design using orthogonal arrays; Experimental Designs With Two-Level Factors Only; Experimental Designs With Three and Four Level Factors; ANOVA; Analysis using Signal- to Noise Ratios; Some case studies; QT4 Softwaren(5 hrs)nResponse Surface Methodology:nResponse Surface Methodology; Response surface experimentation; Process improvement with Steepest Ascent; Analysis of Second-order response Surfaces; Central Composite Design; Box- Behnken Design; Analyzing the fitted surface; Design-Expert Software (5 hrs)nnn## UNIT-IVnnRegression:nSimple Linear Model, Least Squares line, Lack of fit test, Curvilinear Regression, Orthogonal polynomials. (5hrs)","course outcomes":"- Students will be able to become conversant with different types of experimental designsn- Students will be able to select a suitable design for undertaking experimental investigation in any field of engineeringn- Students will become capable to apply effectively Taguchi’s parameter design approach for solving all kinds of Industrial problemsn- Students will learn to use Response Surface Methodology for modelling and optimizing responses","reference books":"- Modern Experimental Design by Thomas P Ryan. John Wileyn- Response Surface Methodology by Myers R H and Montgomery D.C. John Wileyn- Design of Experiments using the Taguchi Approach by Ranjit K Roy. John Wileyn- Design and Analysis of Experiments by Montgomery D.C. Wiley Indian- Taguchi Methods: A Hands-On Approach by Glen Stuart Peace Addison-Wesley"}
