[
  {
    "course code": "CEIR11",
    "course title": "ENGINEERING MECHANICS",
    "course type": "EPR",
    "number of credits": "3",
    "prerequisites": "Knowledge of Applied Physics",
    "branch": "ce",
    "course content": "## Unit 1: Basic Concepts\n\nConcept of Rigid body and deformable bodies, Free body diagram, Types of beams, simple and continuous beams, type of supports and reaction.\nFundamentals of Determinate and Indeterminate structures, Analysis of plane trusses by method of joint and method of section, Analysis of Plane frames.\n\n\n## Unit 2: Stresses and Strains.\n\nConcept of stress and strain (linear, lateral, shear and volumetric), Hook’s law, elastic constants and their relationship, stress-strain diagrams for brittle, elastic and plastic materials, generalized Hook’s law.\nAnalysis of axially loaded members: Stresses, strains and deformations of the structures under concentrated loads, self-weight and temperature changes.\n\n\n## Unit 3: Shear Force and Bending Moment Diagram.\n\nConcept of shear force diagram and bending moment diagram. Relation between shear force, bending moment and intensity of loading. Shear force and bending moment diagrams for cantilevers and simple beams due to concentrated, uniformly distributed, uniformly varying loads and couples in beams\n\n\n## Unit 4: Bending Stresses and Shear Stresses\n\nTheory of simple bending, flexure formula, bending stress distribution, Shear stresses in beams, shear stress distribution",
    "reference books": "- Merian, J.L, Kraige, L.G. Engineering Mechanics – Statics, 5th Edition, Wiley Publishers, New-Delhi, 2007.\n- Beer & Johnston, Mechanics for Engineers, 4th Edition, McGraw – Hill, New Delhi, 1987.\n- Timoshenko, S.P., Young, D.H., Rao, J.V. Engineering Machines,4th Edition, McGraw-Hill, Singapore,1956.\n- Singer, F.L. Strength of Materials, Third Edition, Harper and Row Publishers, New York, 1980.\n- Hearn, E.J., Mechanics of Materials, Pergaman Press, England, 1972.\n- Beer and Johnston E. R. Mechanics of Materials, 3rd Edition, Tata McGraw Hill, New Delhi, 2007.\nCourse Outcome\n- Determine the static indeterminacy and kinematic indeterminacy of trusses and to analyse the trusses by using methods of joints or method of sections.\n- To define and evaluate the different kinds of stresses and strains by analytical methods.\n- To define and reason about fundamental structural concepts such as shear force, bending moment relations, functions. To draw Shear force and Bending Moment Diagrams for determinate beams.\n- To evaluate bending and shear stresses for different loading of variuous types of beams."
  },
  {
    "course code": "CEIR12",
    "course title": "ENGINEERING GRAPHICS",
    "course type": "EPR",
    "number of credits": "2",
    "prerequisites": "Knowledge of Applied Physics",
    "branch": "ce",
    "course content": "- Orthographic Projections\nTheory of orthographic projections, planes of projection, four quardrants, first angle projection, third angle projection, B.I.S. Code of practice, view analysis, orientation of the object, laying out three view drawings, hidden lines and curves surfaces, conventional lines, dimensioning and lettering, conversion of pictorial view into orthographic views, development of missing views.\nProjections of Points, Straight Lines and Planes\nPlanes in different quadrants, projections of lines parallel to one or both the planes, contained by one or both the planes, perpendicular to plane, inclined to one plane and parallel to other, inclined to both the planes, contained by a plane perpendicular to both the planes, true length of a line and its inclinations with the reference plane, trances of line. Types of planes, perpendicular planes, oblique planes, traces of planes, projections of planes parallel to one plane, perpendicular to both the planes, perpendicular to one plane and inclined to other plane.\nProjections of Solids\nTypes of solid-polyhedral, solids of revolution, projections of solids, axis perpendicular to one plane, axis parallel to both the planes, axis parallel to one plane and perpendicular to other plane, axis inclined to both the planes.\nSection planes, sections, true shape of sections, sections of prisms, pyramids, cylinders, cone placed in simple position.\nGraphical Statics\nGraphical methods, Basic concept, Bow’s notation, space diagram, force and polar diagram, funicular polygon, support and support reactions, analysis of trusses, compressive and tensile stresses, stresses in plane framed structures.",
    "reference books": "- Engineering Drawing- P.S.Gill (S.K.Kataria & sons, Ludhiana)\n- Elementary Engineering Drawing- N.D.Bhatt (Charotar Publishing House)\n- Graphic Statics- P.S.Gill (S.K.Kataria & sons, Ludhiana)\nCourse Outcome: After the completion of the course, students are able\n- To understand the concepts like dimensioning, conventions and standard related to working drawings in order to become professionally efficient.\n- To understand the theory of projections.\n- To draw orthographic projections of lines, planes and solids.\n- To draw sections of solids including cylinders, cones, prisms and pyramids.\n- To analyses different force system (concurrent and non-concurrent) by using graphical method."
  },
  {
    "course code": "CEPC12",
    "course title": "BUILDING CONSTRUCTION AND MATERIALS",
    "course type": "EPR",
    "number of credits": "3",
    "prerequisites": "None",
    "branch": "ce",
    "course content": "- CONSTRUCTION Masonry Construction\nIntroduction, various terms used, stone masonry-Dressing of stones, Classifications of stone masonry, safe permissible loads, Brick masonry-bonds in brick work, laying brick work, structural brick work-cavity and hollow walls, reinforced brick work, Defects in brick masonry, composite stone and brick masonry, glass block masonry.\nDoors and Windows\nLocations, sizes, types of doors and windows, fixures and fastners for doors and windows.\nAcoustics, Sound Insulation and Fire Protection\nClassification, measurement and transmission of sound, sound absorber, classification of absorbers, sound insulation of buildings, wall construction and accoustical design of auditorium, fire-resisting properties of materials, fire resistant construction and fire protection requirements for buildings.\nMATERIALS Stones\nClassification, requirements of good structural stone, quarrying, blasting and sorting out of stones, dressing, sawing and polishing, prevention and seasoning of stone.\nBrick and Tiles\nClassification of bricks, constituents of good brick earth, harmful ingredients, manufacturing of bricks, testing of bricks. Tiles, Terra-cotta, manufacturing of tiles and terra-cotta, types of terra-cotta, uses of terra-cotta.\nCement and Mortars\nCements composition, types of cement, manufacturing of ordinary Portland cement, testing of cement, special types of cement, storage of cement.\nMortars\nDefinition, proportions of lime and cement mortars, mortars for masonry and plastering.\nTimber\nClassification of timber, structure of timber, seasoning of timber, defects in timber, fire proofing of timber, plywood, fiberboard, masonite and its manufacturing, important Indian timbers.\nConcrete Constituents\nCement, tests on cement (physical tests), types of Portland cement, various types of cement- ordinary Portland cement, rapid hardening cement, low heat cement, sulphate resistant cement, portland-pozzolona cement, high strength Portland cement, high alumina cement, waterproof cement, white Portland cement, hydrophobic cement, coloured Portland cement. Aggregates, classification of aggregates based on petrographic, size, shape & texures,\ndeleterious substances in aggregates, bulking of fine aggregate, sieve analysis, grading of aggregates as per IS-383-1970. Fineness Modulus, Maximum size of aggregate. Quality of mixing water, curing water.\nPROPERTIES Of CONCRETE:\nIntroduction, workability, factors influencing workability, measurement of workability, requirements of workability, properties of hardened concrete, stress and strain characteristics of concrete, Young's modulus of concrete, creep and shrinkage of concrete, permeability of concrete, durability of concrete sulphate attack, fire-resistance, thermal properties of concrete, construction joints, expansion and contraction joints.\nSPECIAL CONCRETE\nLight weight concrete, definition and its properties, applications, high strength concrete, definitions, its properties and applications, mass concrete, waste material based concrete, shortcrete, fiber reinforced concrete: Materials. Fibers-types and properties, ferrocement, polymer concrete composites, heavy-weight concrete for radiation shielding.\n- DRAWINGS\n\n\nTypical drawings of\n- Typical drawings of\n- Cavity Wall\n- Bonds in brick work\n- Grillage foundation\n\n\n\nPreparation of building drawing mentioning its salient features including the following details:\n- Preparation of building drawing mentioning its salient features including the following details:\n- Ground floor plan\n- Two Sectional Elevations\n- Front and Side Elevations\n- Plan and Sectional Elevation of stair case, doors/ windows/ ventilators, floor and roof.",
    "reference books": "- Building Construction, Sushil Kumar, Standard Pub., N. Delhi\n- Building Material, Rangawala\n- Construction Engineering, Y.S. Sane\n- Building Construction, Gurcharan Singh, Standard Pub., N. Delhi\nCorse Outcome: On completion of the course, the students will be\n- Able to identify the various building materials with symbols.\n- Able to identify the properties of building materials.\n- Made acquainted with the manufacturing process of basic construction materials.\n- Made acquainted with the masonry construction and finishes\n- Aware of building services, acoustics, DPC, etc."
  },
  {
    "course code": "CEPC14",
    "course title": "STRUCTURAL ANALYSIS-I",
    "course type": "PC",
    "number of credits": "3",
    "prerequisites": "Engineering Mechanics",
    "branch": "ce",
    "course content": "- Introduction\nFluid properties, mass density, specific weight, specific volume and specific volume and specific gravity, surface tension, capillarity, pressure inside a droplet and bubble due to surface tension, compressibility viscosity, Newtonian and Non-newtonian fluids, real and ideal fluids.\nKinematics of Fluid Flow\nStready & unsteady, uniform and non-uniform, laminar & turbulent flows, one, two & three dimensional. flows, stream lines, streak lines and path lines, continuity equation in differential form, rotation and circulation, elementary explanation of stream function and velocity potential, rotational and irrotational flows, graphical and experimental methods of drawing flownets.\nFluid Statics:\nPressure-density-height relationship, gauge and absolute pressure, simple differential and sensitive manometers, two liquid manometers, pressure on plane and curved surfaces, center of pressure, Buoyancy, stability of immersed and floating bodies, determination of metacentric height, fluid masses subjected to uniform acceleration, free and forced vortex.\nDynamic of Fluid Flow\nEuler's equation of motion along a streamline and its integration, limitation of Bernoulli’s equation, Pitot tubes, venturimeter, Orficemeter, flow through orifices & mouth pieces, sharp crested weirs and notches, aeration of nappe.\nLaminar Flow:\nNavier Stoke's equation, Laminar flow between parallel plates, Couette flow, laminar flow through pipes-Hagen Poiseuille law, laminar flow around a sphere-Stokes'law.\nFlow through pipes\nTypes of flows-Reynold's experiment, shear stress on turbulent flow, boundary layer in pipes- Establishment of flow, velocity distribution for turbulent flow in smooth and rough pipes, resistance to flow of fluid in smooth and rough pipes, Stanton and Moody's diagram. Darcy's weisbach equation, other energy losses in pipes, loss due to sudden expansion, hydraulic gradient and total energy lines, pipes in series and in parallel, equivalent pipe, branched pipe, pipe networks, Hardy Cross method, water hammer.\nDrag and Lift\nTypes of drag, drag on a sphere, flat plate, cylinder and airfoil, development of lift on immersed bodies like circular cylinder and airfoil.\nDimensional Analysis and Hydraulic Similude\nDimensional analysis, Buckinghum theorem, important dimensionless numbers and their significance, geometric, kinematic and dynamic similarity, model studies, physical modeling, similar and distorted models.",
    "reference books": "- Theory and application of fluid Mechanics including Hydraulic Mechanics by K Subramanya\n- Introduction to Fluid Mechanics by Robert N.Fox & Alan T.Macnold\n- Hydraulic and Fluid Mechanic by P.N.Modi & S.M.Seth\n- Introduction to Fluid Mechanics by Robert W.Fox & Alan T.McDonald\n- Fluid Mechanics Through Problems by R.J.Garde\n- Engineering Fluid Mechanics by R.J.Garde & A.G.Mirajgaoker"
  },
  {
    "course code": "CELR12",
    "course title": "MATERIAL TESTING (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "",
    "branch": "ce",
    "course content": "Tests on Cement\n- Standard consistency of cement using Vicat's apparatus.\n- Fineness of cement by Sieve analysis and Blaine's air permeability method.\n- Soundness of cement by Le-Chatelier's apparatus.\n- Setting time of cement, initial and final.\n- Compressive strength of cement.\n- Measurement of specific gravity of cement.\n- Measurement of Heat of Hydration of cement.\nTests on Aggregate\n- Moisture content and bulking of fine aggregate.\n- Fineness modulus of coarse and fine aggregates.\nTests on Concrete\n- Workability of cement concrete by (a) Slump test, (b) Compaction factor test, (c) Flow table test\n- Compressive strength of concrete by (a) Cube test, (b)Cylinder test\n- Indirect tensile strength of concrete-split cylinder test.\n- Modules of rupture of concrete by flexure test\n- Bond strength between steel bar and concrete by pull-out test\n- Non-destructive testing of concrete\nTests on other materials\n- Bending test on timber and plywood.\n- Compression test on timber.\n- Compressive strength, water absorption and efflorescence test on bricks.\n- Flexural strength of flooring and roofing tiles.\n- Abrasion test of flooring tiles: marble and mosaic tiles.\n- Tensile Strength, elongation, proof stress and ultimate strength of Steel Bars"
  },
  {
    "course code": "CELR14",
    "course title": "FLUID MECHANICS (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "",
    "branch": "ce",
    "course content": "Fluid Mechanics – Laboratory Experiments\n- To determine metacentric height of the ship model.\n- To verify the Bernoulli's theorem.\n- To determine coefficient of discharge for an Orificemeter/ venturimeter.\n- To determine coefficient of discharge for an Orifice under variable head.\n- To calibrate a given notch.\n- To study velocity distribution in a rectangular open channel.\n- To determine the coefficient of drag by Stoke's law for spherical bodies.\n- To study the phenomenon of cavitation in pipe flow.\n- To determine the critical Reynold's number for flow through commercial pipes.\n- To determine the coefficient of discharge for flow over a broad crested weir.\n- To study the characteristics of a hydraulic jump on a horizontal floor and sloping glacis including friction blocks.\n- To study the momentum characteristics of a given jet.\n- To determine head loss due to various pipe fittings."
  },
  {
    "course code": "CEPC21",
    "course title": "STRUCTURAL ANALYSIS-II",
    "course type": "PC",
    "number of credits": "3",
    "prerequisites": "Structural Analysis – I\n1 Analysis of continuous beam and frames\nSlope deflection method, moment distribution method, Kani’s method, Approximate analysis of frames for vertical and lateral loads\nUnsymmetrical Bending\nIntroduction Centroidal principal axes of sections, Bending stresses in beam subjected to unsymmetrical bending, shear centre, shear centre for channel, Angles and Z sections.\nRolling Loads and Influence lines Diagrams\nIntroduction, Single concentrated load, uniformly distributed load longer than span, shorter than span , two point loads, several point loads, Max.B.M. and S.F.Absolute, Max.B.M.\nIntroduction, influence lines for three hinged and two hinged arches, load position for Max.S.F. and B.M. at a section in the span.\nMuller-Breslau Principle, I.L. for B.M. & S.F. for continuous Beams.\nAnalysis of Arches:\nThree Hinge Arches: Horizontal thrust, shear force and Bending Moment diagram Two Hinge Arches: Parabolic and circular arches, Bending Moment Diagram for various loadings, temperature effets, web shortening, Axial thrust and Radial Shear force diagrams.\nFixed Arches: Expression for Horizontal thrust and Bending Moment at a section, elastic centre\nCourse Outcome\n- To analysis the structures using different displacement methods\n- To understand the behaviour of structure under unsymmetrical bending\n- To understand influence line diagram and be able to draw influence lines for various functions of determinate and indeterminate structures\n- To analyse the arches\nReferences Books\n- Indeterminate structures, R.L.Jindal S.Chand & Co.,N.Delhi.Advanced Structural Analysis-A.K.Jain, NemChand & Bros.,Roorkee.\n- Structural Analysis-A Unified Approach, D.S.Prakash Rao,, University Press, Hyderabad.\n- Structural Analysis-A unified classical & Matrix Approach, A.Ghali & A.M.Neville,Chapman & Hall London.\n- Theory of Strucutres,- Vol. I&II,- S.P.Gupta & G.S.Pandit, Tata McGraw Hill, N.Delhi.",
    "branch": "ce",
    "course objectives": "- To understand the importance of surveying in Civil engineering\n- To study the basic of linear/angular/direction measurements using chain/tacheometer/compass and theodolite and their applications\n- To study the method of determination of height of points using various leveling method and Tacheometer\n- To study the significance of Plane Table surveying in preparation of map and setting of different types of curves\n- To study the determination of coordinates using satellite based method",
    "course content": "## UNIT-I\n\n- Basics of Surveying: Definition, objects, classification, f u nd a me n t a l principles, methods of fixing stations, concept of Geoid and reference spheroids,\n- Linear measurement: Direct measurement, instruments for measuring distance, instruments for making stations, chaining of line, errors in chaining, tape corrections examples, Chain traversing\n- Direction Measurement: Bearings and angles; Compass surveying- magnetic bearings, prismatic and surveyors compass, declination, local attraction errors and adjustments; Methods of compass traversing, checks in traversing, adjustment of closed traverse,\n\n\n## UNIT-II\n\n- Angle Measurement: Theodolite: Theodolites, temporary adjustment of theodolite, measurement of horizontal and vertical angles, the odoli t e traverse.\n- Leveling: Definition of terms used in leveling, types of levels and staff, temporary adjustment of levels, principles of leveling, spirit and trigonometric levelling, reduction of levels, booking of staff readings, plane and geodetic trigonometric levelling, correction due to curvature and refraction, axis signal correction, Contouring, contour, characteristics of contours lines, locating contours, interpolation of contours, use of contours.\n\n\n## UNIT-III\n\n- Plane Table Surveying: Plane table accessories, various methods of plane table surveying, two point and three point problems, sources of error, advantages and disadvantages\n- Curves: Classification of curves, elements of simple circular curve, location of tangent points-chain and tape methods, instrumental methods, examples of simple curves Transition Curves-Length and types of transition curves, length of combined curve, examples. Vertical C u r v e s : Necessity and types of vertical curves, setting out of a vertical curve by tangent correction, chord gradient and sight distance method.\n\n\n## UNIT-IV\n\n- Tacheometry: Principle of tacheometry, stadia and tangential method of tacheometry\n- GNNS: Global Navigation Satellite System (GNSS): basic concepts, History of GPS, GPS design objectives and details of segments: space, control and user. Brief of different GPS systems, including, NAVSTAR GPS, GLONASS, GALILEO,IRNSS, BeiDou etc, Advantages and limitations of GPS. GPS Signal structure: Carriers frequencies, GPS codes: C/A, P, navigational message, GPS receiver: Types. Principles of GPS position fixing, Pseudo ranging and carrier phase, GPS errors.",
    "reference books": "Surveying volume I and II: B C Punmia Engineering Surveying (Sixth Edition): W. Schofield Text Book of Surveying: C.Venkataramiah\nIntroduction to GPS: The Global Positioning System: Ahmed El-Rabbany Various Online resources including NPTEL",
    "course outcomes": "On completion of the course, the students would be able to: carry out surveying in the field for various civil engineering projects, prepare a contour map and plan of the area, taking accurate measurements with different surveying instruments, adjustment of traverse, understand the process of setting of different curves for road and railway designs"
  },
  {
    "course code": "CEPC25",
    "course title": "DESIGN OF STEEL STRUCTURES",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Knowledge of Structural Analysis-I",
    "branch": "ce",
    "course content": "- Elementary Limit Analysis and Design\nIntroduction, Scope of plastic analysis, ultimate load carrying capacity of tension members and compression members, flexural members, shape factor, mechanisms, plastic collapse, analysis, plastic analysis applied to steel beams and simple portal frames and design.\nConnections\nImportance, various types of connections, simple and moment resistant, riveted, bolted and welded connections.\nDesign of Tension Members\nIntroduction, types of tension members, net sectional areas, design of tension members, lug angles and splices.\nDesign of Compression Members\nIntroduction, effective length and slenderness ratio, various types of sections used for columns, built up columns, necessity, design of built up columns, laced and battened columns including the design of lacing and battens, design of eccentrically loaded compression members.\nDesign of Beams\nIntroduction, types of sections, general design criteria for beams, design of laterally supported and unsupported beams, design of built up beams, web buckling, web crippling and diagonal buckling.\nPlate Girder\nIntroduction, elements of plate girder, design steps of a plate girder, necessity of stiffeners in plate girder, various types of stiffeners, web and flange splices (brief introduction), Curtailment of flange plates, design beam to column connections: Introduction, design of framed and seat connection.\nColumn Bases and Footings\nIntroduction, types of column bases, design of slab base and gussested base, design of gussested base subjected to eccentrically loading, design of grillage foundations.\nBeam Column\nIntroduction, bending about one axis, bending about both axes, boundary constraints, design considerations\nRoof Trusses\nTypes and compoenents of roof truss, estimation of wind load, design of purlin with and without sag rod, lateral bracing and design of roof truss.\nCold Formed Sections\nIntroduction and brief description of various type of cold formed sections, local buckling, concepts of effective width and effective sections, elements with stiffeners, design of compression and bending elements.",
    "reference books": "- Design of Steel Structures, A.S.Arya & J.L.Ajmani, Nem chand & Bros., Roorkee.\n- Design of Steel Structures, M.Raghupati, TMH Pub., New Delhi.\n- Design of Steel Structures, S.M.A.Kazmi & S.K.Jindal, Prentice Hall, New Delhi.\n- Design of Steel Structures, S.K.Duggal, TMH Pub., New Delhi.\nCorse Outcome: On completion of the course, the students shall be able to:\n- Design Tension Members, Lug Angles and Splices.\n- Design Compression Members, Built-Up Compression Members.\n- Design a Welded and Riveted connection.\n- Design Plate Girders and Gantry Girders.\n- Design Roof trusses, Purlin, joints and end bearings of Steel Structures."
  },
  {
    "course code": "CEPC27",
    "course title": "WATER SUPPLY AND TREATMENT",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To make the students conversant with sources of water and types of water demand\n- To understand the basic characteristics of water and its determination\n- To expose the students to understand components of water supply scheme\n- To provide adequate knowledge about the water treatment processes and its design\n- To have adequate knowledge on water conveyance and distribution network",
    "course content": "- Water Quantity\nImportance and necessity of water supply scheme. Components of water supply scheme, water demands and its variations. Population forecasting, estimation of total quantity of water requirement, quality and quantity of surface and ground water sources, selection of a source for water supply, types of intakes, pumps and pumping stations.\nWater Quality\nSources of impurities, type of impurities in water and their sanitary significance, physical, chemical and bacteriological analysis of water, water quality standards.\nWater Treatment\nObjectives, treatment processes and their sequence in conventional water treatment plant, aeration, sedimentation – plain and aided with coagulation- types, features and design aspects, mixing basins and flocculation units. Filtration – mechanisms, types of filters - slow and rapid sand filtration units (features and design aspects), disinfection - theory, methods and practices, specific water treatment methods\nWater Conveyance and Distribution\nHydraulic design of pressure pipe, pipe materials, types of distribution system – gravity system, pumping system, dual system, layout of distribution system – dead end system, grid iron system, ring system, radial system, their merits and demerits, distribution reservoir - functions and determination of storage capacity.",
    "reference books": "- Water Supply and Sewerage: E.W. Steel.\n- Water Supply Engineering: S.R. Kshirsagar.\n- Water Supply Engineering: S.K. Garg.\n- Water Supply Engineering: B.C. Punmia.\n- Environmental Engineering: Peavy H. S., Rowe D. R. and Tchobanoglous G.\n- Introduction to Environmental Engineering: Davis M. L. and Cornwell D. A.\n- Water Supply and Sanitary Engineering: Birdie, G. S. and Birdie\n- Manual on Water Supply and Treatment: Ministry of Urban Dev., New Delhi.",
    "course outcomes": "On completion of the course, the students will be able to\n- Forecast the population and estimate water demand\n- Analyze various water quality parameters\n- Differentiate various intake structures\n- Design various water treatment units and distribution network"
  },
  {
    "course code": "CEPC29",
    "course title": "IRRIGATION ENGINEERING",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course content": "- Introduction\nIrrigation-necessity, impact of irrigation on human environment, need and historical development of irrigation in India, National water policy- Haryana Scenario, crops and crop seasons with crop water requirement.\nSoil-water relationship and irrigation methods\nSoil-water relationship, infiltration, basic terminology such as field capacity, wilting point, deltas, duty of water, flooding methods, border strip method, check basin and furrow method, assessment of irrigation water, sprinkler irrigation and its design, drip irrigation & its design.\nCanal irrigation\nComponents of canal distribution system, alignment & losses of channels, Kennedy’s and Lacey’s theories and design procedure, Garrets and Lacey’s diagrams.\nWater logging and land reclamation\nWater logging-effects, causes & preventive measures, lining of irrigation channels with types & design of lined channel, land drainage, open & closed drains design considerations, advantages of tile drains, discharge and spacing of closed drains, methods of land reclamation, quality of irrigation water.\nRiver Training\nRiver training and its objectives, classification of river training works, methods of river training, marginal embankments, guide banks, spurs, cutoffs, bank pitching and launching apron.\nCanal outlets\nClassification, requirements of a good outlet, design of pipe, APM and open flume outlet, flexibility proportionality, setting and sensitivity of outlet.\nDiversion canal head works\nVarious components and their functions, layout plan, Bligh’s creep theory, Khosla’s method of independent variables, use of Khosla’s curves, various corrections.\nRegulation works\nCanal falls-necessity and location, roughening devices, design of Sarda type fall. Off-take alignment, cross-regulator and distributory head regulators, devices to control silt entry into the off-taking channel and silt ejector, canal escapes.",
    "reference books": "- Sharma, S.K., Principles and Practice of Irrigation Engg., S.Chand & Co, 1984.\n- Arora K R “Irrigation Water Power & Water Resources Engineering” Standard Publishers & Distributors, Delhi, 2002.\n- Garg S K “Irrigation Engineering & Hydraulic Structures” Khanna Publisherts, Delhi, 1995.\n- Varshney, Gupta & Gupta “Irrigation Engineering & Hydraulic Structure” Nem Chand & Bros., Roorkee, 1982.\n- Punmia, B.C., Irrigation and Water Power Engineering, Standard Publishers, 2001.\n- Modi P N “ Irrigation ,Water Resources and Water Power Engg” Standard Book House N Delhi 2000\n- A M Michael “Irrigation Theory and Practice” Vikas Publishing House Pvt Ltd N Delhi 2011"
  },
  {
    "course code": "CELR21",
    "course title": "STRUCTURAL ANALYSIS (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "Knowledge of Structural Analysis-I",
    "branch": "ce",
    "course content": "- Verification of reciprocal theorem of deflection using a simply supported beam.\n- Verification of moment area theorem for slopes and deflections of the beam.\n- Deflections of a truss- horizontal deflections & vertical deflections of various joints of a pin- jointed truss.\n- Elastic displacements (vertical & horizontal) of curved members.\n- Experimental and analytical study of 3 hinged arch and influence line for horizontal thrust.\n- Experimental and analytical study of behaviour of struts with various end conditions.\n- To determine elastic properties of a beam.\n- Experiment on a two hinged arch for horizontal thrust & influence line for\n- Horizontal thrust\n- Experimental and analytical study of a 3 bar pin jointed Truss.\n- Experimental and analytical study of deflections for unsymmetrical bending of a Cantilever beam.\n- Experimental and analytical study of an elastically coupled beam.\n- Sway in portal frames - demonstration.\n- To study the cable geometry and statics for different loading conditions.\nCorse Outcome: On completion of the course, the students shall be able to:\n- Verification of reciprocal theorem and moment area theorem\n- Analysis of truss and curved members\n- Analysis of three hinge arches\n- Determine elastic properties of beam and analysis of struts"
  },
  {
    "course code": "CELR23",
    "course title": "SURVEYING-I (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "",
    "branch": "ce",
    "course content": "- Chain Traversing\n- Compass Traversing\n- Differential Leveling\n- Fly Levelling\n- Cross Sectioning\n- Profile leveling\n- Plane Table surveying: Radiation and Intersection\n- Resection- 2 and 3-point problem with plane Table\n- Working with digital level",
    "course outcomes": "- On completion of the course, the students will be able to:\n- Use conventional surveying tools such as chain/tape, compass, plane table, levels in the field for various civil engineering applications.\n- Enter observation in field book, adjusting and plotting a traverse\n- Use plane table to prepare map of a small area."
  },
  {
    "course code": "CELR25",
    "course title": "ENVIRONMENTAL ENGINEERING –I (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To analyze the physical and chemical characteristics of water\n- To quantify chlorine requirement for disinfection\n- To quantify the chemical requirement for turbidity removal\n- To study bacterial contamination of water",
    "course content": "Physical, chemical and bacteriological characterization of water and chemical dose determination for water treatment by performing following laboratory experiments:\n- To determine the pH value of a given sample of water\n- To determine the turbidity of a given water sample\n- To determine free residual chlorine in a given sample of water\n- To determine the conductivity of a given water sample\n- To determine the chloride concentration in a given sample of water\n- To determine the optimum coagulant dose\n- To determine the temporary and permanent hardness in a given water sample.\n- To determine the chlorine dose required for a given water sample\n- To determine the dissolved oxygen (DO) in a given sample of water.\n- To determine the MPN coliform per 100 ml of a given sample of water\n- To determine the total plate count of a given water sample\n- Microscopic studies of water",
    "course outcomes": "On completion of the course, the students will be able to\n- Apply different analysis techniques for the measurement of physical and chemical parameters of wastewater\n- Quantify the pollutant concentration in water and wastewater\n- Recommend the degree of treatment required for the water\n5. Assess the microbial contamination in water"
  },
  {
    "course code": "CEPC22",
    "course title": "DESIGN OF CONCRETE STRUCTURES-I",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Knowledge of Structural Analysis\nCourse Assessment: Continuous assessment (through assignments/Mid-semester Evaluation), End semester Examination.",
    "branch": "ce",
    "course content": "- Soil Formation and Composition\nIntroduction, soil and rock, Soil Mechanics and Foundation Engineering, origin of soils, weathering, soil formation, major soil deposits of India, particle size, particle shape, interparticle forces, soil structure, principal clay minerals.\nBasic Soil Properties\nIntroduction, three phase system, weight-volume relationships, soil grain properties, soil aggregate properties, grain size analysis, sieve analysis, sedimentation analysis, grain size distribution curves, consistency of soils, consistency limits and their determination, activity of clays, relative density of sands.\nClassification of soils\nPurpose of classification, classification on the basis of grain size, classification on the basis of plasticity, plasticity chart, Indian Standard Classification System.\nPermeability of Soils\nIntroduction, Darcy's law and its validity, discharge velocity and seepage velocity, factors affecting permeability, laboratory determination of coefficient of permeability, determination of field permeability, permeability of stratified deposits.\nEffective Stress Concept\nPrinciple of effective stress, effective stress under hydrostatic conditions, capillary rise in soils, effective stress in the zone of capillary rise, effective stress under steady state hydro- dynamic conditions, seepage force, quick condition, critical hydraulic gradient, two dimensional flow, Laplace's equation, properties and utilities of flownet, graphical method of construction of flownets, piping, protective filter.\nCompaction\nIntroduction, role of moisture and compactive effect in compaction, laboratory determination of optimum moisture content, moisture density relationship, compaction in field, compaction of cohesionless soils, moderately cohesive soils and clays, field control of compaction.\nVertical Stress Below Applied Loads\nIntroduction, Boussinesq's equation, vertical stress distribution diagrams, vertical stress beneath loaded areas, Newmark's influence chart, approximate stress distribution methods for loaded areas, Westergaard's analysis, contact pressure.\nCompressibility and Consolidation\nIntroduction, components of total settlement, consolidation process, one-dimensional consolidation test, typical void ratio-pressure relationships for sands and clays, normally consolidated and over consolidated clays, Casagrande's graphical method of estimating pre- consolidation pressure, Terzaghi's theory of one-dimensional primary consolidation, determination of coefficients of consolidation, consolidation settlement, Construction period settlement, secondary consolidation.\nShear Strength\nIntroduction, Mohr stress circle, Mohr-Coulomb failure-criterion, relationship between principal stresses at failure, shear tests, direct shear test, unconfined compression test, triaxial compression tests, drainage conditions and strength parameters, Vane shear test, shear strength characteristics of sands, normally consolidated clays, over-consolidated clays and partially saturated soils, sensitivity and thixotropy.\nEarth Pressure\nIntroduction, earth pressure at rest, Rankine's active & passive states of plastic equilibrium, Rankine's earth pressure theory, Coulomb's earth pressure theory, Culmann's graphical construction, Rebhann's construction.",
    "reference books": "- Gopal Ranjan, ASR Rao, Basic and Applied Soil Mechanics, New Age Intetrnational\n(P) Ltd. Publishers- N.Delhi, Edition No. - 3rd, 2016.\n- Alam Singh, Soil Engg. In Theory and Practice, Vol .I, Fundamentals and General Principles, CBS Pub.,N.Delhi.\n- S.K.Gulati, Engg.Properties of Soils, Tata-Mcgraw Hill, N.Delhi.\n- P.Purshotam Raj, Geotechnical Engg, Tata Mcgraw Hill, N.Delhi, Edition No.- I, 1995.\n- B.M.Das, Principles of Geotechnical Engineering, PWS KENT, Boston.\nCourse Outcome: On completion of this course, the student will be able to:\n- Understand the formation and structure of soils.\n- Understand the index properties of soil\n- Understand the permeability of soils and factors affecting permeability\n- Understand the concept of seepage\n- Understand Mechanism of compaction, factors affecting, and effects of compaction on soil properties\n- Understand the knowledge of consolidation of soils\n- Understand stress distribution in soils for point loads and areas of different shapes\n- Understand the shear strength of soils.",
    "course learning objectives": "- To explain how three phase system is used in soil and how are soil properties estimated using three phase system\n- To explain the role of water in soil behaviour and how soil stresses, permeability and quantity of seepage including flow net are estimated\n- To emphasis the importance of soil stress distribution and stress influence due to varies loads.\n- To explain how soil shear parameters are affected by drainage conditions\n- To explain mechanism of compaction, factors affecting, and effects of compaction on soil properties\n- To estimate the magnitude and time-rate of settlement due to consolidation."
  },
  {
    "course code": "CEPC26",
    "course title": "TRANSPORTATION ENGINEERING –I",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Geotechnical-I, Surveying-I",
    "branch": "ce",
    "course learning objectives": "- To understand the importance of transportation, characteristics of road transport, highway planning, alignment and surveys\n- To know the geometric design of highways\n- To study the traffic characteristics, traffic control devices and principles of signal / intersection design\n- To learn the characteristics, properties and testing procedures of aggregate and bituminous materials\n- To know about granular and bituminous mixes and their designs",
    "course content": "## UNIT-I\n\n- Triangulation and Trilateration: Triangulation systems, classification, strength of figure, selection of triangulation stations, grade of triangulation, field work of triangulation, triangulation computations, Trilateration- Principle, Methods, advantages and disadvantages, introduction to total station\n- Survey layout/setting out: Introduction, controls for layout, examples of laying out\n\n\n## UNIT-II\n\n- Survey Adjustment and computations: Definitions, types of error, weight of an observation, law of weights, most probable values, principle of least squares, method of correlates, normal equation, adjustment of triangulation figures by method of least squares.\n\n\n## UNIT-III\n\n- Astronomy: Definitions of astronomical terms, celestial coordinate systems, Napier's rule of circular parts, star at elongation, star at prime vertical star at horizon, star at culmination, Astronomical triangle, Time: definitions of sidereal, apparent, solar and mean solar time, equation of time\n- Elements of Photogrammetry: Introduction, types of photographs, Terrestrial and aerial photographs, aerial , camera, scale and height displacements of vertical photographs, Stereoscopic vision and stereoscopes, height determination from parallax measurement, flight planning, principle of photo interpretation.\n\n\n## UNIT-IV\n\n- Introduction to remote sensing: Definition of Remote Sensing, types of remote sensing, remote sensing system and components. EMR source and characteristics, active and passive remote sensing, EMR propagation through medium, Role of atmosphere, Atmospheric windows, EMR interaction with objects, Spectral signature, EMR interaction with vegetation, soil and water. Satellite orbits and platforms: Geostationary and sun synchronous satellites, Resolution, Applications of remote sensing in civil engineering\n- Geographical Information System (GIS): Definition, and Objectives, Components of GIS, Spatial data models: Raster and Vector, Data inputting in GIS, Linkage between spatial and non spatial data, Spatial data analysis: Vector and raster based spatial data analysis, Integration of RS and GIS data, Digital Elevation Model, GIS Software Packages.",
    "reference books": "- Chang.T.K. 2002: Geographic Information Systems, Tata McGrawHill\n- Punmia, B.C. 2005: Surveying I and II, Luxmi Publications\n- Charles D. Ghilani: Adjustment Computations: Spatial Data Analysis (Fifth Edition)\n- Paul R Wolf: Elements of Photogrammetry\n- G S Srivastava: An introduction to Geoinformatics\n- Basudeb Bhatta: Remote Sensing and GIS\n- G. L. Hosmer: Text-book on Practical Astronomy\n- Various Online resources including NPTEL\nCourse Outcome:\nStudents would be able to know about advanced methods of locating horizontal controls, set out various civil engineering structures, learn about different types of time and solution of astronomical triangle, apply corrections to the measurements for different errors, understand the difference between aerial photograph and satellite images and their use in map making.",
    "course outcomes": "At the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to highway engineering.\n- Design geometrics, signals and intersections, make investigations, use modern tools and develop solutions to highway problems including safety of road users.\n- Understand the engineering solutions in societal and environmental context for sustainable development that takes care of pollution and environment.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/IRC/MoRTH specifications.",
    "course objectives": "- To understand the principle of surveying on very large scale by locating precise horizontal controls\n- To learn about surveying applications in setting out works\n- To learn about determining absolute positions of a point using celestial measurements\n- To learn about different types of errors in measurements and their adjustment\n- To introduce the basic concept of photogrammetry, Remote sensing, and GIS"
  },
  {
    "course code": "CELR22",
    "course title": "COMPUTATIONAL HYDRAULICS (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "",
    "branch": "ce",
    "course objectives": "COMPUTATIONAL HYDRAULIC LABORATORY\nTo provide student skill in problem solving in water resources engineering",
    "course content": "- Analysis and design packages in rainfall –runoff modeling\n- Analysis and design packages flood routing\n- Analysis and design packages in water balance model\n- Analysis and design packages in reservoir operation\n- Analysis and design packages for hydraulic structures\n- Design packages for pipe network analysis",
    "course outcomes": "Students will be able to apply software skills in the field of water resources engineering"
  },
  {
    "course code": "CELR24",
    "course title": "SURVEYING-II (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "",
    "branch": "ce",
    "course content": "- Study of theodolite\n- measurement of horizontal /Vertical angle with theodolite\n- Measurement of Tacheometric constants\n- C a l c u l a t i n g horizontal d i s t a n c e and elevations using tacheometer.\n- Study of Total Station\n- Measurements of distance, elevation, coordinate with total station\n- Special problems with Total station\n- Plan and contour map with a total station and software (including AutoCAD)",
    "course outcomes": "On completion of the course, the students will be able to:\n- Use the theodolite for measuring angles and using tacheometer to determine distance and elevation.\n- Use a total station to measure distance, elevation and coordinates\n- Use total station to plot a map of given area with softwares"
  },
  {
    "course code": "CELR26",
    "course title": "SOIL MECHANICS (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To estimate index properties of soils.\n- To estimate consistency limits of fine grained soils.\n- To estimate shear strength of soil by direct shear test, triaxial shear test & unconfined compressive test.\n- To estimate the engineering properties of the soils by density tests & permeability test.",
    "course content": "- Visual Soil Classification and water content determination.\n- Determination of specific gravity of soil solids.\n- Grain size analysis-sieve analysis.\n- Atterberg’s Limits determination.\n- Field density by:\n\n\n\nSand replacement method\n\n\nCore cutter method\n- Sand replacement method\n- Core cutter method\n- Standard Proctor compaction test.\n- Coefficient of permeability of soils.\n- Unconfined compressive strength test.\n- Direct shear test on granular soil sample.\n- Unconsolidated undrained (UU) triaxial shear test of fine grained soil sample.",
    "reference books": "- Gopal Ranjan, ASR Rao, Basic and Applied Soil Mechanics, New Age Intetrnational\n(P) Ltd. Publishers- N.Delhi, Edition No. - 3rd, 2016.\n- P.Purshotam Raj, Geotechnical Engg, Tata Mcgraw Hill, N.Delhi, Edition No. - I, 1995.\nCourse Outcome: On completion of this course, the student will be able to:\n- Properly classify soil and can comment on its suitability for construction\n- Estimate soil consistency and compaction characteristics\n- Estimate soil design parameter for shear strength estimation"
  },
  {
    "course code": "CELR28",
    "course title": "TRANSPORTATION ENGINEERING-I (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "Transportation Engineering-I",
    "branch": "ce",
    "course learning objectives": "- To understand the characterization of highway materials\n- To know the procedure for testing of aggregate and bituminous materials\n- To know the standard specifications of IS/IRC/MoRTH for judging suitability of these materials",
    "course content": "- Aggregate Impact Test\n- Los-Angeles Abrasion Test on Aggregate\n- Crushing Strength Test on Aggregate\n- Flakiness and Elongation Index of aggregates\n- Penetration Test on Bitumen\n- Ductility Test on Bitumen\n- Viscosity Test on Bituminous Material\n- Softening Point Test on Bitumen\n- Flash and Fire Point Test on Bitumen\n- CBR lab test on soil\nCourse Outcome: On completion of the course, the students shall be able to: At the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for judging the suitability of highway materials.\n- Make investigations, use modern test tools and develop solutions to use the highway materials for sustainable development that preserves the environment.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant IS/IRC specifications."
  },
  {
    "course code": "CEPC31",
    "course title": "DESIGN OF CONCRETE STRUCTUTRES-II",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Knowledge of Structural Analysis and Concrete Structures-I\nSyllabus:\n- Retaining Walls\nClassification, Forces on retaining walls, design criteria, stability requirements, Proportioning of cantilever retaining walls, counterfort retaining walls, criteria for design of counteforts, design examples.\nDesign of beams curved in plan\nMaximum moments and shear for beams curved in plan, analysis for torsion, torsional reinforcement, design examples.\nFlat slabs\nAdvantages of flat slabs, general design considerations, approximate direct design method, design of flat slabs, openings in flat slab\nDesign of staircases\nDesign of various types of staircases, design examples.\nWater Tanks\nDesign requirements of water retaining structures, rectangular and cylindrical underground and overhead tanks, Intze tanks, design considerations, design examples.\nSilos and Bunkers\nVarious theories, Bunkers with sloping bottoms and with high side walls, design examples.\nPrestressed Concrete\nIntroduction, basic concepts of prestress concrete, various prestressing systems, losses in prestress, initial and final stress conditions, load balancing concept, analysis and design of sections for flexure and shear stresses\nYield Line Theory\nBasic assumptions, Methods of analysis, yield line patterns and failure mechanisms, analysis of one way and two way rectangular and non-rectangular slabs, effect of top corner steel in square slabs, design examples.\nReferences books\n- Plain and Reinforced Concrete, Vol.2, Jai Krishna & O.P.Jain, Nem Chand & Bros., Roorkee.\n- Pre-Stressed Concrete, N.Krishna Raju, TMH Pub.,N,.Delhi.\n- Design of Prestressed Concrete Structures, T.Y.Lin, John Wiley & Sons., N.Delhi.\n- Reinforced Concrete-Limit StaTge Design, A.K.Jain, Nem Chand & Bros.,Roorkee.\n- IS 1343-1980,IS Code of Practice for Prestressed Concrete.\n- IS 3370-1976(Part I to IV), Indian Standard Code of Practice for Liquid Retaining Structures.\n- IS 456-2000, Indian Standard of Practice for Plain and Reinforced Concrete.\nIS 1893, 4326 & 13920 Indian Standard Code of Practice for Earthquake Resistant Design of Structures.\nCorse Outcome: On completion of the course, the students shall be able to:\n- Continuous beams, beams curved in plan.\n- Flat slabs and staircase\n- Combined footing, raft foundation and pile foundation.\n- Water tank, silos and bunkers\n- Prestressed members\n- Slab using yield line method",
    "branch": "ce"
  },
  {
    "course code": "CEPC33",
    "course title": "GEOTECHNOLOGY-I",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Knowledge of Soil Mechanics",
    "branch": "ce",
    "course content": "- Sub-Surface Exploration\nPurpose, stages in soil exploration, depth and lateral extent of exploration, guidelines for various types of structures, ground water observations, excavation and boring methods, soil sampling and disturbance, major types of samplers, sounding methods-SCPT, DCPT, SPT and interpretation, geophysical methods, pressure-meter test, exploration logs.\nDrainage & Dewatering\nIntroduction, ditches and sumps, well point systems, shallow well system, deep well drainage, vacuum method, Electro-osmosis, consolidation by sand piles.\nShallow Foundations-I\nDesign criteria for structural safety of foundation( i ) location of footing,(ii) shear failure criterion, (iii) settlement criterion, ultimate bearing capacity, modes of shear failure, Rankine's analysis Tergazi's theory, Skempton's formula, effect of fluctuation of G.W.T. , effect of eccentricity on bearing capacity, inclined load, I.S Code recommendations, factors affecting bearing capacity, methods of improving bearing capacity.\nShallow Foundations-II\nVarious causes of settlement of foundation, allowable bearing pressure based on settlement, settlement calculation, elastic and consolidation settlement, allowable settlement according to I.S.Code. Plate load test and its interpretation, bearing capacity from penetration tests, design bearing capacity.\nShallow Foundations-III\nSituation suitable for the shallow foundations, types of shallow foundations and their relative merits, depth of foundation, footing on slopes, uplift of footings, conventional procedure of proportioning of footings, combined footings, raft foundations, bearing capacity of raft in sands and clays, various methods of designing rafts, floating foundations.\nPile Foundations-I\nIntroduction, necessity of pile foundations, classification of piles, load capacity, static analysis, analysis of pile capacity in sands and clays, dynamic analysis, pile load tests, negative skin friction, batter piles, lateral load capacity, uplift capacity of single pile, under- reamed pile.\nPile Foundations-II\nGroup action in piles, pile spacing, pile group capacity, stress on lower strata, settlement analysis, design of pile caps, negative skin friction of pile group, uplift resistance of pile group, lateral resistance, batter pile group.\nDrilled Piers and Caisson Foundations\nDrilled piers-types, uses, bearing capacity, settlement, construction procedure. Caissons- Types, bearing capacity and settlement, construction procedure.\nWell foundations-shapes, depth of well foundations, components, factors affecting well foundation design lateral stability, construction procedure, sinking of wells, rectification of tilts and shifts, recommended values of tilts & shifts as per I.S.3955.",
    "reference books": "- Murthy, V.N.S, A text book of Soil Mechanics and Foundation Engineering, UBS Publishers & Distributors Pvt. Ltd., New Delhi 1999.\n- Punmia, B.C., Soil Mechanics and Foundation Engineering, Laxmi Publications Pvt. Ltd., New Delhi, 1995.\n- Gopal Ranjan, ASR Rao, Basic and Applied Soil Mechanics, New Age Intetrnational\n(P) Ltd. Publishers- N.Delhi, Edition No. - 3rd, 2016.\n- Nainan P Kurian, Design of foundation Systems Principles and Practices, Narosa, 2011\n- Braja M. Das, Principles of Foundation Engineering, Thomson Asia Pvt. Ltd., Singapore, 2005.\n- Donald P. Coduto, Man-Chu Ronald Yeung and William A. Kitch, Geotechnical Engineering, Principles and Practices, PHI Learning Private limited, 2011.\n- Joseph E. Bowles, Foundation Analysis and Design, McGRAW-Hill, 1998.\n- P.Purshotam Raj, Geotechnical Engg, Tata Mcgraw Hill, N.Delhi, Edition No. - I, 1995\nCourse Outcome: On completion of this course, the student will be able to:\n- Understand the importance of soil investigation for any civil engineering construction\n- Do proper bearing capacity estimation including IS code methods\n- Do proper foundation proportioning for any kind of shallow foundation system and also get exposed in foundation analysis\n- To estimate pile and pile group capacity for any kind of soils including group efficiency and negative friction\n- To emphasize the importance of soil investigations.\n- To explain the concept of bearing capacity and how to estimate the safe bearing capacity for various foundation system including settlement consideration\n- To explain how to select a suitable shallow foundation system for various site conditions and also analysis of different foundation system\n- To explain in what circumstances pile is needed and how to estimate pile and pile group capacity under various soil conditions"
  },
  {
    "course code": "CEPC35",
    "course title": "HYDROLOGY & WATER\nRESOURCES ENGINEERING",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course objectives": "To provide student knowledge in hydrology and hydraulics and understand concepts of water resources systems.",
    "course content": "- Introduction\nHydrologic cycle, scope and application of hydrology to engineering problems, drainage basins and its characteristics, stream geometry, hypsometric curves.\nPrecipitation\nForms and types of precipitation, characteristics of precipitation in India, measurement of preciptation, recording and non recording raingages, raingage station, raingage network, estimation of missing data, presentation of rainfall data, mean precipitation, depth -area -duration relationship, frequency of point rainfall, intensity - duration- frequency curves, probable max. precipitation.\nEvaporation & Transpiration\nProcess, evaporimeters and empirical relationships, analytical method, reservoir evaporation and methods of its control, transpiration, evapotranspiration and its measurement, Penman's equation and potential evapotranspiration.\nInfiltration\nInfiltration process, initial loss, infiltration capacity and measurement of infiltration, infiltration indices.\nRunoff\nFactor affecting run-off, estimation of runoff, rainfall-run off relationships, measurement of stage-staff gauge, wire gauge, automatic stage recorder and stage hydrograph, measurement of velocity-current meters, floats, area velocity method, moving boat and slope area method, electromagnetic, ultra-sonic and dilution methods of stream flow measurement, stage discharge relationship.\nHydrograph\nDischarge hydrograph, components and factors affecting shape of hydrograph, effective rainfall, unit hydrograph and its derivation, unit hydrograph of different durations, use and limitations of UH, triangular UH, Snyder's synthetic UH, floods, rational methods, empirical formulae, UH method, flood frequency methods, Gumbel's method, graphical method, design flood.\nGround Water\nOccurrence, types of aquifers, compressibility of aquifers, water table and its effects on fluctuations , wells and springs, movement of ground water, Darcy's law, permeability and its determination, porosity, specific yield and specific retention, storage coefficient, transmissibility. Steady state flow to wells in unconfined and confined aquifers.\nWater Resources Planning\nRole of water in national development, assessment of water resources, planning process, environmental consideration in planning, system analysis in water planning, some common problems in project planning, functional requirements in multipurpose projects, multipurpose planning, basinwise planning, long term planning.\nReservoir planning-dependable yield, sedimentation in reservoir, reservoir capacity, empirical-area reduction method.\nWater Resources Systems Engineering\nConcept of system's engineering, optimal policy analysis, simulation and simulation modeling, nature of water resources system, analog simulation, limitations of simulation, objective function, production function, optimality condition, linear, non- linear and dynamic programming, applications to real time operations of existing system, hydrologic modeling and applications of basic concepts.",
    "reference books": "- Engineering Hydrology by K.Subramanya.\n- Hydrology by H.M.Raghunath.\n- Hydrology for Engineers by Linsely, Kohler, Paulhus.\n- Water Resources Engineering by Linseley and Franzini\n- Economics of Water Resources Engineering by James and Lee.\n- Optimisation Theory and Applications by S.S.Roy\n- Water Resources Systems Planning & Economics by R.S.Varshney.\n- Operational Research-An Introduction by Hamdy A.Taha.",
    "course outcomes": "Students will be able to understand and measure various hydrologic data required for water resources planning and design of hydraulic structures."
  },
  {
    "course code": "CEPC37",
    "course title": "SEWERAGE AND SEWAGE TREATMENT",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To learn basics of sewage collection and design of sewers\n- To learn the basics of sewage composition and its characteristics\n- To have adequate knowledge about various sewage treatment processes and its design\n- To provide adequate information on various disposal standards for treated effluents",
    "course content": "- Collection of Sewage\nImportance of sanitation, types of sewerage systems – separate, combined and partially separate, quantity of sanitary sewage and variations, shapes of sewer - circular and egg shaped, design of sewers, self-cleansing velocity and slopes, construction and testing of sewer lines, sewer materials, joints and sewer appurtenances, building drainage and plumbing systems.\nSewage Characterisation\nQuality parameters- BOD, COD, solids, oil and grease, Indian Standards for disposal of effluents into inland surface sources and on land, guidelines for reuse of treated wastewater.\nSewage Treatment\nObjectives, sequence and efficiencies of conventional treatment units, preliminary treatment, screening and grit removal units, theory and design aspects of primary treatment, secondary treatment- activated sludge process & its modifications, tricking filter, UASB process, introduction to advance sewage treatment systems - sequencing batch reactor (SBR)-moving bed biofilm reactor (MBBR)-membrane bioreactor (MBR), Stabilization pond, aerated lagoon, septic tank, sludge disposal – thickening-digestion-dewatering, introduction of tertiary treatment\nDisposal of Sewage\nRecycling and reuse of treated wastewater, disposal of sewage by dilution - self-purification of streams - Streeter Phelps equation - oxygen sag curve, sewage disposal by irrigation (sewage treatment).",
    "reference books": "- Environmental Engineering: Peavy H. S., Rowe D. R. and Tchobanoglous G.\n- Introduction to Environmental Engineering: Davis M. L. and Cornwell D. A.\n- Wastewater Engineering, Collection, Treatment and Disposal: Metcalf and Eddy\n- Water Supply and Sanitary Engineering: Birdie, G. S. and Birdie\n- Sewage and Sewage Treatment: S.K. Garg.\n- Sewage and Sewage Treatment: S.R. Krishansagar.\n- Waste Water Engineering: B.C. Punmia.\n- Manual on Sewerage and Sewage Treatment: Ministry of Urban Dev., New Delhi.",
    "course outcomes": "On completion of the course, the students will be able to\n- Estimate quantity of sewage and design sewerage system\n- Determine the various characteristics of sewage\n- Design various sewage treatment units\n- Plan reuse of treated effluent and select appropriate disposal option"
  },
  {
    "course code": "CEPC39",
    "course title": "TRANSPORTATION ENGINEERING-II",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Transportation Engineering-I, SA-I",
    "branch": "ce",
    "course learning objectives": "- To understand the design of flexible and rigid pavements.\n- To know the construction techniques of highways pavements.\n- To understand the pavement failures and maintenance of pavements including strengthening.\n- To learn economic evaluation of highway projects and sources of financing.\n- To know the basics of tunnel engineering.",
    "course content": "## UNIT-I\n\nDesign of Flexible Pavements\nTypes of pavements. Flexible and rigid pavements. Components of a pavement and their functions. Factors affecting design of pavements. Review of design by old methods, Design of a flexible pavement by CBR method (as per latest IRC guidelines).\nDesign of Rigid Pavements\nWestergaard’s theory, critical locations of loading, load and temperature stresses. Critical combination of stresses. IRC guidelines for determination of thickness of a rigid pavement. Joints: requirements, types, patterns. Spacing of expansion and contraction joints. Functions of dowel and tie bars.\n\n\n## UNIT-II\n\nHighway Construction : Non-Bituminous Pavements\nSubgrade and embankment construction, Construction of GSB, WBM, WMM. Construction of DLC & PQC. Fixed form and Slip-form paving techniques.\nConstruction of Bituminous Pavements\nVarious types of bituminous constructions. Prime coat, tack coat, seal coat and surface dressing. Construction of BUSG, Premix carpet, BM, DBM and BC. Mastic asphalt. Brief introduction to functions of Rollers, paver and hot mix plants. Introduction to various IRC and MoRTH specifications.\n\n\n## UNIT-III\n\nHighway Maintenance\nFailures and remedies of bituminous and cement concrete pavements. Pavement evaluation. Benkleman beam. Introduction to various types of overlays. Overlay design.\nHighway Drainage and Hill Roads\nSurface drainage: types, brief design. Types of sub-surface drainage. Special characteristics of hill roads: geometrics, hair pin bends.\n\n\n## UNIT-IV\n\nHighway Economics and Finance\nNeed of economic evaluation. Highway user benefits and costs. Methods of economic evaluation, Highway finance. PPP Projects. Rate analysis of MoRTH standard data book & cost estimation.\nTunnels\nSections of tunnels, Shaft. Pilot tunnel. Driving tunnel in rocks. Driving tunnel in soft ground. Drainage and Ventilation of Tunnels.",
    "reference books": "- Highway Engg by S.K.Khanna & C.E.G. Justo, Veeraragavan A., Nem Chand Bros., Roorkee, 2014.\n- Principles and Practice of Highway Engg. by L.R.Kadiyali, N.B. Lal, Khanna Publishers, Delhi, 2008.\n- Principles of Pavement Design by Yoder,E.J & Witczak,M.W., John Wiley and Sons, USA.\n- Tunnel Engineering by S.C.Saxena, Dhanpat Rai Publications, N.Delhi.\n- A text book of Tunnel, Bridges and Railway Engg. by S.P.Bindra, Dhanpat Rai Delhi.",
    "course outcomes": "At the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to pavement engineering.\n- Design flexible and rigid pavements, make investigations, use modern tools and develop solutions to problems related to highway pavements.\n- Understand the engineering solutions in societal context for sustainable development that takes care of environment and economical use of resources.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/IRC/MoRTH specifications."
  },
  {
    "course code": "CELR31",
    "course title": "GEOTECHNOLOGY (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "Knowledge of Geotechnology",
    "branch": "ce",
    "course learning objectives": "- To estimate index properties of soils\n- To estimate consolidation parameters of clayey soil.\n- To estimate shear strength parameters of soil by triaxial shear test.\n- To estimate the relative density and maximum dry density of soils.\n- To have a feel of plate load test.",
    "course content": "- Grain Size Analysis-Hydrometer method.\n- Modified Proctor compaction Test\n- Relative Density of Granular Soils.\n- Consolidated Drained (CD) Triaxial Test.\n- Consolidated Undrained (CU) Triaxial Test with Pore Water Pressure Measurement.\n- Consolidation Test.\n- Undisturbed Sampling.\n- Standard Penetration Test.\n- Dynamic Cone Penetration Test.\n- Model Plate Load Test.",
    "reference books": "- Gopal Ranjan, ASR Rao, Basic and Applied Soil Mechanics, New Age International\n(P) Ltd. Publishers- N.Delhi, Edition No. - 3rd, 2016.\n- P. Purshotam Raj, Geotechnical Engg, Tata Mcgraw Hill, N.Delhi, Edition No.- I, 1995."
  },
  {
    "course code": "CELR33",
    "course title": "TRANSPORTATION ENGINEERING – II (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "Knowledge of programming language, Structural analysis and drawing.\nSolution of the following problems using MATLAB / C language / Excel\n- Design of the structural elements in concrete and steel.\n- Development of simple programs for solving Transportation Engineering problems: Highway geometrics, pavement design.\n- Development of simple programs for solving Geotechnical Engineering problems: Earth pressure, Foundation settlement and stress analysis, Consolidation.\n- Problems in Environmental and Water resources engineering: Treatment systems, Pipe networks analysis, Synthetic Unit hydrograph derivation, Flood routing, Water balance model.\nAnalysis, Design and detailing using software packages in Structural Engineering/Transportation Engineering/Environmental/Water Resources/Geotechnical Engineering/ GIS and Remote sensing applications",
    "branch": "ce",
    "course learning objectives": "- To understand the characterization of highway materials\n- To learn the mix designs of granular, bituminous and CC mixes\n- To learn the use of modern equipment for traffic studies & pavement evaluation\n- To know the standard specifications of IS/IRC/MoRTH for judging suitability of these materials",
    "course content": "- Specific gravity and water absorption test on coarse aggregate\n- Specific gravity of bitumen\n- Stripping test on aggregates\n- Determination of bitumen content and gradation of bituminous mix\n- Granular Mix Design\n- Bituminous Mix Design by Marshall’s method\n- Cement concrete mix design for pavements\n- Traffic volume and speed study using videography technique\n- Demonstration of Radar Gun & Automatic Counter Classifier\n- Demonstration of BBD & Bump Integrator\nCorse Outcome: On completion of the course, the students shall be able to:\nAt the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for judging the suitability of highway materials.\n- Make investigations, use modern test tools and develop solutions to use highway materials for sustainable development that preserves the environment.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant IS/IRC specifications.",
    "reference books": "- Rajasekaran S, Computational Structural Mechanics, Prentice Hall of India, New Delhi, 2001.\n- Manickaselvam V.K., Elements of Matrix and Stability Analysis of Structures, Khanna Publishers, New Delhi, 1998.\n- Software Manuals (STAAD Pro, SAP, ETABS etc.)",
    "course outcomes": "On completion of the course, the students shall be able to:\n- Understand the need for software tools in analysis and design of Civil Engineering Systems\n- Identify the available open source software tools used for specific problems in Civil Engineering\n- Use the latest software tools for Modeling, Analysis and Design of Civil Engineering Systems\n- Apply the software skills in the transportation engineering, water resources and environmental engineering.\n- Apply computing skills to geotechnical engineering."
  },
  {
    "course code": "CEPC41",
    "course title": "BRIDGE ENGINEERING",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Knowledge of Transportation Engineering and Concrete Structures Syllabus:\n- Introduction\nDefinition, components of bridge, classification of bridges, selection of site , economical span and essential design data.\nStandard Specifications For Roads And Railways Bridges\nGeneral, Indian Road Congress Bridge Code, width of carriage way, clearance, various loads to be considered for the design of roads and railway bridges, detailed explanation of IRC standard live loads.\nDesign Consideration for R. C. C. Bridges\nVarious types of R.C.C. bridges (brief description of each type) , design of R.C.C. culvert and T-beam bridges, PSC bridges\nDesign Consideration for Steel Bridges\nVarious types of steel bridges (brief description of each), design of truss and plate girder bridges, composite bridges\nHydraulic & Structural Design\nPiers, abutments, wingwall and approaches.\nBrief Description\nBearings, joints, articulation and other details.\nBridge Foundation\nVarious types, necessary investigations and design criteria of well foundation.",
    "branch": "ce",
    "reference books": "- Essentials of Bridge Engineering, D.J.Victor, Oxford & IBH Pub.N.Delhi.\n- Design of Bridges, N.Krishna Raju, Oxford & IBH, N.Delhi.\n- Bridge Deck Analysis, R.P.Pama & A.R.Cusens, John Wiley & Sons.\n- Design of Bridge Structures, T.R.Jagadish & M.A.Jairam, Prentice Hall of India, N.Delhi.\nCorse Outcome: On completion of the course, the students shall be able to:\n- Design the slab culvert, Box culvert\n- Design the T beam bridge and substructures\n- Design the Bridge bearings\n- Design the steel bridge for railways"
  },
  {
    "course code": "CEPC43",
    "course title": "RAILWAY AND AIRPORT ENGINEERING",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Transportation Engineering-I&II",
    "branch": "ce",
    "course learning objectives": "- To understand the permanent way and its components\n- To know about points, crossings and train control systems\n- To understand the geometric design of track, about stations, yards and maintenance of tracks.\n- To learn airport layout planning and runway pavement design",
    "course content": "## UNIT-I\n\nIntroduction of Permanent Way\nHistory and general features of Indian railways, Railway Track Gauge, Rails, Sleepers, Track fittings and fastenings, Creep of rails, Ballast, Subgrade and formation, Rail joints and welding of rails, modern welded railway track, Track and Track stresses.\n\n\n## UNIT-II\n\nStations and Yards, Points and Crossings, and Signalling\nStations and yards, Points and crossings, design of turnouts and crossings, Signalling and interlocking, Train Control systems, Track maintenance and drainage.\n\n\n## UNIT-III\n\nGeometric Design of Track, High speed train systems\nGeometric design of track, curves and super elevation, Train resistance and tractive power, Urban Railway system, High speed Tracks, high speed train system technologies, Introduction to RDSO/IS specifications.\n\n\n## UNIT-IV\n\nAirport Planning, Runway Layout and Pavement Design\nAirport planning, layout, geometric design, Airport pavements, introduction to runway pavement design software like FAARFIELD",
    "reference books": "- Chandra, S. and Agarwal, M. M., “Railway Engineering”, Oxford.\n- Arora, S. P. and Saxena, S. C., “A Text Book of Railway Engineering”, Dhanpat Rai Publications.\n- Mundrey, J. S., “Railway Track Engineering”, Tata Mcgraw Hill.\n- Khanna, S. K., Arora, M. G. and Jain, S. S., “Airport Planning & Design”, Nem Chand and Bros.\n- Horonjeff, Robert and McKelvey, Francis X., “Planning & Design of airports’, 4th Ed., McGraw Hill.\n- Saxena, S.C., “Airport Engineering – Planning and Design”, CBS Publishers.\n- Transportation Engineering by C Venkatramaiah",
    "course outcomes": "At the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to railway and airport engineering.\n- Design points and crossings, design runway pavements, make investigations, use modern tools and develop solutions to problems related to railway / airport engg.\n- Understand the engineering solutions in societal context for sustainable development that takes care of environment and optimal use of resources.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/RDSO/FAA/ICAO specifications."
  },
  {
    "course code": "CEPC45",
    "course title": "GEOTECHNOLOGY-II",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "Knowledge of Geotechnology-I",
    "branch": "ce",
    "course learning objectives": "- To explain the concept of earth dam design including stability analysis under seepage.\n- To evaluate stability of slopes under different drainage conditions using different methods.\n- To explain design principles of retaining structures and coffer dams.\n- To explain the concept of soil stabilization.\n- To explain the significance of dynamic load in machine foundation analysis.\n- To explain theory of vibration for different field conditions.\n- To understand salient points of environmental engineering pertaining to Geotechnology",
    "course content": "- Earth Dams\nIntroduction, types of sections, earth dam foundations, causes of failure and criteria for safe design, control of seepage through the embankment, control of seepage through the foundation, drainage of foundations, criterion for filter design.\nStability of slopes\nCauses of failure, factors of safety, stability analysis of slopes-total stress analysis, effective stress analysis, stability of infinite slopes types of failures of finite slopes, analysis of finite slopes-mass procedure, method of slices, effect of pore pressure, Fellinius method to locate center of most critical slip circle, friction circle method, Tayler's stability number.\nBraced Cuts\nDepth of unsupported vertical cut, sheeting and bracing for deep excavation, movements associated with sheeting and bracing, modes of failure of braced cuts, pressure distribution behind sheeting.\nCofferdams\nIntroduction, types of cofferdams, design and lateral stability of braced cofferdams, design data for Cellular cofferdams, stability analysis of cellular cofferdams on soil and rock, inter- locking stresses.\nCantilever Sheet Piles\nPurpose of sheet piles, cantilever sheet piles, depth of embedment in granular soils-rigorous method, simplified procedure, cantilever sheet pile penetrating clay.\nAnchored Bulkheads\nMethods of design, free earth support method in cohesionless and cohesive soils, fixed earth support method in cohesionless soils.\nSoil Stabilization\nSoil improvement, mechanical treatment, use of admixtures, lime stabilization, cement stabilization, lime fly ash stabilization, Bituminous stabilization, chemical stabilization, stone column, grouting, methods of grouting.\nBasics of Machine Foundations\nTerminology, characteristics elements of vibratory systems, analysis of vibratory motions of single degree freedom system-undamped free vibrations, undamped forced vibrations, criteria for satisfactory action of a machine foundation, degrees of a freedom of a block foundation, Barken's soil spring constant, Barken's method of a determining natural frequency of a block foundation subjected to vertical oscillations.\nEnvironmental Geotechnology\nIntroduction, Environmental cycles, natural cycles, development of environmental geotechnology, pollution process, contamination of sub-soil, contaminant transport, quantity of contaminants, contaminated site characterization, composition of solid wastes, waste containment.",
    "reference books": "- S.Prakash, Gopal Ranjan & S.Saran, Analysis and Design of Foundation and Retaining Structures, Sarita Prakashan Meerut, 1977.\n- Swami Saran, Analysis and Design of Sub Structures, IBH Oxford\n- Gopal Ranjan, ASR Rao, Basic and Applied Soil Mechanics, New Age Intetrnational\n(P) Ltd. Publishers- N.Delhi, Edition No. - 3rd, 2016.\n- Shamsher Prakash, Soil Dynamic, McGraw Hill, 1981.\n- Teng, Foundation Design, Prentice Hall, Edition No. - 10th, 1984.\n- P.Purshotam Raj, Geotechnical Engg, Tata Mcgraw Hill, N.Delhi, Edition No.- I, 1995\n- Debashis Moitra, Geotechnical Engineering, Universities Press, Edition No. - I, 2016.\nCourse Outcome: On completion of this course, the students will be able to:\n- Do earth dam design and stability analysis for all kind of drainage conditions\n- Do stability analysis of any kind of slope and its protection\n- Understand the earth pressure theories and able to calculate lateral earth pressure for different conditions\n- Evaluate depth of embedment for cantilever as well as anchored sheet piles.\n- Learn the concept of soil stabilization and machine foundation\n- Understand salient points of environmental engineering pertaining to Geotechnology"
  },
  {
    "course code": "CEPC47",
    "course title": "CONSTRUCTION\nMANAGEMENT, ESTIMATING AND COSTING",
    "course type": "PC",
    "number of credits": "3",
    "prerequisites": "None",
    "branch": "ce",
    "course content": "- Network Techniques in Construction Management-I:CPM\nIntroduction, network techniques, work break down, classification of activities, rules for developing networks, network development-logic of network, allocation of time to various activities, Fulkerson's rule for numbering events, network analysis , determination of project schedules, critical path, ladder construction, float in activities, shared float, updating, resources allocation, resources smoothing and resources leveling.\nNetwork Techniques in Construction Management-II-PERT\nProbability concept in network, optimistic time, pessimistic time, most likely time, lapsed time, deviation, variance, standard deviation, slack critical path, probability of achieving completion time, central limit theorem.\nCost-Time Analysis\nCost versus time, direct cost, indirect cost, total project cost and optimum duration, contracting the network for cost optimisation, steps in time cost optimisation, illustrative examples.\nConstruction Contracts & Specifications\nIntroduction, types of contracts, contract document, specifications, important conditions of contract, arbitration.\nNecessity of specifications, types of specifications, general specifications, specification for bricks, cement, sand, water, lime, reinforcement; Detailed specifications for Earthwork, Cement, concrete, brick work, floorings, D.P.C., R.C.C., cement plastering, white and colour washing, distempering, painting.\nInspection & Quality Control\nIntroduction, principles of inspection, enforcement of specifications, stages in inspection and quality control, testing of structures, statistical analysis.\nEstimate\nPrinciples of estimation, units, items of work, different kinds of estimates, different methods of estimation, estimation of materials in single room building, two roomed building with different sections of walls, foundation, floors and roofs, R.B. and R.VC.C. works, Plastering, White-washing, Distempering and painting, doors and windows, lump sum items, Estimates of canals, roads etc.\nRate Analysis\nPurpose, importance and requirements of rate analysis, units of measurement, preparation of rate analysis, procedure of rate analysis for items:- Earthwork, concrete works, R.C.C. works, reinforced brick work, plastering, painting, finishing(white-washing, distempering).\nPublic Works Account\nIntroduction, function of P.W. department, contract, guidelines, types of contracts, their advantages and disadvantages, Tender and acceptance of tender, Earnest money, security money, retention money, measurement book, cash book, preparation, examination and payment of bills, first and final bills, administrative sanction, technical sanction.",
    "reference books": "- Construction Planning & Management by P.S.Gehlot & B.M.Dhir, Wiley Eastern Ltd.\n- PERT & CPM -Principles & Applications by L.S.Srinath. Affiliated East-west Press(P)Ltd.\n- Project Planning & Control with PERT & CPM by B.C.Punia & K.K.Khandelwal,Lakshmi Pub. Delhi\n- Construction Management & Planning by B.sengupta & H.Guha, Tata McGraw Hills.\n- Estimating and Costing for Building & Civil Engg.Works by P.L.Bhasin, S.Chand & Co., N.Delhi.\n- Estimating, Costing & Specification in Civil Engg. by M.Chakarborty, Calcutta.\n- Estimating & Costing in Civil Engg..: Theory & Practice by B.N.Dutta, S.Dutta & Co., Lucknow.\n- Building Construction Estimating by George H.Cooper, McGraw Hill Book Co., New York.\nCorse Outcome: On completion of the course, the students shall be able to:\n- Understand the roles and responsibilities of a project manager\n- Prepare schedule of activities in a construction project\n- Prepare tender and contract document for a construction project\n- Understand safety practices in construction industry\n- Identify the equipment used in construction"
  },
  {
    "course code": "CEPC42",
    "course title": "OPEN CHANNEL HYDRAULICS",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "reference books": "Syllabus\n- Basic fluid flow concepts\nDefinition, importance of study of open channel flow, Types of channels, Classification of Flows, Velocity distribution, One-Dimensional method of flow analysis, Pressure Distribution, Equation of Continuity, Energy Equation, Momentum equation.\nEnergy-Depth Relationships\nSpecific Energy, specific fore, Critical Flow, critical depth, Calculation of Critical Depth for some shapes of channels.\nUniform Flow in rigid boundary channels\nIntroduction, shear stress on boundary, shear stress in open channels, velocity distribution and effect of secondary circulation on velocity distribution, flow over roughness elements, Chezy Equation, Darcy-Weisbach Friction Factor, Manning’s roughness Formula, Resistance Formulate for Practical Use, Normal Depth and it computation for some shapes of channels.\nUniform Flow in mobile boundary channels\nIncipient motion, Shield’s diagram, regimes of flow, bed forms, sediment load and its measurement, regime channels, design of stable channels.\nHydraulic Jump\nOccurrence and importance, Momentum Equation for hydraulic Jump, computation of sequent depth, Classification of Jumps, Characteristics of Jump in a Rectangular Channel, location of jump, Hydraulic jump application, Use of the Jump as an Energy Dissipater.\nRapidly-Varied Flow\nWeirs, Sharp-crested Weir, Broad-crested Weir, submergence of weirs, Critical-Depth Flumes, Sluice-gate Flow, free and submerged flow and its analysis of sluice gate, free overfall.\n- Chow Ven Te, “Open Channel Hydraulics”. McGaw Hill International Edition.\n- Ranga Raju, K.G. “Flow Through Open Channel”. Tata McGraw-Hill\n- Choudhary, Hanif “Open Channel Hydraulics” Prentice Hall of India\n- Subramanya K. “Flow in Open Channels”. Tata McGraw-Hill\n- Srivastava, R. “Flow Through Open Channels”. Oxford University Press."
  },
  {
    "course code": "CEPC44",
    "course title": "INDUSTRIAL WASTE WATER TREATMENT",
    "course type": "PC",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To study characteristics of industrial wastewater and its effects on water bodies\n- To know the quality of industrial effluents required before disposal on environment\n- To learn various physico-chemical and biological treatment techniques to treat industrial wastewater\n- To gain knowledge about the reuse of treated industrial effluents",
    "course content": "Prevention Vs control of industrial pollution, zero discharge concept, effects of industrial waste disposal on streams, sewerage systems and wastewater treatment plants, effluent standards for disposal into inland surface water sources and on land for irrigation, industry specific standards, quality requirements for reuse, various steps to minimize effects of industrial effluents on waste water treatment plants and receiving streams-conservation of water, process change, reuse of waste water, volume reduction, strength reduction, neutralization, equalization and proportioning, population equivalent, common effluent treatment plant (CETP), study of the following industries from waste generation, quality and its treatment including brief overview of manufacturing process: Textile, tannery, sugar mill, distillery, dairy, pulp & paper, metal plating, oil refinery, nitrogenous fertilizers, thermal power plants and radioactive wastes.",
    "reference books": "- Industrial and Hazardous Waste Treatment: N. L. Nemerow and A. Dasgupta.\n- Industrial Effluents by N. Manivasakam\n- Waste Water Treatment: M. N. Rao and A. K. Dutta\n- Industrial Water Pollution Control: W. W. Eckenfelder\n- Handbook of Industrial Pollution and Control, Volume I & II: S. C. Bhatia\n- Pollution Control in Process Industries: S. P. Mahajan",
    "course outcomes": "On completion of the course, the students will be able to\n- Recognize various environmental problems due to improper management of industrial wastewater\n- Determine appropriate technologies for treatment and management of industrial wastewater\n- Recommend different techniques for the safe disposal of industrial effluents\n- Analyse the quality requirements for reuse of industrial effluents"
  },
  {
    "course code": "CELR42",
    "course title": "ENVIRONMENTAL ENGINEERING – II (P)",
    "course type": "ELR",
    "number of credits": "1",
    "prerequisites": "Knowledge of Structural analysis, Steel structures\nContents\n- Introduction to plastic analysis and design, plastic bending of beams, stages of bending, shape factor, plastic hinge, load factor, failure mechanism - Theorems of plastic analysis, collapse load for beams and frames, design of continuous beams.\n- Design of round tubular structures - Introduction, sectional properties, permissible stresses, grades of steel tubes, tubular tension members, tubular compression members, tubular flexural members, combined bending and axial stresses.\n- Analysis and design of steel stacks - Wind load estimation as per IS875 part 3, functional and structural requirements, self supporting and guyed stacks, base plate and anchor bolts, stability considerations.\n- Wind load - Introduction to wind load, analysis and design of structural elements.\n- Connections - Welded and bolted connections for un-stiffened and stiffened connections, moment resistant beam end connections.\n- Composite construction - Introduction, composite beams, method of construction, limit state of collapse, limit state of serviceability, design examples.\n- Design of steel tanks - Design loads, permissible stresses, design of cylindrical tanks with suspended bottom, supporting ring beam, staging for tanks, rectangular pressed steel tanks.",
    "branch": "ce",
    "course learning objectives": "- To analyze the physical and chemical characteristics of wastewater\n- To familiarize the methods to estimate the organic strength of wastewater\n- To study the growth of microorganisms and its quantification",
    "course content": "Physical, chemical and bacteriological characterization of wastewater and strength assessment of wastewater by performing following laboratory experiments:\n- To determine the acidity of a wastewater sample\n- To determine the alkalinity of a wastewater sample\n- To determine total, suspended, dissolved and settable solids in a wastewater sample\n- To determine volatile and fixed solids in a wastewater sample\n- To determine oil and grease in a wastewater sample\n- To determine the chloride concentration in a wastewater sample.\n- To determine the sulphate concentration in a wastewater sample.\n- To determine the B.O.D. of a given wastewater sample.\n- To determine the C.O.D. of a given wastewater sample.\n- To determine the T.O.C. of a given wastewater sample.\n- To determine the fecal count of a given wastewater sample.\n13. Microscopic studies of a wastewater",
    "course outcomes": "On completion of the course, the students will be able to\n- Apply different analysis techniques for the measurement of physical and chemical parameters of wastewater\n- Quantify the pollutant concentration in wastewater\n- Recommend the degree of treatment required for the wastewater\n- Assess the microbial population in wastewater",
    "reference books": "- Subramanian N, Design of Steel Structures, Oxford University Press, New Delhi 2008.\n- Bhavikatti, S.S., Design of Steel Structures, I.K. International Publishing House Pvt. Ltd., New Delhi, 2010.\n- Krishnaraju, N. Structural Design and Drawing, Universities Press, 2009\n- IS 800 - 2007, Code of practice for general construction in steel, Bureau of Indian Standards, New Delhi.\n- SP6 (1)-1964, IS hand book for structural Engineers. Bureau of Indian Standards, New Delhi.\n- IS 875 Part (3)-1987, Code of Practice or Design Loads (other than earthquake) for buildings and structures: wind loads, Bureau of Indian Standards, New Delhi."
  },
  {
    "course code": "CEPE12",
    "course title": "DYNAMICS OF STRUCTURES",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "",
    "branch": "ce",
    "reference books": "Contents\n- Seismology:\nIntroduction, plate tectonics, earthquake distribution and mechanism, seismicity, seismic waves, earthquake magnitude and intensity, seismic zoning and seismometry.\nSingle Degree of Freedom Systems:\nVarious types of dynamic loads, vibration of single degree of freedom system, Free and forced vibrations, types of damping, critical damping. Transmissibility, vibration measuring instruments, response spectrum.\nMulti-degrees of Freedom(MDOF)Systems:\nEquation of Motion, normal modes and natural frequencies, semi-definite systems, dynamic vibration absorbers, vibration dampers, principle of orthogonally, Stodolas method, Holzer's method, matrix method, modal analysis and its limitations. Mode super position method.\nSeismic Analysis and Design:\nGeneral principles, assumptions, seismic coefficient method, response spectrum method, strength and deflection, design criterion for structures, significance of ductility, design and detailing for ductility, codal provisions, design examples.\nSeismic Performance, Repair and Strengthening:\nMethods for assessing seismic performance, influence of design ductility and masonry infills, criterion for repair and strengthening, repair and strengthening techniques and their applications, additions of new structural elements.\nVibrational Control:\nGeneral features of structural control, base isolation, active and passive control system. Earthquake resistance design as per I.S.:1893, I.S.4326 and I.S.13920.\n- Elements of Earthquake Engineering, Jai Krishna, A. R. Chandershekaran & Brajesh Chandra , South Asian Pub New Delhi.\n- Dynamics of Structures, Clough & Penzion, McGraw Hill\n- Earthquake Engineering, Y-X Hu,S-C.Liu and W.Dong, E and FN Sons., Madras.\n- Earthquake Resistant Concrete Structures, George G. Penelis and J. Kapoors, E & FN Sons, Madras.\n- Structural Dynamics, Mario Paz, CBB Pub. N. Delhi."
  },
  {
    "course code": "CEPE13",
    "course title": "INTRODUCTION TO FINITE ELEMENT METHOD",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "Knowledge of Mathematical Methods, Structural Analysis\nIntroduction:\nField conditions, boundary conditions, functional approximation, finite differences method, development of finite element method.\nElement Properties:\nDisplacement models, relation between the nodal degrees of freedom and generalized coordinates, convergence requirements, natural co-ordinate systems, shape functions, element strains and stresses, development of element stiffness, matrix and equivalent nodal loads, static condensation.\nIsoparametric Elements:\nIsoparametric, super-parametric and sub-paramatric elements, computation of stiffness matrix of isoparametric elements, convergence criteria for isoparametric elements, numerical integration technique using Gauss Quadrature.\nOne Dimensional Element:\nTruss element, analysis of plane truss problem, Hermitian beam element, beam on elastic foundation, solution of beam problem.\nPlane Stress and Plane Strain Analysis:\nTriangular elements, rectangular elements, isoparametric elements, patch test, axisymmetric solid element.\nPlane Bending Analysis:\nDisplacement functions, plate bending elements, reduced integration, stress smoothing technique.\nConduction Heat Transfer:\nFormulation of finite element method for heat conduction, various weighted residual techniques, one dimensional heat conduction, two dimensional conduction heat transfer.\nDirect Stiffness Method of Analysis and Solution Technique:\nAssemblage of elements, direct stiffness method, boundary conditions and reactions, Gauss elimination and matrix decompsition.\nFinite Element Analysis Software:\nPre-and Post-processors finite element analysis software, error estimates and adaptive meshing.",
    "branch": "ce",
    "reference books": "- Krishnamurthy, C.S.,'Finite Element Analysis-Theory and Programming', TMH Pub.N.Delhi.\n- Cook, R.D.,Malkus,D.S. and Plesha,M.E.,'Concept and Applications of Finite Element Analysis', John Wiley & Sons, New York.\n- Desai, C.S. and Abel,J.F.,'Introduction to the Finite Element Method', Affiliated East- West Press Pvt.Ltd.N.Delhi.\n- Manicka Selvam,V.K.,'Finite Element Primer', Dhan\nCorse Outcome: On completion of the course, the students shall be able to:\n- Develop shape functions and stiffness matrices for spring and bar elements\n- Develop global stiffness matrices and global load vectors\n- Apply natural and arial coordinate systems to constant strain triangle and linear strain triangle elements\n- Analyze planar structural systems using finite element modelling"
  },
  {
    "course code": "CEPE14",
    "course title": "ROCK MECHANICS",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "Knowledge of Engineering Geology and Geotechnical Engineering.",
    "branch": "ce",
    "course learning objectives": "- To understand the problems associated with underground excavations\n- To understand the rock mass classification\n- To understand the failure criteria of rock\n- To understand about in-situ stresses from field test data\nContents\n- Introduction\nImportance of rock mechanics, composition of rocks, geological and lithological classification of rocks, classification of rocks for engineering purposes, R.Q.D. method of classification of rocks. Theories of Brittle failure.\nLaboratory Testing of Rocks\nVarious methods of obtaining rock cores, methods of sample preparation, methods of removing end friction of the rock samples. Compression testing machine, uniaxial compression strength of rock samples, methods of finding tensile strength-direct and indirect methods, Brazilian test, shear box test, triaxial shear test, punch shear test.\nIn-situ Testing of Rocks\nField direct shear test on rock blocks, field triaxial strength, use of flat jacks, chamber test, plate load test, cable jacking test.\nStress Evaluation in Field\nStress-relief technique(over coring), use of strain gauges, bore hole, deformation cell, photo- elastic stress meter, stress measurement with flat jack. Hydraulics Fracturing Techniques.\nStabilization of Rocks\nRock bolting, principle of rock bolting, various types of rock bolts, application of rock bolting. Field testing of rock bolts and cable anchors.\nElastic and Dynamic Properties of Rocks\nStress-strain behaviour dynamic properties, resonance method and ultra-sonic pulse method.\nPressure on Roof of Tunnels\nTrap door experiment, Terzaghi's theory, Bieraumer, kommerel, Protodyakanov theory.\nStress Around the Tunnels\nBasic design and Principles of tunnels in rocks, design of pressure tunnels in rocks.",
    "reference books": "- Lama,et.al Rock Mechanics, Vol.I,II,III,IV\n- Jaeger and Cook, Fundamentals of Rock Mechanics\n- Stagg & Zienkiewiez, Rock Mechanics\n- Obert & Duvell, Rock Mechanics & Design of Structures in Rocks\n- Jaeger, Rock Mechanics & Engineering\n- Schzy, Art of Tunneling\nCourse Outcome: On completion of this course, the students will be able to: 1 Identify the problems associated with underground excavations\n2 Classify the rock mass using the reference data 3 Understand the failure criteria of rock\n4 Determine in-situ stresses from field test data"
  },
  {
    "course code": "CEPE15",
    "course title": "GEOSYNTHETICS ENGINEERING",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To explain the basic mechanisms of soil reinforcement and design principles in reinforced earth wall\n- To understand the applications of Geosynthetics in geotechnical problems and its design principles\n- To explain the usage of Geosynthetics in geoenvironmental and pavement engineering with design\n- To explain the present status of development in geo-synthetics and filed instrumentation and control\nContents\n- Basic Description of Geosynthetics\nHistorical Development, the Nomenclature, Function, Use Around the World, Applications, Development in India.\nRaw Materials – Their Durability and Ageing\nRaw Materials, Durability, Degrading Agencies, Polymers, Biological Resistance, Chemical Resistance, Weathering Resistance.\nManufacturing Methods\nFibers, Yarn, Nonwoven Geotextiles, Woven geotextiles, D.S.F. Fabrics.\nGeogrids – Testing And Evaluation\nFactors Influencing Testing, Sampling, Physical Properties, Mechanical Properties under Uniaxial loading, Creep Testing.\nErosion Control With Geogrids\nWind Erosion, Rain Water Erosion, Erosion Control Measures, Placement of Geogrid.\nBearing Capacity Improvement with Geogrids\nAdvantages, Mechanism. Modes of Failure, Friction Coefficient, Experimental Studies.\nApplication of Geosynthetics in Water Resources Projects\nCase Studies: Dharoidam, Hiran II Dam, Meda Creek Irrigation Scheme, Lining of Kakarapar Canal.",
    "reference books": "- Robert M. Koerner, Designing with Geosynthetics, Prentice-Hall\n- G.V. Rao & G.V.S. Raju, Engineering with Geosynthetics, Tata McGraw-Hill\n- Debashis Moitra, Geotechnical Engineering, Universities Press, Edition No. - I, 2016.\nCourse Outcome: On completion of this course, the students will be able to: 1 Identify the functions of geosynthetics\n- Select the geosynthetic products\n- Identify the testing methods for geosynthetics 4 Design geosynthetic products"
  },
  {
    "course code": "CEOE16",
    "course title": "TRAFFIC ENGINEERING AND ROAD SAFETY",
    "course type": "/OE",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To understand the importance of traffic engineering, characteristics of traffic and Causes of road accidents\n- To know the relationship between contributing factors and road accidents\n- To study the traffic control devices and principles of signal / intersection design to address the problem of road accidents\n- To learn the environmental issues related to road traffic",
    "course content": "## UNIT-I\n\nOrganisational set up of traffic engg department in India. Traffic characteristics. Max dimensions and weights of vehicles. Traffic growth. Traffic studies. Accident statistics, Accident study. Parking Issues. Road alignments and road geometrics affecting road safety. Land use planning and road safety.\n\n\n## UNIT-II\n\nSpace and time headway. Fundamental diagram of traffic flow. Relationship between speed, volume and density. Level of service. PCU. Design service volume. Capacity of non-urban & urban roads. Road congestion and road safety. IRC recommendations. Traffic control devices. Signal & Intersection Designs. Road markings, Traffic control aids and street furniture. Traffic control devices and road safety.\n\n\n## UNIT-III\n\nTraffic regulations. Regulation of speed, vehicles and drivers. General traffic regulations. Motor vehicle act. Scope of traffic management. Traffic management measures: restrictions on turning movements, one way streets, tidal flow operations, exclusive bus lanes, traffic restraint, road pricing. Enforcement and education measures for road safety.\n\n\n## UNIT-IV\n\nRoad safety audit, RSA team, RSA Report, Elements of RSA, Detrimental effects of traffic. Vehicular air pollution. Situation in India. Vehicular emission norms in India and abroad. Alternate fuels. Factors affecting fuel consumption. Arboriculture.",
    "reference books": "- Traffic Engg. and Transportation Planning by L.R.Kadiyali, Khanna Publishers, Delhi, 2002.\n- Highway Engg by S.K.Khanna & C.E.G. Justo, Veeraragavan A., Nem Chand Bros., Roorkee, 2014\n- Traffic Engg. by Matson, T.M., Smith, W.S. and Hurd, F.W., McGraw- Hill Book Co., New York.\n- Traffic Flow Theory by Drew, D.R., McGraw- Hill Book Co., New York.\n- Trainers Road Safety Manual, NHA and Ministry of Shipping, Road Transport and Highways, Govt of India.",
    "course outcomes": "At the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to road safety.\n- Design geometrics, signals and intersections, make investigations, use modern tools and develop solutions to traffic problems including safety of road users.\n- Understand the engineering solutions in societal and environmental context for sustainable development that takes care of pollution and environment.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/IRC/MoRTH specifications."
  },
  {
    "course code": "CEPE17",
    "course title": "TRANSPORTATION PLANNING",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "Transportation Engineering-I\n- To understand the importance of transportation planning\n- To know the planning process\n- To study the forecasting of travel demand\n- To learn the evaluation of transportation plans\n- To learn the problems of urbanisation\nContents Unit-I\nTRANSPORT PLANNING PROCESS\nStatus of transportation in India. Objectives and scope of transport planning. Urban, regional and national transport planning. Transport planning process, various stages. Land use and traffic.\nTRANSPORTATION SURVEY\nDefinition of study area. Zoning. Types of surveys. O-D surveys. Inventories of existing transport facilities, land use and economic activities.",
    "branch": "ce",
    "course content": "## Unit-II\n\n3 . TRIP GENERATION\nTrip purpose. Factors affecting trip generation. Trip generation estimation by multiple linear regression analysis, brief review of category analysis, advantages and limitations of these methods.\nTRIP DISTRIBUTION\nMethods of trip distribution. Basic concepts of uniform factor method, average factor method and opportunity model. Trip distribution by gravity model.\n\n\n## Unit-III\n\nTRAFFIC ASSIGNMENT\nPrinciples of assignment. Assignment techniques. All or nothing assignment. Brief review of multipath assignment, capacity restraint assignment and diversion curves.\nMODAL SPLIT\nGeneral considerations for modal split. Factors affecting modal split. Brief introduction to various methods of modal split.\n\n\n## Unit-IV\n\nEVALUATION\nNeed for evaluation. Several plans to be formulated. Testing. Considerations in evaluation. Economic evaluation, basic principles, brief introduction to various methods of economic evaluation, comparison.\nMASS RAPID TRANSIT SYSTEMS\nProblems of Urban Transport. Introduction to MRTS. Requirements of MRTS. Types of MRTS. MRTS in India. MRTS Corridor selection\nReferences Books\n- Traffic Engg. and Transport Planning by L.R.Kadiyali, Khanna Publishers, Delhi.\n- Highway Engg by S.K.Khanna & C.E.G. Justo, Nem Chand Bros., Roorkee.\n- Introduction to Transport Planning by Bruton, M.J., Hutchinson Technical Education, London.\n- Principles of Transportation Engg, P. Chakroborty & Animesh Dass, Prentice Hall of India, 2003.",
    "course outcomes": "At the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to urbanisation\n- Make investigations, use modern tools, forecast travel demand and develop solutions to cater to increased future traffic.\n- Understand the engineering solutions in societal and environmental context for sustainable development that takes care of optimal use of resources.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest know-how in the field of planning."
  },
  {
    "course code": "CEPE18",
    "course title": "POLLUTION CONTROL AND WASTE MANAGEMENT",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To understanding environment, impact of various activities on environment, sustainable development, ecology and biodiversity conservation\n- To understand air pollution, its effects and control methods\n- To understand noise pollution, its effects and control measures\n- To understand the sources, types and composition of municipal solid waste and the methods of solid waste disposal\nContent\n- Environment, Ecology and Biodiversity\nGlobal environment, impact of humans upon environment, impact of environment upon humans, population explosion and its effects on environment, need of sustainable development, conventional sources of energy and their impact on environment. Ecology: Ecosystem and its types, energy flow in ecosystems, food chains, trophic levels, food web, ecological pyramids, biogeochemical cycles - nitrogen, sulphur and phosphorus cycles, biodiversity and its importance, measures of biodiversity conservation\nAir Pollution\nComposition and structure of atmosphere, classification and sources of air pollutants, effects of air pollution on plants, animals, human health, economic effects of air pollution, greenhouse effect and global warming, ozone layer depletion and acid rains. Meteorological parameters influencing air pollution, plume behaviour. Air quality standards, air quality index, automobile pollution - effects and control measures. Atmospheric self – cleansing processes, approaches and techniques of air pollution control. Air pollution control devices: Gravitational settling chamber, cyclones, wet scrubbers, fabric filters, ESP and catalytic converters.\nNoise Pollution\nGeneral introduction to noise pollution, human acoustics, unit of measurement, loudness, measurements of noise and weighting networks, sources and effects of noise pollution, noise abatement/control, noise standards.\nSolid Waste Management\nDefinition, types, composition and sources of solid wastes, Solid Waste Management Rules (2016), storage and collection of municipal solid waste, methods of solid waste disposal – composting, incineration, pyrolysis and sanitary land filling, recovery of materials and energy from solid waste.",
    "reference books": "- Environmental Engineering by H. S. Peavy, D. R. Rowe and G. Tchobanoglous\n- Ecology by E. P. Odum\n- Air Pollution by M. N. Rao\n- Environmental Noise Pollution by P. F. Cuniff\n- Solid Waste Management Collection, Processing and Disposal by A. D. Bhide and B.\nB. Sundaresan",
    "course outcomes": "On completion of the course, the students will be able to\n- Understand importance of sustainable development, biodiversity conservation and environmental protection\n- identify the types and sources of air pollutants\n- predict the effects of air pollutants on human health and the environment\n- choose appropriate technologies for control of air pollutants\n- understand and select appropriate measures for noise pollution control\n- explain the various functional elements involved in solid waste management system\n- select suitable solid waste processing technologies and disposal methods"
  },
  {
    "course code": "CEPE19",
    "course title": "ENVIRONMENTAL IMPACT ASSESSMENT",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To learn the importance of environmental impact assessment in various development projects\n- To understand the legal provisions on EIA and EIA notifications\n- To brief the various methodologies involved in environmental impact assessment\n- To identify the prediction tools for the assessment of different environmental impacts\n- To describe the concepts of environmental management system.\nNational environmental policy, impacts of development projects on environment, Environmental Impact Assessment (EIA) and Environmental Impact Statement (EIS) - Objectives - EIA Types, EIA in project cycle - Capacity and limitations, Legal provisions on EIA, Environmental Impact Assessment notification, Methods of categorization of industries for EIA, Elements of EIA - Process screening, baseline studies, mitigation, Methods of EIA - matrices, checklist - strength, weakness and applicability, Prediction and assessment of impact on land, water, air, noise and energy, flora and fauna, Socio economic impact, Mathematical models for impact prediction, rapid EIA, public participation, Post environmental audit. Plan for mitigation of adverse impact on environment – Options for mitigation of impact on water, air and land, energy, flora and fauna; addressing the issues related to the project affected people, Environment Management Plan – ISO 14000. EIA case studies for new and expansion projects: township projects, river valley projects, thermal power plants and industrial plants.\nReferences Books\n- Environmental Impact Assessment by Canter, R. L.\n- Environmental Impact Assessment Methodologies, Anjaneyulu, Y\n- Concepts in Environmental Impact Analysis by Shukla S. K. and P. R. Srivastava\n- Environmental Impact Analysis by John G. Rao and David C. Hooten (Ed.).",
    "course outcomes": "At the end of the course, the students will be able to\n- Analyse the environmental impacts of proposed projects\n- Categorize the type of EIA required for proposed projects\n- Predict and assess the impact of proposed projects on the environment\n- Use mathematical tools to predict the environmental impacts\n- Propose proper mitigation measures to avoid environmental impacts\n- Summaries the EIA report with suitable environmental management plan"
  },
  {
    "course code": "CEPE20",
    "course title": "GROUND WATER ENGINEERING",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "",
    "branch": "ce",
    "reference books": "- Pankaj Agarwal and Manish ShriKhande, Earthquake Resistant Design of Structures, Prentice- Hall of India, New Delhi, 2003.\n- Bullen K.E., Introduction to the Theory of Seismology, Great Britain at the University Printing houses, Cambridge University Press 1996.",
    "course learning objectives": "- To introduce the basics of Earthquake Engineering\n- To introduce the engineering seismology, building geometrics & characteristics, structural irregularities,\n- To introduce tips on earthquake engineering - do’s and don’ts\n- To introduce cyclic loading behaviour of RC, steel and pre-stressed concrete elements\n- To discuss code provisions and their application on different types of structures",
    "course content": "Elements of Engineering Seismology - Theory of Vibrations -Indian Seismicity -Earthquake History - Behavior of structures in the past Earthquakes. Seismic Design Concepts - Cyclic loading behavior of RC, Steel and Prestressed Concrete elements - Response Spectrum- Design spectrum - capacity based design. Provision of Seismic Code frames, shear walls, Braced frames, Combinations - Torsion. Performance of Regular Buildings 3D Computer Analysis of Building Systems (Theory only) - Design and Detailing of frames - Shear walls and Frame walls. Seismic performance - Irregular Buildings -Soil performance, Modern Concepts - Base Isolation - Adoptive systems - Case studies.",
    "course outcomes": "On completion of the course, the students will be able to:\n- apply the basics of Earthquake Engineering\n- demonstrate the dynamics of structural system under earthquake load\n- analyze the influence of the structural / geometrical design in building characteristics\n- demonstrate the cyclic loading behaviour of RC steel and pre-stressed concrete elements\n- Apply Codal provisions on different types of structures."
  },
  {
    "course code": "CEPE40",
    "course title": "APPLICATION OF ARTIFICIAL INTELLIGENCE TO CIVIL ENGINEERING",
    "course type": "PE",
    "number of credits": "3",
    "prerequisites": "Knowledge of basic civil engineering\nIntroduction to Artificial Neural Network: Feed-forward and Feed-Backward -work. Neural network learning rules. Linear separability of training patterns, Perceptron learning Algorithms. Multilayer Networks: Exact and approximate representation using feed forward net-works, Fixed Multilayer feed forward Network Training by Back propagation.\nRecurrent Network: Symmetric networks and Associative Memory, Bi-directional Associative Memory. Analog Hopfield networks, simulated Annealing in optimization. Case studies for modeling using ANN and Fuzzy.\nIntroduction to Fuzzy logic: Statistics and random Processes, Uncertainty in information. Classical Sets and Fuzzy Sets: Classical sets, operations on classical sets, properties of classical sets. Mapping of classical sets to functions, Fuzzy sets, fuzzy set operations, properties of Fuzzy sets\nClassical Relations and Fuzzy Relations: Cartesian product, crisp, relations, cardinality of crisp relations, operations on crisp relation, properties of crisp relations. Composition, fuzzy relations. Cardinality of Fuzzy relations, operations on Fuzzy relations. Properties of Fuzzy relations. Membership Functions: Fuzzification, Membership value assignment. Fuzzy-to- crisp Conversions: Defuzzification Methods.",
    "branch": "ce",
    "reference books": "- Zurada, J.M. Introduction to artificial neural Network System. Jaico Publicating House.\n- Haykin, S.ANN a comprehensive Foundation. Macmillan College Publising Company, New York.\n- Bose, N.K. and Liang, P. Neural network Fundamentals with Graphs Algorithms, and Applications. Tata Mc'Graw Hill. ~\n- Ross, J. Timothy. \" Fuzzy logic with Engineering Applications\". Mc Graw Hill.\n- Asai, K. Fuzzy systems for information processing\". IOS press.\nCourse Outcome: On completion of the course, the students shall be able to:\n- Incorporate skills in developing models for various systems\n- Develop neural network and fuzzy logic model.\n- Provides basic knowledge on fuzzy system and optimization tools\n- Apply modeling tools to civil engineering problems"
  },
  {
    "course code": "CEOE11",
    "course title": "MACHINE FOUNDATIONS",
    "course type": "OE",
    "number of credits": "4",
    "prerequisites": "Knowledge of Geotechnical Engineering.\nCourse Learning Objective:\n- To explain the principles of machine foundation design for reciprocating and impact machines\n- To explain the concept and method of foundation isolation",
    "branch": "ce",
    "course content": "- Theory of Vibrations\nDefinitions, harmonic motion, vibrations of a single degree freedom system, transmissibility, theory of vibration measuring instruments.\nGeneral Principles of Machine Foundation Design\nTypes of machines and machine foundations, criteria for satisfactory action of a machine foundation, permissible amplitude, allowable soil pressure, permissible stresses in concrete and steel, permissible stresses in timber.\nEvaluation of Parameters\nModes of vibration of a rigid block foundation, Barken's soil spring constants, determination of coefficients of elastic uniform compression and Elastic uniform shear.\nFoundations for Reciprocating Machines\nAnalysis of block foundation by Barken's theory of linear elastic weightless spring analogy, Indian Standard for design and construction of foundation for reciprocating machine, design procedure, design examples.\nFoundation for Impact Machines\nDynamic analysis, Barken's recommendations for weight and base contact area, IS Code practice for design and construction of foundations for impact machines, design procedure, design examples.\nFoundations for Rotary Machines\nSpecial considerations, design criteria, methods of analysis and design.\nVibration Isolation and Screening:\nActive isolation, passive isolation, methods of isolation, wave screening, vibration absorbing materials, planning for vibration isolation.",
    "reference books": "- D.D.Barken, Dynamics of Bases and Foundations\n- Shamsher Prakash, Soil Dynamic, McGraw Hill, 1981.\n- Swami Saran, Soil Dynamics and Machine Foundations\n- B.M.Das, Principles of Soil Dynamics\n- Crede, Vibration and Shock Isolation\nCourse Outcome: On completion of this course, the students will be able to: 1 Understand the dynamic behaviour of foundations.\n2 Select foundations for dynamic loading 3 Design machine foundations\n4 Identify vibration isolation techniques"
  },
  {
    "course code": "CEOE12",
    "course title": "GEOTECHNICAL EARTHQUAKE ENGINEERING",
    "course type": "OE",
    "number of credits": "4",
    "prerequisites": "Knowledge of Engineering Geology and Geotechnical Engineering.",
    "branch": "ce",
    "course learning objectives": "- To explain the mechanism of earthquake and its related causes to build structures and in-situ soils\n- To explain how ground motion is recorded and how do quantify the earthquake intensity and frequency related parameters\n- To explain how seismic site investigation will be done and seismic soil design parameters are estimated\n- To explain how seismic resistant design of foundation will be done and also explain the concept of liquefaction and related causes including codal recommendations\n- To explain how to do hazard assessment and mitigation and explain how do prepare a risk and microzonation mapping",
    "course content": "- Mechanism of Earthquakes - Causes of earthquake - Earthquake Fault sources – Elastic Rebound theory - Seismic wave in Earthquake shaking - terminology - Locating an earthquake - Quantification of earthquakes. Strong Motion Records - characteristics of ground motion - Factors influencing Ground motion - Estimation of frequency content parameters\n- Seismic site investigations – Selected Case Studies - Evaluation of Dynamic soil properties – Codal Provisions Design Ground Motion - Developing\n- Design Ground Motion-Codal recommendations.\n- Earthquake Resistant Design of foundation of buildings - Design considerations -. Earthquake Response of slopes - Evaluation of slope stability – Liquefaction Susceptibility - Liquefaction Resistance-Codal recommendations.\n- Risk mapping - Hazard assessment – Mitigation measures - Seismic microzonation and its importance",
    "reference books": "- Kameswara Rao, N.S.V., Dynamics soil tests and applications, Wheeler Publishing - New Delhi, 2000.\n- Krammer S.L., Geotechnical Earthquake Engineering, Prentice Hall, International Series, Pearson Education (Singapore) Pvt. Ltd., 2004.\n- Kameswara Rao, Vibration Analysis and Foundation Dynamics, Wheeler\n- Robert W. Day, Geotechnical Earthquake Engineering Hand book, McGraw Hill, 2002\n- Debashis Moitra, Geotechnical Engineering, Universities Press, Edition No. - I, 2016.",
    "course outcomes": "On completion of the course, the students will be able to:\n- Demonstrate the principles of earthquake loading\n- Quantify earthquake intensity and ground motion\n- estimate seismic soil design parameters\n- analyze and design seismic resistant foundation for buildings\n- prepare soil risk and microzonation maps"
  },
  {
    "course code": "CEOE13",
    "course title": "TRAFFIC ENGINEERING AND ROAD SAFETY",
    "course type": "OE",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To understand the importance of traffic engineering, characteristics of traffic and Causes of road accidents\n- To know the relationship between contributing factors and road accidents\n- To study the traffic control devices and principles of signal / intersection design to address the problem of road accidents\n- To learn the environmental issues related to road traffic",
    "course content": "## UNIT-I\n\nOrganisational set up of traffic engg department in India. Traffic characteristics. Max dimensions and weights of vehicles. Traffic growth. Traffic studies. Accident statistics, Accident study. Parking Issues. Road alignments and road geometrics affecting road safety. Land use planning and road safety.\n\n\n## UNIT-II\n\nSpace and time headway. Fundamental diagram of traffic flow. Relationship between speed, volume and density. Level of service. PCU. Design service volume. Capacity of non-urban & urban roads. Road congestion and road safety. IRC recommendations. Traffic control devices. Signal & Intersection Designs. Road markings, Traffic control aids and street furniture. Traffic control devices and road safety.\n\n\n## UNIT-III\n\nTraffic regulations. Regulation of speed, vehicles and drivers. General traffic regulations. Motor vehicle act. Scope of traffic management. Traffic management measures: restrictions on turning movements, one way streets, tidal flow operations, exclusive bus lanes, traffic restraint, road pricing. Enforcement and education measures for road safety.\n\n\n## UNIT-IV\n\nRoad safety audit, RSA team, RSA Report, Elements of RSA, Detrimental effects of traffic. Vehicular air pollution. Situation in India. Vehicular emission norms in India and abroad. Alternate fuels. Factors affecting fuel consumption. Arboriculture.",
    "reference books": "- Traffic Engg. and Transportation Planning by L.R.Kadiyali, Khanna Publishers, Delhi, 2002.\n- Highway Engg by S.K.Khanna & C.E.G. Justo, Veeraragavan A., Nem Chand Bros., Roorkee, 2014\n- Traffic Engg. by Matson, T.M., Smith, W.S. and Hurd, F.W., McGraw- Hill Book Co., New York.\n- Traffic Flow Theory by Drew, D.R., McGraw- Hill Book Co., New York.\n- Trainers Road Safety Manual, NHA and Ministry of Shipping, Road Transport and Highways, Govt of India.",
    "course outcomes": "At the end of the course, the students will be able to:\n- Gain Engineering knowledge of the subject and apply it for the solution of problems related to road safety.\n- Design geometrics, signals and intersections, make investigations, use modern tools and develop solutions to traffic problems including safety of road users.\n- Understand the engineering solutions in societal and environmental context for sustainable development that takes care of pollution and environment.\n- Understand the norms of engineering practice and the need for life-long learning as per their exposure to relevant latest IS/IRC/MoRTH specifications."
  },
  {
    "course code": "CEOE14",
    "course title": "ENVIRONMENTAL STUDIES",
    "course type": "OE",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course learning objectives": "- To become aware of various issues related to environment degradation, poverty, development and social welfare and their interlinking.\n- To understand various environmental problems arising due to human activities and the reasons of those problems.\n- To understand importance of natural resources, ecosystem preservation, biodiversity conservation and pollution control.",
    "course content": "## Unit 1: Multidisciplinary nature of environmental studies\n\nDefinition, scope and importance, need for public awareness.\n\n\n## Unit 2: Natural Resources: Renewable and non-renewable resources\n\nNatural resources and associated problems\n- Forest resources: Use and over-exploitation, deforestation, case studies. Timber extraction, mining, dams and their effects on forest and tribal people.\n- Water resources: Use and over-utilization of surface and ground water, floods, drought, conflicts over water, dams-benefits and problems.\n- Mineral resources: Use and exploitation, environmental effects of extracting and using mineral resources, case studies.\n- Food resources: World food problems, changes caused by agriculture and overgrazing, effects of modern agriculture, fertilizer-pesticide problems, water logging, salinity, case studies.\n- Energy resources: Growing energy needs, renewable and non renewable energy sources, use of alternate energy sources, case studies.\n- Land resources: Land as a resource, land degradation, man induced landslides, soil erosion and desertification.\nRole of an individual in conservation of natural resources, Equitable use of resources for sustainable lifestyles.\n\n\n## Unit 3: Ecosystems\n\nConcept of an ecosystem, Structure and function of an ecosystem, Producers, consumers and decomposers, Energy flow in the ecosystem, Ecological succession, Food chains, food webs and ecological pyramids, Introduction, types, characteristic features, structure and function of the following ecosystem: Forest ecosystem, Grassland ecosystem, Desert ecosystem, Aquatic ecosystems (ponds, streams, lakes, rivers, oceans, estuaries\n\n\n## Unit 4: Biodiversity and its conservation\n\nIntroduction – Definition : genetic, species and ecosystem diversity, Biogeographical classification of India, Value of biodiversity : consumptive use, productive use, social, ethical, aesthetic and option values, Biodiversity at global, National and local levels, India as a mega-diversity nation, Hot-sports of biodiversity, Threats to biodiversity : habitat loss, poaching of wildlife, man-wildlife conflicts, Endangered and endemic species of India, Conservation of biodiversity : In-situ and Ex-situ conservation of biodiversity.\n\n\n## Unit 5: Environmental Pollution\n\nDefinition, Cause, effects and control measures of - Air pollution, Water pollution, Soil pollution, Marine pollution, Noise pollution, Thermal pollution, Nuclear hazards\nSolid waste Management: Causes, effects and control measures of urban and industrial wastes, Role of an individual in prevention of pollution, Pollution case studies.\nDisaster management: floods, earthquake, cyclone and landslides.\n\n\n## Unit 6: Social Issues and the Environment\n\nFrom Unsustainable to Sustainable development, Urban problems related to energy, Water conservation, rain water harvesting, watershed management, Resettlement and rehabilitation of people; its problems and concerns, Case Studies, Environmental ethics: Issues and possible solutions. Climate change, global warming, acid rain, ozone layer depletion, nuclear accidents and holocaust, Case Studies, Wasteland reclamation, Consumerism and waste products, Environment Protection Act, Air (Prevention and Control of Pollution) Act, Water (Prevention and control of Pollution) Act, Wildlife Protection Act, Forest Conservation Act, Issues involved in enforcement of environmental legislation, Public awareness.\n\n\n## Unit 7: Human Population and the Environment\n\nPopulation growth, variation among nations, Population explosion – Family Welfare Programme, Environment and human health, Human Rights, Value Education, HIV/AIDS, Women and Child Welfare, Role of Information Technology in Environment and human health, Case Studies.",
    "reference books": "1 Text Book for Environmental Studies by Erach Bharucha",
    "course outcomes": "On completion of the course, the students will be able to\n- Understand various problems related to environmental degradation and suggest appropriate measures for environmental protection.\n- Take appropriate measures for ecosystem and biodiversity conservation to maintaining ecological balance.\n- Device appropriate strategies for control effects of pollution.\n- Involve all stakeholders for sustainable development of society."
  },
  {
    "course code": "CEOE15",
    "course title": "GEOINFORMATICS",
    "course type": "OE",
    "number of credits": "4",
    "prerequisites": "",
    "branch": "ce",
    "course objectives": "To provide student knowledge of shortage and excess of precipitation and its impact on human life.",
    "course content": "- Drought\nDefinition, causes, types, indices, management, water harvesting\nFlood Problems\nCauses, alleviation\nEstimation of design floods\nMethods of computations\nFlood routing through reservoirs and channels\nPuls method, Muskingum method\nSpillway designs\nFunctions, types\n- Flood mitigation\nVarious types of storages, Reservoir operation, river improvement works\nFlood forecasting, warning and fighting\nForecasting techneques, engineering measures for flood fighting\nDesign of subsurface drainage systems\nNecessity, design of underdrains\nDesign of surface drainage systems\nNecessity, design of underdrains",
    "reference books": "- Engineering Hydrology by K.Subramanya.\n- Hydrology for Engineers by Linsely, Kohler, Paulhus.\n- Flood Control and Drainage Engineering by S.N. Ghosh\n- Water Resources Engineering by Larry W. Mays\n- Land drainage Principles, methods and applications by A K Bhattacharya and AM Micael",
    "course outcomes": "Students will be able to understand methods of design structures required to drought and flood."
  },
  {
    "course code": "CCEOE18",
    "course title": "ADVANCED CONCRETE TECHNOLOGY",
    "course type": "OPEN ELECTIVE",
    "number of credits": "3",
    "prerequisites": "Knowledge of Concrete and its ingredients.\nIntroduction - Concrete materials - Cement: Physical tests on cement - Concrete materials - Tests on aggregates - Quality of Water for mixing and curing - use of sea water for mixing concrete. Rheology of concrete- Introduction, Rheological behaviour, Factors affecting rheological properties, mixture adjustments.\nMix Design - factors influencing mix proportion - Mix design by ACI method and I.S. code method - Design of normal concrete, high strength concrete and self compacting concrete. Admixtures - accelerating admixtures - Retarding admixtures - water reducing admixtures - Air entraining admixtures - coloring agent - Plasticizers. Batching - Mixing -Transportation - Placing of concrete - curing of Concrete.\nStrength of Concrete - Shrinkage and temperature effects - creep of concrete - permeability of concrete - durability of concrete - Corrosion - Causes and effects - remedial measures- Thermal properties of concrete - Micro cracking of concrete, microstructure of concrete. Classification of causes of concrete deterioration – Permeability of concrete – Chloride penetration – Acid attack - Sulfate attack – Alkali-aggregate reaction – Concrete in sea water\n– AC impedance test - Corrosion of embedded steel in concrete – Case histories..\nSpecial Concrete - High Performance Concrete (HPC) Introduction – Principles of HPC – Ingredients used for HPC – Production of HPC – Curing of HPC – Mechanism of HPC – Properties of HPC during the fresh and hardened state. Durability of HPC - Acid Attack – Permeability – Scaling resistance – Chloride penetration – Resistance to sea water – sulfate attack – Alkali-aggregate reaction – Fire resistance – Mix design methods of HPC. Special High Performance Concrete-Air-entrained HPC Reactive powder Concrete-Bio concrete-Geo polymer, Fiber reinforced concrete Quality control - Sampling and testing-Acceptance criteria.",
    "branch": "ce",
    "reference books": "- Shetty, M.S., Concrete Technology, Theory & Practice, S.Chand and Co, 2004.\n- Gambhir, M.L., Concrete Technology, Tata McGraw Hill, 2004.\n- Nevile, Properties of Concrete, Longman Publishers, 2004.\n- Santakumar A.R., Concrete Technology, Oxford University Press, New Delhi, 2007.\n- P.-C.Aïtcin, High Performance Concrete, E &FN SPON, 1998\n- E.G.Nawy, Fundamentals of High Performance Concrete, John Wiley & Sons., 2nd edition, 2000\n- High Performance Concrete Structural Designers Guide published by FHWA, USA, 2005.\n- Geert De Schutter, Peter J.M. Bartos, Peter Domone, John Gibbs, Self Compacting Concrete, Whittles Publishing, 2008.\nCourse Outcome: On completion of the course, the students shall be able to:\n- Test all the concrete materials as per IS code.\n- Design the concrete mix using ACI and IS code methods.\n- Determine the properties of fresh and hardened of concrete.\n- Design special concretes and their specific applications.\n- Ensure quality control while testing/ sampling and acceptance criteria."
  }
]
