[
  {
    "course code": "EEIR 11",
    "course title": "Familiarization to Electrical Engineering",
    "number of credits": "02-0-0=02",
    "prerequisites": "_",
    "course type": "EIR",
    "branch": "ee",
    "course learning objectives": "- To provide basic knowledge of the different elements of electrical engineering field.\n- To understand basic concepts of electrical engineering.",
    "course content": "## UNIT-I\n\nBasic Circuits & Measurements:\nBasics of circuit theory, phasor representation of signals, properties of signal, Series and parallel circuit analysis with resonance, Three-phase systems, analysis of three phase circuits and their properties, Two wattmeter method. Magnetic circuits and their properties.\n\n\n## UNIT-II\n\nElectrical Machines:\nPrinciple and working of transformers, equivalent circuit, open circuit and short circuits tests, losses and efficiency. Principle and working of DC motors, DC generators, and induction motors (three phase and single phase), Basic calculations of these motors and generators, Characteristic curves, speed control of dc shunt motor, application of dc generators and motors.\n\n\n## UNIT-III\n\nPower Electronics and Power systems:\nStructure of power system, Generation, Transmission and Distribution, , Single-line diagrams, Basics protection of power systems.\nBasic Functions of Static Converters, Semiconductor switches.\n\n\n## UNIT-IV\n\nControl System\nConcept of control, control system terminology, classification of Control Systems, Open and closed loop systems.\nReferences:\n- V. Del Toro, “Principles of Electrical engineering”, PHI.\n- E. Huges, “Electrical Technology”, ELBS.\n- A. E. Fitzerald, D. E. Higginbotham and A. Grabel, “Basic Electrical Engineering”, MGH.\n- PS Bhimbra.Power Electronics, Khanna Publishers.\n- Klemens Heumann, Basic Principles of Power Electronics, Springer-Verlag Berlin Heidelberg.\n- Nagrath and Gopal, Control System Engg, TMH.\n- IJ Nagrath and DP Kothari,”Power System Engineering” Tata McGraw-Hill.",
    "course outcomes": "Students who successfully complete the course will be able to:\n- Understand basic principle and operation of electric circuits and machines.\n- Solve basic problems related to electrical circuits and machines.\n- Explain the operation of different electrical technologies.\n- Demonstrate an understanding of the control systems."
  },
  {
    "course code": "EEPC 10",
    "course title": "Electrical Circuits and Networks",
    "number of credits": "3-1-0=4",
    "prerequisites": "--",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- Understand about the network elements, network theorems\n- Understand the fundamentals of non-linear circuits, transient response, and resonance concept.\n- Gain knowledge about the two-port networks.\n- Gain knowledge about synthesis of RL,RC & RLC networks",
    "course content": "## UNIT-I\n\nClassification of circuits, sources and signals, standard signals, source transformations, Network topology, graph matrices, formulation and solution of circuit equations based on graph theory using different analysis techniques- circuit, cut set and mixed. Concept of duality, Network theorems and their applications- Superposition, reciprocity, Thevenin, Norton, Maximum power transfer, Millman, Substitution, Compensation and Tellegan’s theorem.\n\n\n## UNIT-II\n\nIntroduction to non-linear circuits and their analysis. Analysis of circuits with dependent sources, Time constants and Transient response under d.c. and a.c. excitation. Analysis of magnetically coupled circuits, Series and parallel resonance circuits, bandwidth and Q-factor, response with variation in parameters and frequency.\n\n\n## UNIT-III\n\nConcept of one port, two-port networks, characteristics and parameters, interrelationships of parameters, image & iterative impedance, concept of characteristic impedance, scattering parameters, insertion loss, interconnection of 2-port networks, analysis of terminated 2-port networks, extensions to multiport networks.\n\n\n## UNIT-IV\n\nGeneralized network functions (Driving point and Transfer), concepts of poles and zeros, determination of free and forced response from poles and zeros, concept of minimum phase networks, analysis of ladder, lattice, T and bridged-T networks.Network synthesis- Synthesis problem formulation, properties of positive real functions, hurwitz polynomials, properties of RC, LC and RL driving point functions, Foster and Cauer synthesis of LC and RC circuits.\nReferences:\n- Vanvalkenburg. M.E, ”Network Analysis”, PHI, 3rd Edition, 2014.\n- Franklin. F, Kuo, ”Network Analysis and Synthesis”, 2nd Edition, Wiley India Ltd., 2006\n- Ghosh &. S.P, Chakraborthy. A.K “Network Analysis and Synthesis” McGraw Hill, 2010",
    "course outcomes": "At the end of the course student will be able to\n- Understand the fundamental of network theorems.\n- Apply the knowledge of network analysis in technical problem solving\n- Understand the impact of network synthesis and can apply in various engineering problem"
  },
  {
    "course code": "EEPC12",
    "course title": "Measurement and instrumentation",
    "number of credits": "3-0-0=3",
    "prerequisites": "--",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To develop an understanding of the fundamentals of measurements.\n- To be able to make measurement of voltage, current phase and frequency by analog and digital techniques.\n- To know about the function of construction and synchronization of C.R.O.\n- To understand the recorders and Telemetry and data acquisition.\n- To make studies about the various transducers for measurement of position, force, pressure, temperature, torque, flow, velocity etc.",
    "course content": "## UNIT-I\n\nError analysis, Concepts and introduction to analog measurement of voltage, current, energy, phase and frequency, CRO.\n\n\n## UNIT-II\n\nMeasurement of low, medium and high resistances, Concept of AC bridges for measurement of inductance and capacitance, Instrument transformers; Current transformer and potential transformer, their performance characteristics.\n\n\n## UNIT-III\n\nDigital Instruments, Analog to digital (A/D) and digital to analog (D/A) conversion, digital voltmeter and ammeter, digital frequency meter, digital energy meter, and digital wattmeter, Data acquisition (Analog and digital), Telemetry and recorders\n\n\n## UNIT-IV\n\nTransducers: Classification, transducers for measurement of position, force, pressure, temperature, torque, flow, velocity (linear and angular) strains, humidity, vibrations and pH value.\nReferences:\n- AK Sawhney, “Electrical and Electronic Measurements &amp;Instrumentation”,Dhanpat Rai, Delhi.\n- C.T. Baldwin , “Fundamentals of Electrical Measurement”, Lyall Book Depot.\n- E.W. Golding, “Electrical Measurement”.\n- W.D. Cooper- “Electronics Instrumentation and Measurement Techniques”, Prentice Hall India.\n- B.C. Nakra and K.K. Chaudhry- “Instrumentation Measurement and Analysis”, Tata Mc-Graw- Hill Publishing Company Limited, New Delhi.",
    "course outcomes": "On successful completion of this course students will able to\n- Measure voltages and current.\n- Know the properties of digital instruments.\n- Measurement with C.R.O and its synchronization.\n- Measurement of phase and frequency.\n- Transducers and its applications\n- Knowledge of data acquisition system."
  },
  {
    "course code": "EEPC 14",
    "course title": "Signals and Systems",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEIR11, MAIR11",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To study properties and representation of various continuous and discrete-time signals.\n- To acquire knowledge of time-domain analysis in terms of difference equations, impulse response and convolution etc.\n- To acquire knowledge of frequency-domain analysis using Fourier series, Fourier, Laplace and Z transforms.\n- To gain insight into the concepts of sampling process.\n- To study different types of systems, their properties and modeling.",
    "course content": "## UNIT-I\n\nSIGNALS AND SYSTEMS:\nIntroduction, Continuous and discrete time signals: periodic-aperiodic, even-odd, complex exponential-sinusoidal, deterministic-stochastic, energy-power, impulse-step, transformation of independent variable.\nContinuous and discrete time systems: introduction, interconnection, basic properties- memory-memoryless, invertibility, causality, stability, time invariance, linearity.\n\n\n## UNIT-II\n\nLTI SYSTEMS:\nIntroduction, Continuous and discrete time LTI systems: representation in terms of impulses, unit impulse, step and complex exponential response using convolution integral/sum, Properties of LTI systems, Modeling of continuous and discrete time LTI systems.\n\n\n## UNIT-III\n\nFOURIER SERIES AND TRANSFORM:\nIntroduction, Fourier series: representation of continuous and discrete time periodic signals, convergence, properties, Application to LTI systems, Fourier transform: introduction, representation of continuous and discrete time aperiodic and periodic signals, convergence, properties, Application to LTI systems.\nSAMPLING:\nIntroduction, sampling of continuous time signals; sampling theorem, reconstruction, effect of undersampling.\n\n\n## UNIT-IV\n\nLAPLACE TRANSFORM:\nIntroduction, Laplace transform and its inverse, region of convergence, relation with Fourier transform, properties, Application to LTI systems, their interconnections and block diagram.\nZ TRANSFORM:\nIntroduction, z-transform and its inverse, region of convergence, relation with Fourier transform, properties, Application to LTI systems, their interconnections and block diagram.\nReferences\n- Alan V. Oppenheim, S. Hamid and Alan S. Willsky, Signals and Systems, PHI/Pearson.\n- M. J. Roberts, Signals and Systems, TMH\n- A. Papoulis, Circuits and Systems: A Modern Approach, Oxford Univ. Press\n- R.F. Ziemer, W.H. Tranter and D.R. Fannin, Signals and Systems: Continuous and\n- Discrete, Pearson\n- Simon Haykins and Barry Van Veen, Signals and Systems, Wiley\n- Fred J. Taylor, Principles of Signals and Systems, TMH",
    "course outcomes": "On successful completion of the course, students will be able to\n- Characterize and analyze the properties of CT and DT signals and systems\n- Analyze CT and DT systems in Time domain using convolution\n- Represent CT and DT systems in the Frequency domain using Fourier analysis tools like CTFS, CTFT, DTFS and DTFT.\n- Conceptualize the effects of sampling a CT signal\n- Analyze CT and DT systems using Laplace transforms and Z Transforms.\n- Modeling different systems with detailed analysis of LTI systems."
  },
  {
    "course code": "EEPC21",
    "course title": "Control Systems - I",
    "number of credits": "3-1-0=04",
    "prerequisites": "EEPC10; EEPC14",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To study the fundamental concepts of control system problems and their solution possibilities,\n- To study about the mathematical modelling of the various physical systems,\n- To study the concept of time-domain response (transient and steady-state response) and frequency-domain analysis of the systems,\n- To study the basics of stability analysis of the systems,\n- To study about the specifications of controller and compensator design and its implementations.",
    "course content": "## UNIT-I\n\nMOTIVATION, MODELS AND PHYSICAL SYSTEMS\nIntroduction to Control System: The control problem and solution possibilities, the notion objectives/ specifications, feedback as natural strategy, regulation, set-point and tracking problems, concept of stability.\nTransfer Function: Definition, examples with mechanical, electrical, hydraulic, pneumatic systems and systems with dead zone.\nDescription of Control System Components: Error detectors, gears, gyroscope, DC motors, servomotors, techo-generators, servo amplifiers, synchros; block diagram and reduction techniques, signal flow graphs, mason’s gain formulae, performance of feedback Systems.\n\n\n## UNIT-II\n\nTIME-DOMAIN ANALYSIS\nTransient Response Analysis: Transient and steady-state response analysis for first and second order systems and their qualitative analysis; impact of close looping on system parameters and their sensitivity, error analysis and error constants.\nRoot Locus Analysis: Development of root loci, root motions under close-looping, effects of pole/zero on loci, effect of rate and reset times, stability, relative stability and time-domain specification using root locus.\n\n\n## UNIT-III\n\nFREQUENCY-DOMAIN ANALYSIS\nStability Analysis: Routh’s array analysis; Routh-Hurwitz stability criterion, relative stability and frequency-domain specifications analysis using Bode plots, Nichols plot, Polar plots, Nyquist plot; M and N circles.\n\n\n## UNIT-IV\n\nCONTROLLER/ COMPENSATOR DESIGN\nController Design: Specifications of time-domain and frequency domain and interrelation between them; design of P, PD, PI, PID error control strategies; impact on transient response and steady-state response.\nCompensator Design: Lead, lag and lag-lead compensation, compensator design using root-locus and frequency response methods; role of gains; role of phase.\nReferences:\n- D’ Azzo and Houpis, Linear Control Systems Analysis and Design, McGrow Hill, Edition No. 05, 2003.\n- Katsuhiko Ogata, Modern Control Engineering, Pearson Education, Edition No. 05, 2010.\n- M. Gopal, Control Systems Principles and Design, Tata McGrow Hill, Edition No. 04, 2010.\n- N. S. Nise, Control Systems Engineering , Wiley, Edition No. 07, 2015.\n- Dorf and Bishop, Modern Control Systems, Addison Wesley,Edition No. 13, 2017.\n- Nagrath& Gopal, Modern Control Engineering, New Ages International, Edition No. 05, 2010.\n- Raymond T. Stephani, Design of Feedback Control Systems, Oxford University Press, Edition No. 04, 2002.",
    "course outcomes": "At the end of the course student will have\n- Fundamental knowledge of control system, mathematical modelling of various physical systems,\n- Determine the response of first and second order systems for various inputs,\n- Analyze the transient and steady-state response open-loop and closed-loop systems,\n- Analyze the stability of the in time-domain as well as in frequency-domain,\n- Design and implementation of P, PD, PI, PID controllers and lead, lag and lag-lead compensators."
  },
  {
    "course code": "EEPC22",
    "course title": "Network Synthesis and Filters",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC10",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The course is aimed at imparting talent into the student for transforming mathematical equations into physical electrical networks, impart fundamentals of the magnitude and phase considerations of electrical circuits followed by the design of electric filters to achieve desired magnitude and phase over pre-specified band of frequencies. The learner will learn the behavior of impedance matching and phase shifting networks.",
    "course content": "## UNIT-I\n\nFundamental Concepts: Energy considerations, positive real condition, Hurwitz polynomials,\nBounded realness, scattering description of networks.\n\n\n## UNIT-II\n\nLossless one port network functions, Foster reactance functions and theorem, canonical forms: Cauer’s and Foster’s, Synthesis of lossless LC Immitance functions, Synthesis of lossyRL and RC functions, Certain RLC function realizations. Fundamentals of two port network synthesis.\n\n\n## UNIT-III\n\nPassive Filter Design: Analysis and Design of Constant K and m-derived filters,\nActive Filter Design: Amplitude and phase functions, amplitude approximations, phase approximations, simultaneous amplitude and phase approximations, Group delay response, equi- distant linear phase approximations.\n\n\n## UNIT-IV\n\nMaximally flat and Equi-ripple filters, Magnitude and frequency normalizations, frequency transformations; High Pass, Band-Pass, Band-stop filters,\nImpedance matching networks, Phase shift networks.\nReferences:\n- H. Baher, “Synthesis of Electrical Networks”, John Wiley & Sons, 1984.\n- Franklin Kuo, “Network Analysis and Synthesis”, Second Edition, Wiley, 2009.\n- Steve Winder, “Analog and Digital Filter Design”,Newnes, Elsevier Science, 2002.",
    "course outcomes": "The students shall be able to\n- Transform the mathematical driving point or transfer relations into realizable electrical circuits.\n- Think and design analog electric filters."
  },
  {
    "course code": "EEPC 23",
    "course title": "Electrical Machines-I",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC 10",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- Understanding basic principles of energy conversion in electromechanical systems, construction and operation of dc machines in motoring and generating modes.\n- Comprehend the magnetizing characteristics and operation of single phase as well as the three-phase transformers.",
    "course content": "## UNIT-I\n\nElectromechanical Energy Conversion Principles\nEnergy in a magnetic systems, field energy and mechanical force, energy in singly and multiply excited magnetic systems, determination of magnetic force and torque from energy and co-energy, Forces and torques in magnetic field systems, dynamic equations of electromechanical systems and analytical techniques.\nSingle Phase Transformer\nTransformer construction, Ideal and practical trans former, exact and approximate equivalent circuits, no load and on load operation, phasor diagrams, power and energy efficiency, voltage regulation, parallel operation, effect of load on power factor, Per Unit system, excitation phenomenon in transformers, switching transients, Auto transformers, Variable frequency transformer, voltage and current transformers, welding transformers, Pulse transformer and applications.\n\n\n## UNIT-II\n\nThree Phase Transformers\nConstructional features of three phase transformers, Cooling methodology, Standard and special transformer connections, Phase conversion, Parallel operation of three phase transformers, three winding transformers and its equivalent circuit, On load tap changing of transformers, Modern trends in transformers, Type and routine tests, Standards.\n\n\n## UNIT-III\n\nDC Generators\nConstruction of armature and field systems, Working, types, emf equation, self- excitation build up, Armature windings, Characteristics and applications, Armature reaction - Demagnetizing and Cross magnetizing mmfs and their estimation; Remedies to overcome the armature reaction; Commutation process, Causes of bad commutation and remedies.\n\n\n## UNIT-IV\n\nD.C. Motors:\nPrinciples of working, Significance of back emf, Torque Equation, Types and Characteristics of DC Motors, Starting of DC Motors, Speed Control, Losses and Efficiency, Braking of DC Motors, Effect of saturation and armature reaction on losses; Applications.\nReferences:\n- A.E. Fitzgerald and Charles Kingsley, ‘Electric Machinery’, Tata McGraw-Hill Education Publications.\n- Vincent Del Toro, ‘Electrical Engineering Fundamentals’, 2nd Edition, Prentice Hall Publications.\n- P.S. Bhimbra, ‘Electrical Machinery’, Khanna Publications.\n- Nagrath, I.J. and Kothari, D.P., ‘Electrical Machines’, Tata McGraw-Hill Education Private Limited Publishing Company Ltd.",
    "course outcomes": "Upon the completion of the course, the student will be able to\n- Understand the constructional details and principle of operation of DC machines and transformers.\n- Analyze the performance of the DC Machines under various operating conditions using their various characteristics.\n- Evaluate the performance of Transformers using phasor diagrams and equivalent circuits.\n- Select appropriate DC motor as well as to choose an appropriate method of speed control for any industrial application."
  },
  {
    "course code": "EEPC24",
    "course title": "Power Engineering-II",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC27",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "To give a broad coverage on all types of protective relays, circuit breakers and provide a strong background for working in a practical power system protection system.",
    "course content": "## UNIT I\n\nIntroduction, arcing in circuit breakers, arc interruption theories, re-striking and recovery voltage, resistance switching, current chopping, interruption of capacitive current, oil circuit breaker, air blast circuit breakers, SF6 circuit breaker, vacuum CBs, operating mechanism, selection of circuit breakers, high voltage d.c. breakers, ratings of circuit breakers, testing of circuit breakers.\n\n\n## UNIT II\n\nRelays – General classification, Principle of operation, types, characteristics, Torque equation, Relaying Schemes, Relay Co- ordination.\nApparatus and line protection – Line Protection – Distance, Differential protection and Carrier current protection. Generator protection – protection against abnormal condition, stator and Rotor protection. Transformer Protection – Incipient fault – Differential protection,\nFeeder and Bus bar protection.\n\n\n## UNIT III\n\nProtection against over voltages – Causes of over voltage Ground wires, Surge absorbers and Diverters, Earthling – types, Insulation coordination.\n\n\n## UNIT IV\n\nStatic relays – Digital relays - Microprocessor based relays – Apparatus and line protection – Basics of Numerical relays.\nReferences:\n- Badri Ram and Vishwakarma, D.N., 'Power System Protection and Switchgear', Tata- McGraw Hill publishing company Ltd., 2nd Edition, 2011.\n- Ravindranath B., and Chander, N., ‘Power Systems Protection and Switch Gear', Wiley Eastern Ltd., 1st Edition, 1977.\n- Sunil S.Rao, 'Protective Switch Gear', Khanna Publishers, New Delhi, 13th Edition, 2008.\n- Y. G. Paithangar, ‘Fundamentals of power system protection’, PHI Learning Private Limited, 2nd Edition, 2010.",
    "course outcomes": "Upon completion of the course the students would be able to\n- Classify and describe the working of various relaying schemes.\n- Identify and implement an appropriate relaying schemes for different power apparatus.\n- Illustrate the function of various CBs and related switching issues.\n- Describe the causes of overvoltage and protection against overvoltage."
  },
  {
    "course code": "EEPC25",
    "course title": "Electronics Devices and Circuits",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEIR11, EEPC10",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "To prepare students to perform the analysis and design of various analog and digital electronic circuits.",
    "course content": "## UNIT-I\n\nTransistor biasing circuits: Base bias, Emitter-feedback bias, collector-feedback bias, Voltage- divider bias, emitter bias. CE, CC and CB analysis, h-parameters. JFET: Gate bias, Self bias, Voltage-divider bias and source bias, current source bias. CS, CD and CG amplifier., MOSFET: Depletion type, Enhancement type MOSFET and their biasing., Power Amplifiers: Class A, B, C, D and S power amplifiers. Push-pull operation.\n\n\n## UNIT-II\n\nOP-AMP: Differential amplifier and its DC, AC analysis, OP-AMP characteristics, Non- Inverting/Inverting Voltage and Current feedback. Linear and Non-Linear OP-AMP circuits, Regulated power supplies. Oscillators- Barkhausen criteria of oscillations, Wein-bridge, RC oscillator, 555 timer: its monostable and astable operation.\n\n\n## UNIT-III\n\nLogic gates and Logic Families: Logic gates, Universal gates, transistor as a switching element, Tri-state switch, Bipolar logic Families: RTL, DTL, TTL, ECL, 12L, MOS Logic families: NMOS, CMOS families and characteristics, various logic functions and their implementation.\n\n\n## UNIT-IV\n\nCombinational Circuits: Introduction to combinational circuits, arithmatic and logical operation, design of Half adder & full adder, subtractor circuits, decoders, multiplexers, demultiplexers, comparators, Sequential Circuits: Flip-flops, bistable circuits: RS, JK, D, T, Master/Slave Flip-flop, race around condition, latches, synchronous and asynchronous counters up & down counters, shift registers.\nReferences:\n- Millman and Halkias, “Integrated Electronics”, Mc Graw Hill.\n- R. Boylested and L. Nashelsky, “Electronics Devices and Circuits”, Prentice Hall India.\n- Millman and Halkias, “Electronics Devices and Circuits”, TMH Edition.\n- Malcolm Goodge, “Analog Electronics Analysis and Synthesis”, TMH Edition.\n- Malvino, “Electronics Principles”, TMH Edition\n- AP Malvino and DP Leach, ‘ Digital Principles and applications’\n- Charles Roth, ‘Fundamentals of Logic Design’.\n- H. Taub and D. Schilling, ‘Digital Integrated Electronics’.",
    "course outcomes": "- To understand the concept of multistage amplifiers, analysis of multistage amplifier and its frequency response, Darlington pair and bootstrap circuits.\n- To learn the basics of tuned amplifiers such as single tuned, double tuned, stagger tuned & power amplifiers.\n- To study and analyze the performance of negative as well as positive feedback circuits.\n- To study and analyze the wave shaping circuits and operational amplifies.\n- Acquired knowledge about basics of digital electronics.\n- Ability to identify, analyze and design combinational circuits.\n- Ability to design various synchronous and asynchronous sequential circuits.\n- Acquire knowledge about internal circuitry and logic behind any digital system."
  },
  {
    "course code": "EEPC26",
    "course title": "Electrical Machines-II",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC 23",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The objective of the course is to impart knowledge of the constructional features and principle of operation of different types of induction and synchronous machines. The course also deals with the methods of starting and speed control of induction motors.",
    "course content": "## UNIT-I\n\nBasic Concepts in A.C. Machines: Classification of A.C. Machines, principle of operation and constructional features of synchronous and induction machines, rotating mmf waves in A.C. Machines.\nArmature Windings: Introduction, ac machine windings, winding factors, the emf equation, harmonics in generated emf, causes of harmonics and their suppressions.\n\n\n## UNIT-II\n\nSynchronous Machines: Construction, types, armature reaction, circuit model of synchronous machine, determination of synchronous reactance, phasor diagram, power angle characteristics, parallel operation of synchronous generators, synchronizing to infinite bus bars, synchronous motor operation, characteristic curves, synchronous condenser.\n\n\n## UNIT-III\n\nThree phase Induction (Asynchronous) Motor: Types of induction motor, flux and mmf waves, development of circuit model, power across air gap, torque and power output, oc and sc tests, circle diagram, starting methods, cogging and crawling, speed control, deep bar/ double cage rotor, induction generator, induction machine dynamics, high efficiency induction motors.\n\n\n## UNIT-IV\n\nFractional Kilowatt Motors: Introduction, single phase induction motors, double revolving field theory, circuit model of single phase induction motor, determination of circuit parameters\nReferences:\n- Arthur Eugene Fitzgerald and Charles Kingsley, ‘Electric Machinery’, Tata McGraw Hill Education Publications\n- Miller, T.J.E., ‘Brushless Permanent Magnet and Reluctance Motor Drives’, Clarendon Press.\n- P.S. Bhimbra, ‘Electrical Machinery’, Khanna Publications.\n- Nagrath, I.J. and Kothari, D.P., ‘Electrical Machines’, Tata McGraw Hill Education Private Limited Publishing Company Ltd.\n- M. G. Say, ‘Performance and Design of Alternating Current Machines’, CBS Publishers & Distributors Pvt. Ltd., New Delhi.",
    "course outcomes": "Upon completion of the course, the students will be able to\n- Understand the constructional details and principle of operation of AC Induction and Synchronous Machines.\n- Analyze the performance of the AC Induction and Synchronous Machines using the phasor diagrams and equivalent circuits.\n- Select appropriate AC machine for any application and appraise its significance."
  },
  {
    "course code": "EEPC27",
    "course title": "Power Engineering-I",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC10, MAIR11, MAIR12",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To understand the working of different types of power generation systems\n- To realize the necessity for interconnected operation of different power stations.\n- Identify major components of power transmission and distribution systems.\n- Describe the principle of operation of transmission and distribution equipment.\n- Know and appreciate the key factors in equipment specification and network design.",
    "course content": "## UNIT I\n\nHydro-electric, Thermal steam power plants, Nuclear power plants – selection of site, elements of power plant, working and classification,\nRenewable power plants – Solar power generation – Photo-voltaic and solar thermal generation – solar concentrators, Wind power generation – types of wind mills, wind generators, tidal, biomass, geothermal and magneto-hydro dynamic power generation, micro-hydel power plants, fuel cells and diesel and gas power plants\n\n\n## UNIT II\n\nCombined operation of power plants – plant selection, choice of size, real and reactive power exchange among interconnected systems. station control - switch yard and control room. Economic considerations – types of costs, tariff mechnaism.\n\n\n## UNIT III\n\nTransmission line parameters – Resistance, Inductance and Capacitance calculations – single phase and three phase lines – double circuit lines – effect of earth on transmission line capacitance\nPerformance of transmission lines – Regulation and efficiency – Tuned power lines, Power flow through a transmission line – Power circle diagrams.\nSag and tension calculation – Line supports – Insulators, Voltage distribution in suspension insulators\n–– string efficiency – effects of wind and ice loading.\n\n\n## UNIT IV\n\nBasics of distribution networks, – Recent trends in transmission and distribution systems\nPower system deregulation (Qualitative treatment only) Introduction - Power system restructuring models- responsibilities and functions of independent system operator (ISO) – Ancillary Services\nReferences\n- D. P. Kothari and IJ Nagrath, ‘Power System Engineering’, Tata Mcgraw – Hill, 2nd Edition, 2008.\n- Singh S N, ‘Electric Power Generation Transmission and distribution’, PHI India, 2nd Edition,2008\n- Chakrabarti A., Soni M.L., Gupta P.V., and Bhatnagar U.S., 'A Text Book on Power Systems Engg', Dhanpat Rai and Sons, New Delhi, 2nd Revised Edition, 2010.\n- B.R.Gupta, ‘Generation of Electrical Energy’, S. Chand Limited, 2009.\n- Wadhwa, C.L., ‘Generation Distribution and Utilisation of Electrical Energy', New Age International Publishers, 3rd Edition, 2010.\n- Mohammad Shahidehpour, Hatim Yamin, ‘Market Operations in Electric Power Systems’, John Wiley & Sons Inc., 2002.",
    "course outcomes": "Upon completion of this course, students will be able to\n- Understand the major components of Transmission and Distribution Systems (TDS) and its practical significance\n- Good Knowledge of various equipment specifications and design for TDS\n- Awareness of latest technologies in the field of electrical transmission and distribution.\n- Appreciate the different types of tariff, consumers and different types of power generation plants.\n- Determine the significance of various components of the power generation plants.\n- Correlate the importance of interconnected operation of different power generation systems.\n- Plan an appropriate scheduling of electric power to satisfy the demand constraint"
  },
  {
    "course code": "EEPC28",
    "course title": "Power Electronics-II",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC-24, EEPC-23, EEPC-26",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To understand about various power converters.\n- To understand the basics of electric drives.\n- To analyze the requirements and operation of electric drives.",
    "course content": "## UNIT-I\n\nD.C. to D.C. Converter:\nClassification of choppers. Principle of operation, steady state analysis of class A chopper, step up chopper, switching mode regulators: Buck, Boost, Buck-Boost, Cuk regulators. Current commutated and voltage commutated chopper.\n\n\n## UNIT-II\n\nD.C. to A.C. Converter:\nClassification, basic series and improved series inverter, parallel inverter, single phase voltage source inverter, steady state analysis, Half bridge and full bridge inverter: Modified Mc Murray and Modified Mc Murray Bedford inverter, voltage control in single phase inverters, PWM inverter, reduction of harmonics, current source inverter, three phase bridge inverter.\n\n\n## UNIT-III\n\nBasic of Electric Drives:\nDefinition of electric drive, type of drives; Speed-torque characteristic of driven unit/loads, motors, joint speed-torque characteristic; Classification and components of load torque; multi-quadrant operation of electric drive.\nConverter Fed DC Drives:\nSingle-phase half controlled and fully controlled converter fed dc motor drives, operation of dc drives with continuous armature current, voltage and current waveforms; Concept of energy utilization and effect of free-wheeling diode; Operation of drive under discontinuous current, expression for speed- torque characteristic.\n\n\n## UNIT-IV\n\nChopper fed DC Drives:\nPrinciple of operation and control techniques, chopper circuit configurations used in dc drives: Type A, B, C, D and E; Motoring operation of chopper fed separately excited dc motor, steady state analysis of drive with time-ratio control.\nInverter fed AC Drives:\nVoltage source inverter fed induction motor drive in open loop, frequency and voltage control in PWM VSI; Operation of closed loop slip-speed controlled VSI fed induction motor drive; Current source inverter, advantage of CSI fed drives, closed loop slip speed controlled CSI fed drive.\nReferences:\n- G.K. Dubey, “Fundamentals of Electrical Drives” Narosa Publishing House, 1995.\n- SK Pillai, “A First course on Electrical Drives” Wiley Eastern Ltd.\n- V. Subrahmanyam, “ Electric Drives: Concepts and Applications”, Tata Mc Graw Hill Publishing Co. Ltd., 1994.\n- GK Dubey, “ Power semiconductor Controlled Drives, “Prentice Hall, Englewood cliffs, New Jersey, 1989.\n- EL- Sharkawi& A Mohamad “ Fundamental of Electric Drive”, Vikas Publishing House",
    "course outcomes": "- Capability to analyze power converter circuits\n- Model and analyze electrical motor drives.\n- Choose suitable components for the electric drives.\n- Choose a suitable control structure and calculate control parameters for an electrical motor drive"
  },
  {
    "course code": "EEPC29",
    "course title": "Power Electronics-I",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC-21, EEPC-25, EEPC-10",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To understand about various power semiconductor devices.\n- To analyze and design different power converter circuits.",
    "course content": "## UNIT-I\n\nModern Power Electronics Devices:\nPrinciple of operation of SCR, dynamic characteristic of SCR during turn ON and turn OFF, Two- transistor analogy, Protection of SCR, Snubber circuit, Commutation circuits, SCR ratings, Triggering Methods, Series and Parallel operation of SCR. Principle of operation of, IGBT, GTO, MCT, DAIC, TRAIC, IGCT, their operating characteristics.\n\n\n## UNIT-II\n\nSingle-phase Converter:\nHalf wave converter, 2-pulse midpoint converter, half controlled and fully controlled bridge converters, input current and output voltage waveforms, effect of load and source impedance, expressions for input power factor, displacement factor, harmonic factor and output voltage, effect of free-wheeling diode, triggering circuits, Dual converter.\n\n\n## UNIT-III\n\nThree-phase Converter:\nHalf wave, full wave, half controlled and fully controlled bridge converters, effect of load and source impedance, expressions for input power factor, displacement factor, harmonic factor and output voltage, Dual Converter.\n\n\n## UNIT-IV\n\nA.C. Converters:\nPrinciple of operation of single-phase ac regulator, effect of load inductance, firing pulse requirement. Principle of operation of cyclo-converter, waveforms, control technique;\nReferences:\n- M. Ramamoorthy. Thyristor and their applications, East West Publication, 1991.\n- PS Bhimbra.Power Electronics, Khanna Publishers, 2015.\n- MD Singh and KB Khanchandani, Power Electronics, TMH Edition, 2007.\n- AK Gupta and LP Singh, Power Electronics, Dhanpat Rai Publishing Co.\n- G.K. Dubey, S. R. Doradla, A. Joshi, and R. M. K. Sinha, “Thyristorised Power Controllers”, New Age International Private Ltd.\n- Mohan N., Undeland T. M. and Robbins W. P., “Power ElectronicsConverters, Applications and Design”, 3rd ED, Wiley India.",
    "course outcomes": "- Understand fundamental concepts in power electronics.\n- Capability to analyze power converter circuits\n- Identify basic requirements for power electronics based design and application.\n- To troubleshoot power electronics circuits."
  },
  {
    "course code": "EEPC31",
    "course title": "Power Engineering-III",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC10, EEPC27",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "To model various power system components and carry out load flow, short circuit and stability studies",
    "course content": "## UNIT I\n\nModeling of power system components - single line diagram –per unit quantities – bus impedance and admittance matrix, network matrices using graph theory, primitive networks, singular and non- singular transformation.\n\n\n## UNIT II\n\nPower flow analysis methods -Ybus formulation, Gauss- Seidel, Newton-Raphson and Fast decoupled methods of load flow analysis\n\n\n## UNIT III\n\nFault studies - Symmetrical fault analysis, Analysis through impedance matrix, Current limiting Reactors, Fault analysis – Symmetrical components theory, Transformation matrix, Unsymmetrical short circuit analysis- LG, LL, LLG using matrix method,\n– Algorithm for Zbus formulation. Analysis of symmetrical and un-symmetrical faults through Zbus matrix\n\n\n## UNIT IV\n\nStability studies - Steady state and transient stability – Swing equation - Equal area criterion, Transient stability algorithm using modified Euler‘s method and fourth order RungeKutta method,– multi-machine stability analysis\nReferences:\n- John .J.Grainger&Stevenson.W.D., ' Power System Analysis', McGraw Hill, 1st Edition 2003.\n- D P Kothari, I J Nagrath‘Modern Power System Analysis’, 3rd Edition, 2011.\n- HadiSaadat, ‘Power System Analysis ’, Tata McGraw - Hill Education, 2nd Edition, 2002.\n- Stagg and El Abiad, Computer Methods in Power Systems Analysis, McGraw Hill ISE, 1986.\n- M.A.Pai: Computer Techniques in Power System Analysis, Tata McGraw-Hill Education- 2005. 3. 6. K.U.Rao: Computer Methods and Models in Power Systems, I.K.InternationalPvt.Ltd.2009.\n- J. Duncan Glover, M.S.Sarma& Thomas J. overbye, ‘Power system analysis and design’, 5th Edition, 2011.\n- J.C.Das, ‘Power System Analysis’, Short-Circuit Load Flow and Harmonics’, 1st Edition, 2002.\n- Arthur R. Bergen, ‘Power System Analysis’, Peterson Education India, 2nd Edition, 2009.",
    "course outcomes": "Upon completion of this course, students will be able to\n- Carry out load flow study of a practical system\n- Simulate and analyze fault\n- Study the stability of power systems"
  },
  {
    "course code": "EEPC33",
    "course title": "Microprocessors and Microcontrollers",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC25",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To study the Architecture of 8085 & 8086, 8051\n- To study the addressing modes & instruction set of 8085 & 8051.\n- To introduce the need & use of Interrupt structure 8085 & 8051.\n- To develop skill in program writing for 8051 & 8085 and applications\n- To introduce commonly used peripheral / interfacing ICs",
    "course content": "## UNIT-I\n\nMicroprocessor Architecture:\n8085 microprocessor architecture, timing and control unit, machine cycles, interrupt diagram.Programming:\nAddressing modes, instruction set, assembly language programming, program for multibyte addition/subtraction, multiplication, division, block transfer.\n\n\n## UNIT-II\n\nInterfacing:\nBasic principles of interfacing memory and I /O devices. Data transfer techniques\n- programmed interrupt and DMA.Details of interfacing devices 8255 and 8253.Interfacing of D/A and A/D converter.\n\n\n## UNIT-III\n\nMicrocontroller:\nArchitecture of 8051 microcontroller. Interrupt, serial and timer control. Instruction set and programming. Interfacing with D/A and A/D converter.\n\n\n## UNIT-IV\n\nSemi-Conductor Memory:\nRead only memories, random access memories. Interfacing of memories with 8085.Architecture of 8086 microprocessor.\nReferences:\n- R.S. Gaonkar, “Microprocessor Architecture, Programming andApplications”, Penram International.\n- A.P. Mathur, “Introduction to Microprocessor”.\n- K.J. Ayala, “8051 Microcontroller”, Penram International.\n- D.V. Hall, “Advanced Microprocessor”.\n- Muhammad Ali Mazidi and Mazidi: The 8051 Microcontrollers and Embedded systems, PHI, 2008\nCourse Outcome\nAt the end of the course, student will be able to:\n- Develop basic understanding of microprocessor architecture.\n- The students will be able to design and implement programs on 8085 microprocessor and 8051 microcontroller\n- Understand concept of interfacing of peripheral devices and their applications"
  },
  {
    "course code": "EEPC35",
    "course title": "Control System - II",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC12; EEPC14; EEPC21",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To study the fundamental concepts of digital control system problems and their solution possibilities,\n- To study about the mathematical modelling of the various physical systems in continuous/discrete-time using transfer function and state space methods,\n- To study the concept of time-domain response (transient and steady-state response)and frequency-domain analysis of the discrete-time systems,\n- To study the basics of stability analysis of the discrete-time systems,\n- To study about the discrete-time systems analysis, controldesign and implementations in state space.",
    "course content": "## UNIT-I\n\nMOTIVATION, MODELLING OF DIGITAL CONTROL SYSTEMS\nIntroduction to digital control: The digital control problem and solution possibilities, Signal processing in digital control, principles of signal conversion, sampling and reconstruction, principles of discretization, impulse and step invariance, finite difference approximation, bilinear transformation.\nMathematical models of discrete-time systems: Transfer function and system response, stability in the z-plane and the Jury stability criterion, sampling and data reconstruction process, z-domain description of closed loop systems, systems with dead-time.\n\n\n## UNIT-II\n\nDESIGN OF DIGITAL CONTROL ALGORITHMS\nDigital control design: Implementation of digital controllers, digital controllers for deadbeat performance, root locus methods and frequency domain methods, effect of nonlinearity in root locus and Nyquist plot.\n\n\n## UNIT-III\n\nCONTROL SYSTEM ANALYSIS AND DESIGN IN STATE-SPACE\nIntroduction to state space model: State space equations in canonical forms, modelling of electrical and mechanical systems in state space form, solution of time invariant/variant continuous/ discrete- time system state equations, state transition matrix, state transformation, Eigen values and Eigen vectors, controllability and observability, relation between transfer function and state variable representations.\nFeedback control design: Pole-placement using state variable feedback, Ackerman’s formula, full- order observer, reduced-order observer, and observer based state feedback controller, Lyapunov theory of stability analysis.\n\n\n## UNIT-IV\n\nNONLINEAR SYSTEMS ANALYSIS\nIntroduction to nonlinear systems: Characteristics of nonlinear systems,inherent and intentional nonlinearities, qualitative behaviour of linear Vs nonlinear systems, multiple equilibrium points, limit cycle, bifurcation, jump response, chaos,\nStability analysis of nonlinear systems:Describing function of common nonlinear functions and stability analysis, phase plane analysis, construction of phase portraits, singular points, concept of stability in the sense of Lyapunov, asymptotic stability, local and global stability, construction of Lyapunov function using Krasovskii and variable gradient method.\nReferences:\n- Raymond T. Stephani, Design of Feedback Control Systems, Oxford University Press, Edition No. 04, 2002.\n- Donald M. Wiberg, State Space and Linear Systems, Schuam’s Outline Series, Edition No. 01, 1971.\n- Katsuhiko Ogata, Discrete-Time Control Systems, Prentice-Hall, Edition No. 02, 2015.\n- M. Gopal, Digital Control and State Variable Methods, Tata McGrow Hill, Edition No. 04, 2012.\n- B. C. Kuo, Digital Control System, Oxford University Press, Edition No. 02, 2006.\n- J. J. E. Slotine and W. Li, Applied Nonlinear Control, PrenticeHall, Edition No. 01, 1991.\n- Hassan. K. Khalil, Nonlinear Systems, Prentice-Hall, Edition No. 03, 2002.",
    "course outcomes": "At the end of the course student will be able to\n- Fundamental knowledge of digital control system,mathematical modelling of various physical systems in continuous/discrete-time using transfer function and state space methods,\n- Digital control design and stability analysis using time-domain as well as frequency-domain methods,\n- Conversion of system models from transfer function to state space and vice versa using various transformations,\n- Design and implementation of input and output feedback controllerswith Lyapunov theory of stability.\n- Learn characteristics of linear Vs nonlinear systems behaviour and stability analysis with the concept of local and global stability."
  },
  {
    "course code": "EEPC 37",
    "course title": "Special Machines and Drives",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC 23, EEPC 29, EEPC 26, EEPC 28",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "Main Objective of the course is to make the students familiar with Industrial motors and application of various static devices for the control of electrical machines.",
    "course content": "## UNIT-I\n\nElectrical Machines: Construction, working, characteristics and applications of following electrical machines;\nStepper Motor, Brushless DC motor, Servomotors, Shaded Pole Motor, Reluctance Motor, Hysteresis Motor, Single Phase Series Motor, Repulsion Motor, Schrage Motor, Linear Induction Motor.\n\n\n## UNIT-II\n\nEnergy Efficient Machines, Nonrated Voltage Operation of Induction Motors, Induction Regulators Asynchronous Generators: Comparison with Conventional Generators, Operating Modes, Modelling of Magnetization Curve, Steady State Analysis, Applications\n\n\n## UNIT-III\n\nElectrical Drives:Introduction, Torque Equation, Multi-quadrant Operation of Electrical Drives, Duty Cycles, Selection of Rating of Electrical Motor, Electrical Braking of Machines, Constant Torque and Constant Power Drives, Rotor Energy Loss of Cage Induction Motors: During Acceleration, Stop and Reversal of Speed, Time taken during acceleration\n\n\n## UNIT-IV\n\nSlip Power Recovery Drives: Concept of Slip Power in Induction Motors, Static Kramer and Sherbius Drives, Static Rheostatic Control of Induction motors, Voltage and Frequency Controlled Induction Motor Drives\nReferences:\n- M G Say, Theory Performance and Design of AC Machines, CBS Publishers.\n- Alexander S Lansdorf, AC Machines, CBS Publishers.\n- Ashfaq Hussain, Electric Machines ,Dhanpat Rai & Co.\n- Nagtarth andKothari, Electric Machines, Tata Mc-Graw Hill Publication.\n- Syed A Nasar, Electric Machines and Power Systems, Tata McGraw Hill Publication.\n- Bimal K Bose, Modern Power Electronics and AC Drives. PHI Publication\n- G K Dubey, Fundamentals of Electrical Drives, Narosa Publication.",
    "course outcomes": "After the completion of the course students will be able to,\n- Describe various industrial motors and drive systems.\n- Apply knowledge of power electronics to drive systems.\n- Learn speed control of induction motor drives in an energy efficient manner using power electronics."
  },
  {
    "course code": "EEPC40",
    "course title": "Power System Operation and Economics",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC27, EEPC24",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To understand the economics of power system operation.\n- To realize the requirements and methods of real and reactive power control in power system.\n- To recognize the recent advancements in power system operation.",
    "course content": "## UNIT-I\n\nTypes of load – components of system loads - load curves – load factor, demand factor,\ndiversity factor, capacity factor, utilization factor, base load and peak load stations- Reserve Capacity and requirements- Load Forecasting-Electrical Tariff-types of tariff.\n\n\n## UNIT-II\n\nEconomic Load Dispatch-characteristics of generation unit, Co-ordination equations with and without transmission loss, General problem formulation and common constraints-Unit Commitment – Constraints in unit commitment-Solution methods.\n\n\n## UNIT-III\n\nLoad frequency control-Generator, Prime mover, Governor & Load models – LFC of a single area and two area systems-Tie line bias control-steady state and transient response- Automatic Voltage, Regulator – Exciter and Generator models-steady state and transient response.\n\n\n## UNIT-IV\n\nReactive power and Voltage control–Load Compensation- power factor correction, voltage regulation, load balancing-Maximum load ability of transmission lines-Line Compensation-Static shunt capacitor / inductor-tap changing transformer, VAR compensators, Introduction to FACTS.\nRecent trends in real time control of power systems-Power system control centers with SCADA / EMS Restructuring of power system – fundamentals and operational issues–Introduction to Smart Grid.\nReferences\n- Allen J. Wood, Bruce F. Wollenberg, ‘Power Generation Operation and Control’, Wiley India 2nd Edition, 2009.\n- Abhijit Chakrabarti & Sunita Halder, ‘Power System Analysis- Operation & Control’, PHI New Delhi,3rd Edition, 2010.\n- K Uma Rao, ‘Power System Operation & Control’, Wiley India 1st Edition, 2013.\n- Robert H.Miller, James H.Malinowski, ‘Power System Operation’, Tata McGraw-Hill, 2nd Edition,2009.\nCourse Outcome\nUpon completion of the course, the student will be able to\n- Calculate various factors (such as load factor and demand factor, etc.) and interpret different tariff structures.\n- Develop generation dispatching schemes for thermal units.\n- Apply frequency control schemes on power system.\n- Employ reactive power compensation systems.\n- Adopt engineering innovations for improved power system operation."
  },
  {
    "course code": "EEPC-41",
    "course title": "Reliability Engineering",
    "number of credits": "3-1-0=4",
    "prerequisites": "--",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "Apply knowledge of students in the field of probability analysis to evaluate reliability. The concept of reliability function, network modeling, methods to evaluate, to increase, to optimize reliability will be discussed. Concept of maintainability & availability will also be discussed.",
    "course content": "## UNIT-I\n\nReliability and its importance, mortality curve, hazard rate, causes of failures, modes of failure, general reliability function and other reliability functions. Mean time to failure (MTTF), repair rate, mean-time-between failures (MTBF), availability, uptime, downtime. Failure frequency and failure distributions.\n\n\n## UNIT-II\n\nReliability models – statistical, structural, Markov, and fault tree. Reliability evaluation using various models.\n\n\n## UNIT-III\n\nRedundancy techniques.Reliability allocation and Redundancy optimization.\n\n\n## UNIT-IV\n\nReliability Testing.\nBasic principles of maintainability, availability and security.Availability evaluation using Markov Technique.\nBasic concepts of fuzzy reliability, failure frequency and loss of load probability.\nReferences\n- E. Balaguruswamy, “Reliability Engineering”, Tata McGraw-Hill Education.\n- KK Aggarwal, “Reliability Engineering”, Springer.\n- Martin L. Shooman, “Probabilistic Reliability-An Engineering approach” , Krieger Publishing Company.\n- Ram Kumar, “Reliability Engineering”.\n- A.K. Govil, “Reliability Engineering”, McGraw-Hill Inc.,US\nCourse Outcome\nOn successful completion of this course students will be able to:\n- Explain the concept of probability.\n- Calculate random variable, density & distribution function.\n- To analyze the failure modes & effects.\n- Evaluate reliability functions.\n- Describe various methods to evaluate, increase and allocate and optimize reliability of physical systems.\n- To draw reliability logic diagrams, fault trees, market graphs and find reliability using these."
  },
  {
    "course code": "EEPC43",
    "course title": "Advanced Power Electronics and Drives",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC-29, EEPC-28",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "To provide state-of-the-art speed control techniques used in modern drives for high-performance requirements.",
    "course content": "## UNIT-I\n\nD.C. Drives:\nSingle phase half and fully controlled rectifier-fed separately excited D C motor, Three phase fully controlled rectifier-fed separately excited D C motor, Principle of operation and control techniques of chopper fed drives, separately excited and series motor fed chopper fed drives, multi-quadrant control of chopper-fed motors and fully-controlled rectifier-fed D C motor.\n\n\n## UNIT-II\n\nInduction Motor (IM) Drives:\nVoltage source inverter (VSI) and current source inverter (CSI) variable frequency drives, comparison of VSI and CSI drives, mathematical modeling, direct and indirect FOC, influence of parameters, VSI and CSI fed schemes.\n\n\n## UNIT-III\n\nSynchronous Motor Drives:\nVSI drive, CSI drive, CSI drive with load commutation, cycloconverter drive, Application of modern and\nevolutionary techniques in drives such as fuzzy and ANN control.\n\n\n## UNIT-IV\n\nDigital Control of Electric Drives:\nApplication areas and functions of digital controller in drive technology, speed control of D C drives and A C drives using digital controller.\nReferences\n- Dubey G. K., “Fundamentals of Electric Drives”, 2nd Ed., Narosa 2007, Publishing House.\n- Pillai S. K., “A First Course in Electric Drives”, 2nd Ed., New Age 2008, International Private Limited.\n- Sen P. C., “Thyristor DC Drives”, John Wiley and Sons. 1991\n- Dubey G. K., “Power Semiconductor Controlled Drives”, Prentice Hall International Edition.1989\n- Murphy J. M. D. and Turnbull F. G., “Power Electronics Control of AC Motors”, Peragmon Press. 1990\n- Bose B. K., “Power Electronics and Variable Frequency Drives”, IEEE Press, Standard Publisher Distributors.",
    "course outcomes": "- Able to describe various industrial motors and drive systems.\n- Can apply knowledge of power electronics to drive systems.\n- Learn advanced control methods of motor drive systems."
  },
  {
    "course code": "EEPC45",
    "course title": "Industrial Control",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC10, EEPC14, EEPC21, EEPC22",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "- To learn the fundamental of control of most process variables and how these measured quantities are transformed and transmitted.\n- To learn the concepts of process control, including principles of industrial practices and computer control.\n- To apply these concepts to the control system for typical chemical processes.\n- To gain knowledge and actions of various types of control system, including analog and digital types, online and real time.",
    "course content": "## Unit-I\n\nMOTIVATION, MODELS OF INDUSTRIAL PROCESSES\nIntroduction to Process Control System: Control objectives and configurations of process control, role of control engineer, documentation, process equipments and use, process control operations.\nMathematical modelling: Type of models; modelling procedure steps, empirical model identification and system identification.\n\n\n## Unit-II\n\nDYNAMICAL MODELLING AND FEED BACK CONTROL\nBlending process: problem, dynamics, modelling, selection, temperature sensors, concentration response of isothermal CSTR with no chemical reaction, first order reaction, higher order reaction, pressure tanks with resistances, change in valve positions, interacting systems, liquid level systems with linear/non linear effects; non-interacting and interacting tanks.\nFeedback Control Analysis: Transient response with regulatory, set-point and tracking control for second and higher order systems with P, PI, PD, PID controllers, effect of measurement lag and process dead time on response, control architectures.\n\n\n## Unit-III\n\nENHANCED CONCEPTS OF PROCESS CONTROL\nEnhance control strategies: PID controller tuning, control valves, feed forward control, cascade control, selectors and redundant control, concept of computer control, sequential, supervisory and DDC modes, digital implementation of PID, computer control architecture.\nAdvanced control strategies: Model predictive control, dead time compensation, internal model control, adaptive control, inferential, statistical control, intelligent control (ANN, Fuzzy), case studies.\n\n\n## Unit-IV\n\nCOMMUNICATION AND NETWORKING\nBackground: organization, bus interface, type of buses, features, factors to reckon, LAN topologies, communication hierarchy, ISO reference model, data link layer, central and decentralized bus control, industrial communication systems, management protocols, comparison.\nIndustrial visits: Seminars/Workshops.\nReferences:\n- Peter Harriot, Process control, McGrow Hill, Edition No. 01, 1964.\n- D. E. Seborg, T. F. Edgar, D. A. Mellichamp, F. J. Doyle, Process Dynamics and Control, Wiley, Edition No. 04, 2016.\n- S. K. Singh, Computer Aided process control, PHI, Edition No. 01, 2004.\n- S. Bhanot, Process Control-Principles and Applications, Oxford University Press, Edition No. 04, 2010.\n- T. E. Marlin, Process Control: Designing Processes and Control Systems for Dynamic Performance, McGrow Hill, Edition No. 02, 2000.",
    "course outcomes": "At the end of the course student will be able to……\n- Understand the basic principles & importance of process control in industrial process plants;\n- Specify the required instrumentation and final elements to ensure that well-tuned control is achieved;\n- Understand the use of block diagrams & the mathematical basis for the design of control systems;\n- Design and tune process (PID) controllers;\n- Use appropriate software tools (e.g. Matlab Control Toolbox & Simulink) for the modelling of plant dynamics and the design of well tuned control loops;\n- Understand the importance and application of good instrumentation for the efficient design of process control loops for process engineering plants; and\n- Draw a PID (Process & Instrumentation Diagram) & devise simple but effective plant wide control strategies using appropriate heuristics."
  },
  {
    "course code": "EEPE21A",
    "course title": "Renewable Energy",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC27",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To impart knowledge of the principles and working of various renewable energy resources.",
    "course content": "## Unit-I Introduction:\n\nLimitations of conventional energy sources, need and growth of alternate energy sources, basic schemes and applications of direct energy conversion. Basic principles of MHD generator and Hall Effect, different types of MHD generators, conversion effectiveness. Practical MHD generators, applications and economic aspects.\n\n\n## UNIT-II\n\nWind and Solar Energy:\nPhotovoltaic effect, characteristics of photovoltaic cells, conversion efficiency, solar batteries and applications. Solar energy in India, solar collectors, solar furnaces & applications.\nHistory of wind power, wind generators, theory of wind power, characteristics of suitable wind power sites, scope in India, advantages and limitations.\n\n\n## UNIT-III\n\nThermo-electric Generators:\nSeeback effect, peltier effect, Thomson effect, thermoelectric convertors, brief description of the construction of thermoelectric generators, applications and economic aspects.\n\n\n## UNIT-IV\n\nFuel Cells and Miscellaneous Sources:\nPrinciple of action, Gibbs free energy, general description of fuel cells, types, construction, operational characteristics and applications. Geothermal system, characteristics of geothermal resources, Low head hydroplants.\nReferences\n- R.A. Coormbe,. “An introduction to direct energy conversion”.\n- M. Kettani, . “Direct energy conversion”.\n- Robest L Loftness, “Energy hand book”.\n- D. P. Kothari, K C Singal, Rakesh Ranjan, “Renewable Energy Sources and Emerging Technologies”\n- Shobnath Singh, “Non Conventional Energy Resources”\n- G D Rai, “Non Conventional Energy Sources”",
    "course outcomes": "- Able to know basic concepts of renewable energy resources.\n- Able to identify scope of renewable energy resources in India."
  },
  {
    "course code": "EEPE21B",
    "course title": "Mechatronics",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC25, EEPC33, EEPC21, EEPC35, EEPC45",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To develop an ability to identify, formulate, and solve engineering problems.\n- To develop an ability to design a system, component, or process to meet desired needs within realistic constraints.\n- To develop an ability to use the techniques, skills, and modern engineering tools necessary for engineering practice.",
    "course content": "## Unit-I\n\nMOTIVATION, SYSTEM MODELLING\nIntroduction to Mechatronics: Mechatronics design process, design parameters, traditional and Mechatronics designs, advanced approaches in Mechatronics, industrial design and ergonomics, safety.\nModelling: Model categories, fields of application, model development, model verification, model validation, model simulation, design of mixed systems, electro mechanics design, model transformation, domain independent description forms, simulator coupling.\n\n\n## UNIT II\n\nREAL TIME INTERFACING\nSelection of interfacing standards elements of data acquisition & control systems, over view of I/O process, general purpose I/O card and its installation, data conversion process, application software, lab view environment and its applications, VIM-SIM environment & its applications, man-machine interface.\n\n\n## Unit-III\n\nCASE STUDIES ON MECHATRONIC SYSTEM\nStudies on Fuzzy based washing machine, pH control system, autofocus camera, exposure control, motion control using D.C. motor & solenoids, engine management systems, controlling temperature of a hot/cold reservoir using PID, control of pick and place robot, part identification and tracking using RFID, online surface measurement using image processing.\n\n\n## Unit-IV\n\nMICRO MECHATRONIC SYSTEM\nIntroduction: System principle, component design, system design, scaling laws, micro actuation, micro robot, micro pump, applications of micro Mechatronics components.\nReferences:\n- D. shetty, Richard A. Kolk, Mechatronics System Design, Cengage Learning, Edition No. 02, 2011.\n- G. Pelz, Mechatronic Systems: Modeling and simulation with HDL’s, John wiley and sons Ltd, 2003.\n- Bishop, H. Robert, Mechatronics Hand book, CRC Press, 2002.\n- Bradley, D. Dawson, N. C. Burd, and A. J. Loader, Mechatronics: Electronics in Products and\n- Processes, CRC Press, Edition No. 01, 1991, (First Indian print 2010).\n- D. Silva, Mechatronics: A Foundation Course, Taylor & Francis, (Indian Reprint, 2013).",
    "course outcomes": "At the end of the course student will be able to\n- Be able to model and analyze electrical and mechanical systems and their inter-connection.\n- Be able to integrate mechanical, electronics, control and computer engineering in the design of Mechatronics system\n- Be able to do the complete design, building, interfacing and actuation of a Mechatronics system for a set of specific actions.\n- Be proficient in the use of Lab VIEW software for data acquisition.\n- Be proficient in the programming of microcontrollers."
  },
  {
    "course code": "EEPE21C",
    "course title": "Modelling and Simulation",
    "number of credits": "3-1-0=4",
    "prerequisites": "MAIR-11, MAIR-12, MAIR-22",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "The aim of this course is two-fold;\n- To introduce students the complexities of the real life problems and their solution with stochastic modeling and comprehensive simulations.\n- To introduce learner the fundamental principles of simulation in both deterministic and stochastic frameworks.",
    "course content": "## UNIT-I\n\nReview of Probability and Random Number generation. Generating continuous and discrete time random variables. Discussions on deterministic and stochastic modeling of engineering systems. Need for stochastic models. Ideas of model validation.\n\n\n## UNIT-II\n\nModeling of systems as discrete event systems(DES). Continuous time and discrete time Markov chains, Properties of DES (observability and controllability), Supervisory control of DES, Queuing models.\n\n\n## UNIT-III\n\nHeuristic modeling, Neural, Fuzzy and Neuro-Fuzzy modeling and simulation of dynamical systems. Modeling of time delays and introduction to networked dynamical systems.\n\n\n## UNIT-IV\n\nDynamical system simulation, Monte Carlo simulations, generation of simulation data and its\nstatistical analysis, Statistical validation techniques, Goodness of fit test - based simulation, Numerical issues in simulation of dynamical systems.\nReferences:\nχ 2 and others, Agent\n- Sheldom Ross, “Simulation”, Academic Press, Elsevier Imprint, 2006.\n- Sankar Sen Gupta. “System Simulation and Modeling”, Pearson Education, 2013.\n- J. Banks, J. S. Carson, B. Nelson and D. M. Nicol, “Discrete Event system simulation”, Pearson Education, 5th Edition, 2014.\n- J. R. Jang and C. Sun, “Neuro-Fuzzy Modeling and Control”, Proceedings of IEEE, Vol. 83, No. 3, March 1995.\nCourse Outcome\nUpon successful completion of the course, students will be able to\n- Look engineering system from the point of view of stochastic framework\n- Model various systems from multiple domains e.g. electrical engineering, bio-informatics, financial systems etc.\n- Undertake further industrial and research assignments."
  },
  {
    "course code": "EEPE22A",
    "course title": "Distribution System Analysis and Automation",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC27",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "To understand concept of distribution system, layouts of substation and lines, consumer loads, application of distribution transformers, power flow analysis and basics concept of distribution system automation",
    "course content": "## UNIT-I\n\nDistribution systems – General aspects – Kelvin's Law – A.C distribution – single phase and three phase – Underground cables – Comparison with overhead line – Types of cables – insulation resistance –potential gradient – capacitance of single core and three core cables, customer loads, feeders loads, load models, Layout of substations and feeders.\n\n\n## UNIT-II\n\nMethod of analysis: voltage drop calculations, K-factors, uniformly distributed loads, lumping loads in geometric configuration.\nSeries impedance and shunt admittance of overhead and underground lines: series impedance of OH lines, Carson’s equation, modified Carson’s equation, primitive and phase impedance matrix, impedance of under-ground lines, concentric and tape shielded cables, shunt admittance of overehead and Underground distribution lines.\n\n\n## UNIT-III\n\nApplication of distribution transformers and voltage regulation: Types, efficiency, single phase, three phase connections, step regulators for single and three phase.\nDistribution feeder analysis: power flow analysis, ladder iterative technique, unbalanced three phase feeders, ladder technique for unbalanced feeders, capacitor placement.\n\n\n## UNIT-IV\n\nIntroduction to Distribution Automation System, control hierarchy, Distribution Automation concept, architecture, DA Capabilities, DATA acquisition and SCADA system.\nReferences\n- Momoh A. Momoh, James A. Momoh., ‘Electric Power Distribution, Automation, Protection, and Control’, CRC Press, 2007.\n- Turan Gonen., ‘Electric Power Distribution System Engineering’, BSP Books, Pvt. Ltd, 2007.\n- William H. Kirsting, Distribution system modeling and Analysis, CRSC press, Taylor and Francis group, 2007.\n- Robert H.Miller, James H.Malinowski, ‘Power System Operation’, Tata McGraw-Hill, 2nd Edition,2009.\nCourse Outcome\nUpon completion of the course, the student will be able to\n- Calculate various factors (such as load factor and demand factor, etc.) and interpret different tariff structures.\n- Develop generation dispatching schemes for thermal units.\n- Apply frequency control schemes on power system.\n- Employ reactive power compensation systems.\n- Adopt engineering innovations for improved power system operation."
  },
  {
    "course code": "EEPE22B",
    "course title": "Power Plant Instrumentation",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC-12, EEPC-27, EEPC-21",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- Study of Instrumentation and Control Systems used in power plants\n- Understand various standards and protocols used in power plants\n- Discuss state of art technologies used in power sector",
    "course content": "## UNIT I\n\nIntroduction to Power Plant\nPower plant terminologies and key terms, power plant classification: thermal, hydro, nuclear, co- generation, comparison of various power plants based on technology, usage, efficiency, and limitations\n\n\n## UNIT II\n\nNuclear Power Plant Instrumentation\nClassification of nuclear reactors, nuclear reactor control loops, fuel cycle, control and safety instrumentation, reliability aspects and various modes of operations.\n\n\n## UNIT III\n\nBoiler Control System\nTypes of boilers, various control such as: combustion control, air to fuel ratio control, 3- element drum level control, steam temperature and pressure control, O2/CO2 in flue gases, furnace draft, boiler interlocks, sequence event recorder, supervisory control, data acquisition controls, burner management systems and controllers,Drum-Level and Feed-water Controls, start-up and shut-down procedures, boiler safety standards, boiler inspection procedures,Boiler load calculation, boiler efficiency calculation.\n\n\n## UNIT IV\n\nTurbine Instrumentation\nTurbine instrumentation and control,Generator Control System, Turbine Controls-Seal Steam Pressure Control System, start-up and shut-down, thermal stress control, turbine supervisory instrumentation, condition monitoring, generator, power distribution instrumentation.",
    "reference books": "- Manoj Kumar Gupta, ―Power Plant Engineering‖, PHI Learning Private Limited, 1st ed., 2012.\n- Swapan Basu and Ajay Debnath, Power Plant Instrumentation and Control Handbook: Theory and Practice, 1/e, Academic Press, Elsevier Publishers, 2014",
    "course outcomes": "- Understanding of Instrumentation used in power plant.\n- Ability to demonstrate the standards used in power plants.\n- Understanding the impact of power plant operation in environmental and societal context"
  },
  {
    "course code": "EEPE22C",
    "course title": "Power System Compensation",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC-27, EEPC-24,EEPC-31",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To familiarize the students with the basic concepts, different types, scope and applications of FACTS controllers in power transmission.",
    "course content": "## UNIT I\n\nFundamentals of ac power transmission, transmission problems and needs, emergence of FACTS devices, control considerations, FACTS controllers.\nPrinciples of shunt compensation – Variable Impedance type & switching converter type- Static\n\n\n## UNIT II\n\nSynchronous Compensator (STATCOM) configuration, characteristics and control. Principles of static series compensation using GCSC, TCSC and TSSC, applications, Static Synchronous Series Compensator (SSSC).\n\n\n## UNIT III\n\nPrinciples of operation-Steady state model and characteristics of a static voltage regulators and phase shifters-power circuit configurations.\n\n\n## UNIT IV\n\nUPFC-Principles of operation and characteristics, independent active and reactive power flow control, comparison of UPFC with the controlled series compensators and phase shifters.\nReferences:\n1. Hingorani, L. Gyugyi, ‘Concepts And Technology Of Flexible AC Transmission System’, Standard Publishers Distributors, 1st Edition, 2011.\n- R.M. Mathur And R.K. Varma, ‘Thyristor-Based FACTS Controllers For Electrical Transmission Systems’, Wiley India Pvt. Limited Publications, 1st Edition, 2011.\n- 3 K. R. Padiyar, ‘FACTS Controllers In Power Transmission And Distribution’, New Age International Publications, 1st Edition, 2009.\n- Enrique Acha, Claudio R. Fuerte-Esquivel, Hugo Ambriz-Pérez, César Angeles-Camacho, ‘FACTS: Modelling And Simulation In Power Networks’, John Wiley & Sons, 2004.\n- 5 Enrique Acha, Vassilios Agelidis, Olimpo Anaya, T.J.E.Miller, ‘Power Electronic Control In Electrical Systems’, Newness Power Engineering Series, 2002.\n- 6 T.J.E.Miller, ‘Reactive Power Control In Electric Systems’, Wiley Publications, 1982.",
    "course outcomes": "Upon completion of the course, the students shall be able to\n- Understand various Power flow control issues in transmission lines, for the purpose of identifying the scope and for selection of specific FACTS controllers.\n- Apply the concepts in solving problems of simple power systems with FACTS controllers.\n- Design simple FACTS controllers."
  },
  {
    "course code": "EEPE31A",
    "course title": "Power System Restructuring",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC27, EEPC24",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "To understand the electricity power business and technical issues in a restructured power system in both Indian and world scenario.",
    "course content": "## UNIT-I\n\nIntroduction – Market Models–Entities– Key issues in regulated and deregulated power\nmarkets; Market equilibrium- Market clearing price- Electricity markets around the world\nOperational and planning activities of a GENCO -Electricity Pricing and Forecasting -Price Based Unit Commitment Design - Security Constrained Unit Commitment design – Ancillary Services\n- Automatic Generation Control (AGC).\n\n\n## UNIT-II\n\nIntroduction-Components of restructured system-Transmission pricing in Open-access\nsystem – Open transmission system operation; Congestion management in Open-access transmission systems-\nFACTS in congestion management-Open-access Coordination Strategies; Power Wheeling-\n\n\n## UNIT-III\n\nTransmission Cost Allocation Methods\nOpen Access Distribution – Changes in Distribution Operations-The Development of\nCompetition– Maintaining Distribution Planning\n\n\n## UNIT-IV\n\nPower Market Development – Electricity Act, 2003 - Key issues and solution; Developing power exchanges suited to the Indian market - Challenges and synergies in the use of IT in power-\nCompetition- Indian power market- Indian energy exchange- Indian power exchange- Infrastructure model for power exchanges- Congestion Management-Day Ahead Market- Online power trading.\nReferences\n- L. L.Lai, ‘Power System Restructuring and Deregulation’, John Wiley& Sons Inc., New York,\n- HRD Edition, 2001.\n- Mohammad Shahidehpour, Hatim Yamin, ‘Market Operations in Electric Power Systems’, John Wiley & Sons Inc., 2002.\n- Lorrin Philipson, H. Lee Willis, ‘Understanding Electric Utilities and Deregulation’, Taylor & Francis, New York, 2nd Edition, 2006.\n- Mohammad Shahidehpour, Muwaffaq Alomoush, ‘Restructured Electrical Power Systems’, Marcel Dekker, INC., New York, 1st Edition, 2001.\nCourse Outcome\nUpon completion of the course, the student will be able to\\\n- Explain and differentiate the key issues involved in the regulated and de-regulated power markets.\n- Describe the operational activities in Generation, Transmission and Distribution system in the restructured environment.\n- Illustrate and solve problems in the de-regulated power System.\n- Explain and analyze the restructuring activities in Indian Power System."
  },
  {
    "course code": "EEPE31B",
    "course title": "High Voltage Engineering",
    "number of credits": "02-0-2=3",
    "prerequisites": "EEPC27, EEPC24, EEPC31",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To study the breakdown mechanism of gaseous, liquid and solid dielectrics.\n- To impart knowledge on generation of high AC, DC and impulse voltages and impulse currents.\n- To study the high voltage and current measurement techniques.\n- To enable the students to become familiar with application of EHVAC and HVDC Transmission.",
    "course content": "## UNIT-I\n\nConduction & Breakdown in Gases, Liquid & Solid Dielectrics:\nGases - Ionization process, town send’s current growth equation. Ist & 2nd ionisation coefficients. Town send’s criterion for breakdown. Streamer theory of breakdown. Paschen’s law of gases. Gases used in practice.\nLiquid Dielectrics- Conduction & breakdown in pure & commercial liquids, suspended particle theory, stressed oil volume theory, liquid dielectrics used in practice.\nSolid Dielectrics- Intrinsic, electromechanical, & thermal breakdown, composite dielectric, solid dielectrics used in practice.\n\n\n## UNIT-II\n\nGeneration of High Voltages & Currents:\nGeneration of high D.C., A.C., impulse voltage & impulse currents. Tripping & control of impulse generators.\nMeasurement of High Voltages & Currents:\nMeasurement of high D.C., A.C. (Power frequency & high frequency) voltages, various types of potential dividers, peak reading A.C. voltmeter, Sphere gap method, factors influencing the spark voltage of sphere gaps.\n\n\n## UNIT-III\n\nE.H.V. Transmission & Corona:\nNeed for E.H.V. transmission, corona loss, factors affecting the corona.\nH.V.D.C. Transmission:\nAdvantages, disadvantages & economics of HVDC transmission system. Types of d.c. links, converter station equipment.\n\n\n## UNIT-IV\n\nHigh Voltage Testing of Electrical Apparatus:\nTesting of insulators, bushings, circuit breakers power capacitors & power transformers. Partial discharge test.\nPulsed power: Pulse power generation principles and application\nPulsers and topologies: Capacitive discharge, Charging supplies, Voltage multiplication, Pulse compression\nNote: The Experiments in the Lab will be based on the theory. Reference Books:\n- Naidu M S and Kamaraju V, “High Voltage Engineering”, Tata McGraw-hill Publishing Company Ltd., 5th edition, 2013.\n- Rakesh Das Bagamudre, \" E.H.V. AC Transmission Engineering\" New age international (p) limited, publishers, 4th edition\n- EW Kimbark, “Direct Current Transmission”, Wiley-Interscience, New York\n- A Haddad and D.F. Warne, \"Advances in High Voltage Engineering\" IEE Power & Energy Series 40",
    "course outcomes": "At the end of the course student will be able to\n- Understand the fundamental behavior of gaseous, liquid and solid dielectrics\n- Know the techniques for generation of high AC, DC and impulse voltages and impulse currents.\n- Familiar with measurement procedure of high AC, DC and impulse voltages and impulse currents.\n- Test high voltage electrical Equipment\n- Basics of Pulse power generation"
  },
  {
    "course code": "EEPE31C",
    "course title": "Electric Energy Utilization",
    "number of credits": "03-0-0=03",
    "prerequisites": "EEPC27, EEPC24, EEPC31",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "To design illumination systems, choose appropriate motors for any drive application, to debug a domestic refrigerator circuit and to design battery charging circuitry for specific applications.",
    "course content": "## UNIT-I\n\nIllumination – Terminology, Laws of illumination, Photometry, lighting calculations. Electric lamps – Different types of lamps, LED lighting and Energy efficient lamps. Design of lighting schemes – factory lighting - flood lighting – street lighting.\nRefrigeration-Domestic refrigerator and water coolers - Air-Conditioning-Various types of air conditioning system and their applications, smart air conditioning units - Energy Efficient motors:\n\n\n## UNIT-II\n\nStandard motor efficiency, need for more efficient motors, Motor life cycle, Direct Savings and payback analysis, efficiency evaluation factor.\nDomestic utilization of electrical energy – House wiring. Induction based appliances, Online and OFF line UPS, Batteries. Power quality aspects – nonlinear and domestic loads. Earthing – domestic, industrial and sub-station.\n\n\n## UNIT-III\n\nElectric Heating- Types of heating and applications, Electric furnaces - Resistance, inductance and Arc Furnaces, Electric welding and sources of welding, Electrolytic processes – electro-metallurgy and electro-plating.\n\n\n## UNIT-IV\n\nTraction system – power supply, traction drives, electric braking, tractive effort calculations and speedtime characteristics. Locomotives and train - recent trend in electric traction.\nReferences\n- Dr. Uppal S.L. and Prof. S. Rao, 'Electrical Power Systems', Khanna Publishers, New Delhi, 15th Edition, 2014.\n- Gupta, J.B., 'Utilisation of Electrical Energy and Electric Traction', S. K. Kataria and Sons, 10th Edition, 2012.\n- Rajput R.K., ’Utilisation of Electrical Power’, Laxmi Publications, 1st Edition, 2006.\n- N. V. Suryanarayana, ‘Utilisation of Electrical Power’, New Age International Publishers, Reprinted 2005.\n- C. L. Wadhwa, ‘Generation Distribution and Utilization of Electrical Energy’, New Age International Publishers, 4th Edition, 2011.\n- H. Partab, ‘Modern Electric Traction’, Dhanpat Rai & Co., 3rd Edition, 2012.\n- Energy Efficiency in Electrical Utilities, BEE Guide Book, 2010.",
    "course outcomes": "Upon completion of the course the students would be able to\n- Develop a clear idea on various illumination techniques and hence design lighting scheme for specific applications.\n- Identify an appropriate method of heating for any particular industrial application.\n- Evaluate domestic wiring connection and debug any faults occurred.\n- Construct an electric connection for any domestic appliance like refrigerator as well as to design a battery charging circuit for a specific household application.\n- Realize the appropriate type of electric supply system as well as to evaluate the performance of a traction unit."
  },
  {
    "course code": "EEPE33A",
    "course title": "Power Quality",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC-14, EEPC-27",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To introduce the power quality problem\n- To educate on production of voltages sags, over voltages and harmonics and methods of control.\n- To study overvoltage problems\n- To study the sources and effect of harmonics in power system\n- To impart knowledge on various methods of power quality monitoring",
    "course content": "## UNIT-I\n\nIntroduction to Power Quality\nPower Quality (PQ): definitions, concerns, and evaluations. Terminology: under-voltage, over-voltage, transients, harmonics, voltage unbalance, voltage sags, voltage swells, flicker, interruptions, and power frequency variations Concepts of transients – short duration variations such as interruption - long duration variation such as sustained interruption. Sags and swells - voltage sag - voltage swell - voltage imbalance - voltage fluctuation - power frequency variations. International standards of power quality. Computer Business Equipment Manufacturers Associations (CBEMA) curve.\n\n\n## UNIT-II\n\nVoltage Sags, Interruptions and Overvoltages\nSources of sags and interruptions - estimating voltage sag performance. Thevenin’s equivalent source - analysis and calculation of various faulted condition. Voltage sag due to induction motor starting. Estimation of the sag severity - mitigation of voltage sags, active series compensators. Static transfer switches and fast transfer switches. Sources of over voltages - Capacitor switching – lightning\n- ferro resonance. Mitigation of voltage swells - surge arresters - low pass filters - power conditioners. Lightning protection – shielding – line arresters - protection of transformers and cables. An introduction to computer analysis tools for transients, PSCAD and EMTP.\n\n\n## UNIT-III\n\nPower System Harmonics\nHarmonic sources from commercial and industrial loads, locating harmonic sources. Power system response characteristics - Harmonics Vs transients. Effect of harmonics - harmonic distortion – voltage and current distortion - harmonic indices - inter harmonics – resonance. Harmonic distortion evaluation - devices for controlling harmonic distortion - passive and active filters. IEEE and IEC standards.\n\n\n## UNIT-IV\n\nPower Quality Monitoring\nMonitoring considerations, monitoring and diagnostic techniques for various power quality problems - modeling of power quality (harmonics and voltage sag) problems by mathematical simulation tools - power line disturbance analyzer – quality measurement equipment - harmonic / spectrum analyzer - flicker meters - disturbance analyzer. Applications of expert systems for power quality monitoring.\nReferences:\n- Roger. C. Dugan, Mark. F. McGranagham, Surya Santoso, H.Wayne Beaty, Electrical Power Systems Quality, McGraw Hill, 2003.\n- J. Arrillaga, N.R. Watson, S. Chen, Power System Quality Assessment, Wiley, 2011.\n- Eswald.F.Fudis and M.A.S.Masoum, Power Quality in Power System and Electrical Machines, Elsevier Academic Press, 2013.\n- G.T. Heydt, Electric Power Quality, 2nd Edition. (West Lafayette, IN, Stars in a Circle Publications, 1994).\n- M.H.J Bollen, Understanding Power Quality Problems: Voltage Sags and Interruptions, (New York: IEEE Press, 1999).\n- G.J.Wakileh, Power Systems Harmonics – Fundamentals, Analysis and Filter Design, Springer, 2007.\n- E.Acha and M.Madrigal, Power System Harmonics, Computer Modelling and Analysis, Wiley India, 2012.\n- R.S.Vedam, M.S.Sarma, Power Quality – VAR Compensation in Power Systems, CRC Press, 2013.\n- C. Sankaran, Power Quality, CRC press, Taylor & Francis group, 2002.",
    "course outcomes": "Students who successfully complete the course will be able to understand and analyze power quality importance, events and their harmful effects to take the suitable precautionary measures."
  },
  {
    "course code": "EEPE33B",
    "course title": "Distributed Generation",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC 26, EEPC 27, EEPC 35",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To illustrate the concept of distributed generation\n- To analyse the impact of grid integration.\n- To study concept of Microgrid and its configuration",
    "course content": "## UNIT-I\n\nIntroduction: Conventional power generation: advantages and disadvantages, Energy crises, Non- conventional energy (NCE) resources: basics of Solar PV, Wind Energy systems, Fuel Cells, micro- turbines, biomass, and tidal sources.\n\n\n## UNIT-II\n\nDistributed Generations (DG): Concept of distributed generations, topologies, selection of sources, regulatory standards/ framework, Standards for interconnecting Distributed resources to electric power systems: IEEE 1547. Energy storage elements: Batteries, ultra-capacitors, flywheels, Superconducting magnetic energy storage.\n\n\n## UNIT-III\n\nMicrogrids: Concept and definition of microgrid, microgrid drivers and benefits, review of sources of Microgrids, typical structure and configuration of a Microgrid, AC and DC Microgrids, Power Electronic interfaces in DC and AC Microgrids.\n\n\n## UNIT-IV\n\nImpact of Grid Integration: Requirements for grid interconnection, limits on operational parameters: voltage, frequency, THD Impact of grid integration with NCE sources on existing power system: reliability, stability and power quality issues.",
    "reference books": "- D. N. Gaonkar, Distributed Generation, In-Tech publications.\n- Magdi S. Mahmoud, Fouad M. AL-Sunni, Control and Optimization of Distributed Generation Systems, Springer International Publishing.",
    "course outcomes": "After the completion of the course student will be able to,\n- Understand the fundamentals of distributed generation\n- Identify different storage mediums used for distributed generation\n- Categorize various types of distributed generation systems\n- Analyse the problems of grid integration of distributed generation systems"
  },
  {
    "course code": "EEPE33C",
    "course title": "Multivariable Control",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC25, EEPC33, EEPC21, EEPC35, EEPC45",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To develop an ability to identify, formulate, and solve multivariable control engineering problems.\n- To develop an ability to design a multivariable control system, component or process to meet desired needs within realistic constraints.\n- To develop an ability to use the techniques, skills, and modern engineering tools necessary for multivariable control engineering practice.",
    "course content": "## Unit-I\n\nMOTIVATION, RANDOM VARIABLES\nIntroduction to multivariable control: State-space dynamic systems analysis, stability, norms of signal, vector and matrix, system norms, MIMO frequency response, review of probability theory.\nVector random processes: Scalar and vector random variables, uncorrelated versus independent, functions of random variables, conditioning, vector random (stochastic) processes, shaping filters.\n\n\n## UNIT II\n\nESTIMATION, QUADRATIC REGULATOR\nLeast-Squares Estimation: Deterministic least squares, stochastic least squares, metrics for our estimates, recursive estimation, and system identification.\nLinear Quadratic Regulator: Cost functions; deterministic LQR problem, optimization via calculus of variations, LQR problem solved via calculus of variations, solving the Riccati equation, symmetric root locus, stochastic LQR, LQR solution via dynamic programming, infinite-horizon discrete-time LQR.\n\n\n## Unit-III\n\nQuadratic Estimator and Gaussian\nLinear Quadratic Estimator: Setting up the optimal state estimator, deriving the optimal state estimator, Kalman filter loop, steady-state Kalman filters, frequency-domain interpretation, symmetric root locus, relationship between LQE and LQR.\nLinear Quadratic Gaussian: Deriving LQG via separation principle, satellite tracking example, steady- state LQG control and the compensator, reference tracking, designing for disturbance rejection.\n\n\n## Unit-IV\n\nROBUST CONTROL APPROACH\nIntroduction to robust control: Review of SISO Nyquist stability, robustness of LQR, robustness of LQG; Loop-transfer recovery, modelling uncertainty, four classic problems, unstructured/structured robust stability, performance robustness\nH∞ full-information control and estimation: Differential games, full-information control, Hamiltonian equation, Riccati equation to find state feedback, H∞ estimation.\nH∞ output-feedback controller: Setting up the problem, H∞ output-feedback control as an estimation problem, Finite-time and steady-state control, μ synthesis, fitting a transfer function to D-scales and inverse D-scales, controller order reduction.\nReferences\n- P. Albertos, A. Sala, Multivariable Control Systems: An Engineering Approach, Springer, 2004.\n- Oleg Gasparyan, Linear and Nonlinear Multivariable Feedback Control: A Classical Approach, 2008.\n- Papoulis & S. U. pillai, Probability, Random Varriables and Stochastic Process, Mc Graw Hill, Edition No. 04, 2002.\n- S. Skogestad, & I Postlethwaite, Multivariable Feedback Control: Analysis And Design, Wiley, Edition No. 02, 2001.",
    "course outcomes": "At the end of the course student will be able to\n- Analyze the concept of modelling, identification, estimation and control of linear/nonlinear systems\n- Use the basics of classical and multivariable control in continuous/discrete-time systems.\n- Use essential software for multivariable control system analysis and design and dynamic system modelling.\n- Analyze the benefits and limitations of multivariable control systems and their applications."
  },
  {
    "course code": "EEPE41A",
    "course title": "EHV AC and DC Transmission",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC27",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To develop basic understanding of operation of power system and extra high voltage.\n- Differentiate between AC and DC systems.\n- Understand the operation of AC and DC systems.\n- Knowledge of advance concepts such as travelling waves to power system.",
    "course content": "## Unit-I\n\nConstitution of EHV a.c. and d.c. links, Kind of d.c. links, Limitations and Advantages of a.c. and d.c. transmission, Principal application of a.c. and d.c. transmission, Trends in EHV a.c. and d.c. transmission, Power handling capacity.\n\n\n## Unit-III\n\nComponents of EHV d.c. system, converter circuits, rectifier and inverter valves, Reactive power requirements, harmonics generation, Adverse effects, Classification, Remedial measures to suppress, filters, Ground return. Converter faults & protection harmonics misoperation, Commutation failure, Multiterminal D.C. lines.\n\n\n## Unit-IV\n\nControl of EHV d.c. system desired features of control, control characteristics, Constant current control, Constant extinction angle control. Ignition Angle control. Parallel operation of HVAC & DC system. Problems & advantages.\n\n\n## Unit-V\n\nTravelling waves on transmission systems, Their shape, Attenuation and distortion, effect of junction and termination on propagation of traveling waves. Over voltages in transmission system. Lightning, switching and temporary over voltages: Control of lighting and switching over voltages\nReference:\n- S. Rao, EHV AC & DC Transmission. Khanna publishers.\n- E. Kimbark, HVDC Transmission, Jhon Wiley and Sons.\n- J. Arrillaga, HVDC Transmission, 2nd Edition ,IEEE Press.\n- K. R. Padiyar, HVDC Transmission, New age international pub.\n- T.K. Nagsarkar,M.S. Sukhiza, Power System Analysis, Oxford University\n- Narain.G. Hingorani, l. Gyugyi, Understanding of FACTS concept and technology, John Wiley and Sons.\n- P.Kundur, H.V.D.C. Transmission,Tata McGraw Hill",
    "course outcomes": "At the end of the course student will be able to\n- Analyze the concept of operation of AC and DC systems.\n- Understand the concept of travelling waves.\n- Analyze different problems at EHV level."
  },
  {
    "course code": "EEPE41B",
    "course title": "Real Time Systems",
    "number of credits": "2-0-2=3",
    "prerequisites": "EEPC21",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To familiarize students with the concept of real-time system.\n- Create understanding of the basic principles and design.",
    "course content": "## UNIT I\n\nIntroduction to Real - time systems: Typical examples of RTS, Characteristic features of RT applications. Structural, Functional and Performance requirement of Reactive RTS. Modeling RTS: Representation of time, Concurrency and Distributedness in discrete event systems.\n\n\n## UNIT II\n\nHierarchical representation of complex DES. Input, Output and Communication. Examples of modeling practical systems as RT DES. Modeling programs as RTS. Analyzing RTS: Analysing logical properties of DES such as Reach ability, Deadlock etc. Analyzing timing related properties, Specification and Verification of RT DES properties.\n\n\n## UNIT III\n\nTemporal logic, Model checking. Example of checking safety and timing properties of industrial systems.Requirements and features of real - time Computing Environments: Real - time Operating Systems, Interrupts, clock, Device support.\n\n\n## UNIT IV\n\nReal time System, Multi tasking, Static and Dynamical Scheduling of resource Allocation, Real - time Programming.\nReal - time process and applications, Distributed Real - time systems.\nNote: The Experiments in the Lab will be based on the theory.\nReferences\n- Real- Time Systems, 1/e,Pearson publisher,Jane W S Liu 1st edition\n- Real-Time Systems: Theory and Practice, Computer Science, Engineering and Computer Science,Higher Education,Rajib Mall, Pearson Education, India.\nCourse Outcome\nThe student will be able to use and understand the real-time systems"
  },
  {
    "course code": "EEEPE41C",
    "course title": "Robotics",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC21, EEPC35",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To be familiar with the robotic and brief history of robot and applications\n- To give the student familiarities with the kinematics and dynamics of robots\n- To give knowledge about robot end effectors and their design\n- To understand the control strategies for Robotic applications",
    "course content": "## UNIT-I\n\nIntroduction – Components and Structure of Robotic System.\n\n\n## UNIT-II\n\nRigid Motions and Homogeneous Transformations. Kinematics – forward Kinematics, Inverse Kinematics and its solution.\n\n\n## UNIT-III\n\nDynamics: Formulation of Dynamic equation, linearization. Trajectory generation. Independent Joint Control, Multivariable Control\n\n\n## UNIT-IV\n\nAdvanced control for Robot Applications.\nReferences\n- J.J. Craig, Introduction to Robotics – Mechanics A Control. Addison Wesley.\n- A.J. Koivo, Fundamentals for Control of Robotic Manipulation, John Wiley Inc. New York.\n- Spong and Vidyasagar, Robot Dynamics and Control, John Wiley and Sons.\n- Sciavicco & Siciliano, Modeling and Control of Robot Manipulators, McGraw Hill International Edition",
    "course outcomes": "At the end of the course\n- Student will be equipped with brief history of Robotic and application\n- Students will be familiarized with kinematic motion of robot\n- Student will be acquainted with the basic theory required for solving control problem in Robotics\n- Students will be conversant to advance control strategies for Robotic applications"
  },
  {
    "course code": "EEPE43A",
    "course title": "Energy Management",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC 26, EEPC 27",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To illustrate the concept energy management.\n- To introduce to energy audit study.\n- To study the basics of electrical energy management.",
    "course content": "## UNIT-I\n\nIntroduction: Introduction to energy management, Organizational Structure, Energy Policy and planning.\n\n\n## UNIT-II\n\nEnergy Auditing: Introduction, Energy Auditing Services, Basic Components of an Energy Audit, Specialized Audit Tools, Industrial Audits, Commercial Audits, Residential Audits, Indoor Air Quality and basics of economic analysis.\n\n\n## UNIT-III\n\nElectric Energy Management: Introduction, Power Supply Effects of Unbalanced Voltages on the Performance of Motors, Power Factor, Electric motor Operating Loads, Determining Electric Motor Operating Loads, Power Meter, Slip Measurement, Electric Motor Efficiency, Sensitivity of Load to Motor RPM, Theoretical Power Consumption, Motor Efficiency Management, Motor Performance Management Process\n\n\n## UNIT-IV\n\nAlternative Energy: Introduction, Solar Energy, Wind Energy and other renewable resources for energy management.",
    "reference books": "- Wayne C. Turner, Steve Doty, Energy Management Handbook, The Fairmont Press, Inc.\n- Barney L. Capehart, Wayne C. Turner, William J. Kennedy, Guide to Energy Management, CRC Press.",
    "course outcomes": "After the completion of the course student will be able to,\n- Understand the fundamentals of energy management systems\n- Carry out various energy audit processes.\n- Describe methods to improve efficiency of electrical energy systems\n- Asses the use of alternative energy sources in improving the energy management."
  },
  {
    "course code": "EEPE43B",
    "course title": "Information Security",
    "number of credits": "3-0-0=3",
    "prerequisites": "-",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- Understanding information types and media.\n- Concept of security.\n- Component of security.\n- Security measures and standards.\n- Threats, attacks, monitoring and prevention.",
    "course content": "## Unit 1\n\nIntroduction to Information Security and privacy, Security levels, Security aims.\n\n\n## Unit 2\n\nSystem Security – Security models, Security functions and Security Mechanisms, Privacy enhancing Mechanisms, Access control: role based attribute based, Data base Security, Secure programming, Security evaluation criteria.\n\n\n## Unit 3\n\nNetwork Security – Security Threats and vulnerabilities, Firewalls, IDS, Router Security, Viruses, Worms, DoS, DDos attacks, OS Security, Security protocols, Security management.\n\n\n## Unit 4\n\nAudit and Assurance, Standards, Introduction to disaster recovery and Forensics, Indian initiatives to information security, Information Security Standards.\nReferences\n- B. Matt, “Computer Security”, Pearson Education., New Delhi, 2003.\n- W. Stallings, “Cryptography and Network Security”, Pearson Education., New Delhi, 2003.\n- Rolf Oppliger, “Secrets Technologies for World Wide Web”, 2nd Edition, Artech House, 2003.",
    "course outcomes": "- Understanding the concept and components of information security\n- Identification of vulnerabilities and attacks.\n- Familiarization to information security management.\n- Introduction to tools for information security."
  },
  {
    "course code": "EEPE43C",
    "course title": "Micro Electro Mechanical Systems",
    "number of credits": "3-0-0=3",
    "prerequisites": "PHIR-11, CHIR-11, EEIR-11, MEIR-11, PHIR-12, EEPC-10, EEPC-21, EEPC-25",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To understand the principle and operation MEMS\n- To realize the scope and application of MEMS\n- To be aware of the process of development of MEMS and factor affecting their operation.",
    "course content": "## UNIT-I\n\nIntroduction to Microsystems: An introduction to Micro Sensors and MEMS, Evolution of Micro Sensors and MEMS, MEMS Materials. Laws of Scaling, Multi disciplinary nature of MEMS, Application of MEMS\n\n\n## UNIT-II\n\nMicro Sensors and Actuators: Working principle of Microsystems, Micro Actuation techniques, Micro Sensors: Types, Micro Actuators: Types, Micro pump, Micro Motors, Micro Accelerometers.\n\n\n## UNIT-III\n\nFabrication Process & Micro System Manufacturing: Bulk Micro Manufacturing, Surface Micro manufacturing, LIGA, SLIGA.\n\n\n## UNIT-IV\n\nPackaging & Reliability Issues: Micro System Packaging Materials, Packaging Techniques, Assembly of Microsystems, Reliability of MEMS.\nReferences\n- Jan G. Korvink, Oliver Paul, “MEMS: A Practical Guide to Design, Analysis and Applications”, Wiliam Andrew Publishing, Springer.\n- Danny Banks, “Micro Engineering, MEMS, and Interfacing”, Taylor & Francis.\n- Tai-Ran-Hsu, “MEMS and Microsystems”,",
    "course outcomes": "- Recognize the basic operation and working of MEMS\n- Identify new applications and directions of MEMS.\n- Describe the techniques for building micro-devices.\n- Critically analyze micro-systems for technical feasibility as well as practicality."
  },
  {
    "course code": "EEPE43D",
    "course title": "Analysis of wind and solar systems",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC 23,EEPC 24, EEPC 26, EEPC 33",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "Main Objective of the course is to make the students familiar with most widely used non-conventional energy resources.",
    "course content": "## UNIT-I\n\nWind power history and status, Wind characteristics, Weibull distribution, Site selection, Wind turbines, power output curve, Aerodynamics\n\n\n## UNIT-II\n\nWind power generators, Wind energy conversion model, Isolated and grid connected operation, Basic grid integration issues, Maximum power point tracking and methodologies to track.\n\n\n## UNIT-III\n\nIntroduction to photovoltaic (PV) systems, Solar cells: Basic structure and characteristics: Single- crystalline, multicrystalline, thin film silicon solar cells, emerging new technologies Electrical characteristics of the solar cell, equivalent circuit, modelling of solar cells.\n\n\n## UNIT-IV\n\nPower conditioning and maximum power point tracking (MPPT) algorithms, Inverter control topologies for stand-alone and grid-connected operation. Consumer applications, residential systems, PV water pumping, PV powered lighting, rural electrification, etc.",
    "reference books": "- Ahmed F Jobba and Ramesh C Bansal, Handbook of Renewable Energy Technology, World Scientific Press\n- Godfrey Boyle, Renewable Energy: Power for a Sustainable Future, Oxford University Press\n- Kothari, Singal and Ranjan, Renewable Energy Sources and Emerging Technologies, PHI publication\n- Bimal K Bose, Modern Power Electronics and AC Drives, PHI Publication.",
    "course outcomes": "After the completion of the course students will be able to,\n- Understand the basics of wind and solar energy resources.\n- Asses the control of wind turbine and solar panels for MPPT.\n- Analyse the wind and solar energy resources for power production."
  },
  {
    "course code": "EEPE40A",
    "course title": "Electric Vehicles",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC23, EEPC26, EEPC24, EEPC33",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- Recognize EV/HEV technical and economic objectives.\n- Explain the mechanism of battery and motors in terms of functionality, control, and integration.\n- Identify efficient EV/HEV architectures.\n- Describe a basic co-ordinated control between different parts of EV.",
    "course content": "## UNIT-I\n\nElectric Vehicles (EV) and Hybrid Electric Vehicles (HEV) Developments:\nHistorical developments, recent developments, State of art EVs and HEVs, EV configurations, EV parameters, HEV configurations, Power flow control.\n\n\n## UNIT-II\n\nElectric Propulsion:\nDifferent types of Power converter based DC motor drives, induction motor drives, permanent magnet motor drives, Switched reluctance motor drives.\n\n\n## UNIT-III\n\nEnergy Sources\nBasics- Parameters-Capacity, Discharge rate, State of charge, state of Discharge of Batteries, Fuel cells, Ultra-capacitors, Fly-wheels.\n\n\n## UNIT-IV\n\nEV auxiliaries:\nBattery characteristics and chargers, Battery indication and management, Temperature control units, Power steering units, Auxiliary power supplies, Navigation systems, Regenerative Braking systems.",
    "reference books": "- C. C. Chan, K. T. Chau, “Modern Electric Vehicle Technology” published by Oxford University Press.\n- Rodrego Garcia-valle and J. A. P Lopes “Electric Vehicle Integration into Modern Power Networks” Springer.\n- Chris Mi, M. AbulMasrur and David WenzhongGao, “Hybrid Electric Vehicles: Principles and Applications with PracticalPerspectives” John Wiley Ltd. Publication.\n- . MehrdadEhsani, YimiGao, Sebastian E. Gay, Ali Emadi, “Modern Electric, Hybrid Electric and Fuel Cell Vehicles: Fundamentals, Theory and Design” CRC Press, 2004.",
    "course outcomes": "- Learn fundamentals of advanced batteries, super-capacitors and fuel cells for electrification of vehicles.\n- Learn hybridization of various energy conversion devices for vehicle electrification.\n- Understand battery management systems and state-of-charge estimation.\n- Understand the overall operation of Electric vehicles."
  },
  {
    "course code": "EEPE40B",
    "course title": "Fault Tolerance and Reliability Engineering",
    "number of credits": "3-0-0=3",
    "prerequisites": "-",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "Introduction to basic concepts of fault tolerance and reliability engineering. Application of probability and statistics to estimate reliability of industrial systems; development of reliability measures; analysis of static and dynamic reliability models; development and analysis of fault trees; analysis of safety of reliability models.",
    "course content": "## UNIT 1\n\nFault tolerant concepts, fault detection techniques: test generation, design of testable circuits, fault tolerant system modeling. redundancy techniques: voting schemes, qudded logic, radial logic, use of error-correcting codes, N-version and modular redundancy, SIFT, replicas, alternatives, dynamics of replicas and alternatives.\n\n\n## UNIT 2\n\nReliability data analysis: reliability function, mean-time to failure, bathtub curve, hazard models: Linear, polynomical, exponential, normal, lognormal, weibull, analysis of failure data, Estimation of failure data : Least-square, maximum likelihood.\n\n\n## UNIT 3\n\nSystem reliability modeling, reliability evaluation techniques, system analysis through fault trees.\n\n\n## UNIT4\n\nReliability Data Management: Data collection, storage and recovery of data, data banks, reliability data sources, Design for Reliability and Safety. reliability improvement, A typical case study.",
    "reference books": "- Friedman & Menon, “Fault Detection in Digital Circuits,” Prentice-Hall, 1971.\n- Shem.Tov-Levi, Ashok K. Agrawala, “Fault Tolerant System Design,” McGraw-Hill, 1994.\n- V.N. Yarmolik, “Fault Diagnosis of Digital Circuits”, John Wiley & Sons, 1990.\n- Shooman M.L, “Probabilistic Reliability; An Engineering Approach”, McGraw Hill.\n- K.B. Misra, “Reliability Analysis & Prediction”, Elsevier, 1992.\n- EE Lewis, “Introduction to Reliability Engineering”, John Wiley & Sons.\n- Lawrence M. Leemis, “Reliability Probabilistic Models and Statistical Methods”, Prentice Hall.",
    "course outcomes": "- Analyze the static and dynamic of Fault Tolerance and Reliability of complex systems\n- Identify commonly used reliabilty using graphical techniques and empirical distributions\n- Utilize common physical models for reliability analysis\n- Formulate fault tree models of complex systems and determine the failure modes of the system\n- Perform Safety and reliability analysis"
  },
  {
    "course code": "EEPE40C",
    "course title": "Intelligent Instrumentation",
    "number of credits": "3-0-0=3",
    "prerequisites": "---------",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "This course introduces basic concept of intelligent sensor, Data acquisition, application of automation in industrial application. It also helps to understand the student the application of intelligent controller in instrument.",
    "course content": "## Unit 1 Introduction:\n\nIntelligence, features characterizing intelligence, intelligent instrumentation system; features of intelligent instrumentation; components of intelligent instrumentation system. Block diagram of an intelligent instrumentation system.\nSmart Sensors\nPrimary sensors; Excitation; Compensation (Nonlinearity: look up table method, polygon interpolation, polynomial interpolation, cubic spline interpolation, Approximation & regression: Noise & interference; Response time: Drift; Cross-sensitivity); information coding/Processing; Data Communication; Standards for smart sensor interface. Recent Trends In Sensor Technologies: Introduction; Film sensors (Thick film sensors, this film sensor) Semiconductor IC Technology- Standard methods; Micro electro- mechanical systems (Micro-machining, some application examples); Nono-Sensors.\n\n\n## Unit 2\n\nInterfacing Instruments & Computers\nInstrumentation systems, Types of Instrumentation systems, Data acquisition system and its uses in intelligent Instrumentation system, Detailed study of each block involved in making of DAS, Signal Conditioners: as DA, IA, Signal Converters (ADC & DAC), Sample and hold, Designing of Pressure, Temperature measuring instrumentation system using DAS, Data logger\n\n\n## Unit 3\n\nAutomatic Process Control\nAutomation system, Concepts of Control Schemes, Types of Controllers, Components involved in implementation of Automation system; Converter (I to P) and Actuators: Pneumatic cylinder, Relay, Solenoid (Final Control Element), Computer Supervisory Control System (SCADA), Direct Digital Control’s\nStructure and Software Introduction of Programmable logic controller, Principles of operation, Architecture of Programmable controllers, Programming the Programmable controller, Industrial control applications like cement plant, thermal power plant.\n\n\n## Unit 4\n\nIntelligent controllers\nIntroduction about Intelligent controllers, Model based controllers, Predictive control, Artificial Intelligent Based Systems, Experts Controller, Fuzzy Logic System and Controller, Artificial Neural Networks, NeuroFuzzy Controller system.\nReference Book:\n- G. C. Barney, “Intelligent Instrumentation”, Prentice Hall, 1995.\n- Computer-Based Industrial Control”, by Krishna Kant, PHI.\n- Process Control Instrumentation Technology”, by Curtis D Johnson, Pearson Ed.\n- Electrical and Electronics Measurement and Instrumentation” by A. K. Swahney.\n- Electronics instrumentation” by H. S. Kalsi [TMH]\n- ALAN S. Morris, Principles of Measurement s Instrumentation. New. Delhi: PHI Pvt. Ltd. 1999.\n- D.Patranabis, Sensors s Transducers. New .Delhi: PHI, 2003.\n- Roman Kuc, Introduction to Digital Signal Processing. New York: McGraw-Hill Pub. Co.",
    "course outcomes": "- Able to understand the basic characteristic of intelligent instrumentation system\n- Knowledge of new sensor technology\n- Able to understand the data acquisition system in intelligent instrumentation system\n- Knowledge of automation in industrial plant\n- Able to understand the intelligent controller used in intelligent instrumentation system"
  },
  {
    "course code": "EEPE40D",
    "course title": "Soft Computing",
    "number of credits": "3-0-0=3",
    "prerequisites": "MAIR11, EEPC21",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To understand the concepts of soft computing vis-à-vis hard computing\n- To introduce the ideas of fuzzy logic, neural networks, genetic algorithm and other evolutionary algorithms\n- To introduce the concepts of hybrid intelligent systems\n- To introduce application areas of soft computing and the criteria to select appropriate soft computing technique for a particular problem",
    "course content": "## UNIT I\n\nSoft Computing: Introduction, requirement, different soft computing techniques and their characteristics, comparison with hard computing, applications.\n\n\n## UNIT II\n\nFuzzy sets and Fuzzy logic: Introduction, Fuzzy sets versus crisp sets, properties of fuzzy sets, operations on fuzzy sets, Extension principle, Fuzzy relations, Linguistic variables, linguistic terms, Linguistic hedges, Fuzzy reasoning, Mamdani and TSK fuzzy inference systems, Applications, fuzzy controllers, Theoretical and implementation issues.\n\n\n## UNIT III\n\nArtificial Neural Network: Introduction, comparison with biological neural network, basic models of artificial neuron, different architectures of ANN, Learning techniques, ANN based system modeling, ANN based controller design, theoretical and implementation issues, Applications.\n\n\n## UNIT IV\n\nEvolutionary algorithms and hybrid systems: Genetic Algorithm (GA), different operators of GA, convergence of Genetic Algorithm, Particle swarm optimization algorithm, Neural-Network-Based Fuzzy Systems, Fuzzy Logic-Based Neural Networks, Genetic Algorithm for Neural Network Design, Fuzzy Logic design, other Applications of GA.\nReferences\n- Neuro Fuzzy & Soft Computing - J.-S.R.Jang, C.-T.Sun, E.mizutani, Pearson Education\n- Neural Networks and Fuzzy Systems: Dynamical Systems Application to Machine Intelligence\n- Bart Kosko, Prentice Hall\n- T.J. Ross, \"Fuzzy Logic Control\", TMH Publications.\n- S. Hekins, \"Comprehensive Neural Networks\", Pearson Publications.\n- S. Rajsekharan, Vijayalaxmi Pai, \"Neural Networks, Fuzzy logic and Genetic Algorithms, Synthesis and applications\", Prentice Hall\n- V. Kecman, \"Learning and Soft Computing\", MIT Press.\n- D. Ruan, \"Intelligent Hybrid Systems\", Kluwer Academic Publisher.",
    "course outcomes": "After successful completion of the course, students will be able to:\n- Understand importance of soft computing.\n- Understand different soft computing techniques like Fuzzy Logic, Neural Networks, Genetic Algorithms and their combination.\n- Implement algorithms based on soft computing.\n- Identify when and where to use soft computing methodologies\n- Apply soft computing techniques to solve engineering or real life problems"
  },
  {
    "course code": "EEPE42A",
    "course title": "Renewable Energy Converters",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC-33, EEPC-24",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To understand about various advanced power converters.\n- To analyze and design different power converter circuits used in renewable energy systems.",
    "course content": "## UNIT-I\n\nIntroduction\nReview of 2-pulse and 6-pulse converters and their performance with inductive and capacitive loads. Harmonic analysis of single-phase and three-phase converters.\n\n\n## UNIT-II\n\nPower Converters for Solar PV Systems\nMulti-level converters, topologies and control techniques, PWM techniques.\n\n\n## UNIT-III\n\nPower Converters for Fuel Cells\nBuck converter, Boost converter, Interleaved buck/boost converter, advanced modulation techniques.\n\n\n## UNIT-IV\n\nPower Converters in WECS\nMulti-channel interleaved boost converters, voltage source converters, control of grid-tied converters, matrix converter, and modular multi level inverters.\nReferences\n- V. Yaramasu and B.Wu, \"Model Predictive Control of Wind Energy Conversion Systems,\" Wiley- IEEE Press, 2016.\n- Rashid M. H., “Power Electronics Circuits Devices and Applications”, 3rd Ed., Pearson Education, 2008.\n- Lander Cyril W., “Power Electronics”, Prentice Hall of India Private Limited, 2004.\n- Mohan N., Undeland T.M. and Robbins W.P., “Power Electronics-Converters, Applications and Design”, 3rd Ed., Wiley India, 2008.\n- Paice D. A., “Power Electronic Converter Harmonics – Multipulse Methods for Clean Power”, IEEE press, 1995.",
    "course outcomes": "- Understand advanced concepts in power electronics.\n- Adaptability to analyze power converter based renewable energy systems\n- To troubleshoot gird compatibility issues with power electronics circuits."
  },
  {
    "course code": "EEPE42B",
    "course title": "Virtual Instrumentation",
    "number of credits": "3-0-2=4",
    "prerequisites": "EEPC-12",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- To review background information required for studying virtual instrumentation.\n- To study the basic building blocks of virtual instrumentation.\n- To study the various techniques of interfacing of external instruments of PC.\n- To study the various graphical programming environment in virtual instrumentation.\n- To study a few applications in virtual instrumentation.",
    "course content": "## UNIT-I\n\nReview of Virtual Instrumentation: Historical perspective, Advantages etc., Block diagram and Architecture of a Virtual Instrument. Use of Virtual Instrumentation in the engineering process.\nData-flow Techniques: Graphical programming in data flow, Comparison with conventional programming.\n\n\n## UNIT-II\n\nVI Programming Techniques: VIs and sub-VIs, Loops and Charts, Arrays, Clusters and Graphs, Case and sequence structures, Formula nodes, Local and global variables, String and file I/O.\n\n\n## UNIT-III\n\nData Acquisition Basics: ADC, DAC, DIO, Counters and timers, PC Hardware' structure, Timing, Interrupts, DMA Software and hardware installation.\nCommon Instrumentation Interfaces: Current loop RS232C/ RS485, GPIB, VISA and IVI, Image acquisition and processing, Motion Control.\n\n\n## UNIT-IV\n\nUse of Analysis Tools: Some tools from the advanced analysis tools relevant to the discipline may be included, e.g., Fourier transforms, Power spectrum, Correlation methods, Windowing and Filtering.\nApplications of VI: VI Applications in various fields. Simulation of System using VI, Development of Control System, PID Controller.\nNote: The Experiments in the Lab will be based on the theory.\nReferences\n- Gary Johnson, LabVIEW Graphical Programming, Second edition, McGraw Hill, Newyork, 1997.\n- Lisa K. Wells & Jeffery Travis, LabVIEW for Everyone, Pentice Hall, New Jersey, 1997.\n- Travis, J., LabVIEW for Everyone, Dorling Kingsley (2009).\n- Kevin James, PC interfacing and data Acquisition: Techniques for Measurement.\n- Gupta, S. and Gupta, J.P., PC Interfacing for Data Acquisition and Process Control, Instrument Society of America (1994) 2nd ed.",
    "course outcomes": "At the end of the course\n- Student will be familiarized with Virtual Instrumentation.\n- Student will be able to do Graphical language programming.\n- Student will have knowledge of analytical tools.\n- Student can build the VI for various applications"
  },
  {
    "course code": "EEPE42C",
    "course title": "Optimization Theory",
    "number of credits": "3-1-0=4",
    "prerequisites": "MAIR11, MAIR12, MAIR22",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- Understand the concept of optimization and its theory.\n- Analyse the advantages and disadvantages associated with the large-scale optimization techniques when applied to Engineering problems.\n- Implement selected optimization algorithms / approaches commonly used in engineering systems and other specific areas",
    "course content": "## UNIT-I\n\nIntroduction\nIntroduction to optimization theory, Importance in solving system engineering problems, Convex sets & functions, supporting & separating hyper planes, dual cones and generalized inequalities, Multi objective optimization.\n\n\n## UNIT-II\n\nLinear programming\nLinear programming problem: Formulation, simplex method, two phase simplex method, dual simplex method,, Duality in linear programming, sensitivity analysis, Integer linear programming, cutting plane method, linear programming approach to game theory, dynamic programming problems.\n\n\n## UNIT-III\n\nNonlinear programming\nIntroduction to nonlinear programming: Unconstrained optimization—formulation of quadratic optimization problem, Newton raphson method, gradient method, Constrained optimization— quadratic programming, separable programming.\n\n\n## UNIT-IV\n\nConvex optimization\nConvex optimization problem: Linear optimization problem, quadratic optimization problem, complexity of convex programming\nReferences\n- Optimization Theory & Applications by SS Rao, Wiley Eastern Ltd.\n- Convex Optimization by Boyd & Vandenberghe, Cambridge University Press\n- Operational Research: An Introduction by Hamdy A. Taha, Pearson Prentice Hall, New Jersey\n- Nonlinear Programming by D. Bertsekas, Athena Scientific, Nashua, USA\n- Linear Programming by V. Chvatal, W. H. Freeman, New York.\n- Practical Methods of Optimization by R. Fletcher, Wiley, New York.",
    "course outcomes": "After the course is completed the students will be able to:\n- Understand the different optimization algorithms, multidisciplinary design optimization; formulate optimization problems;\n- Understand how optimization theory maybe applied to different applications and areas of engineering\n- Solve various constrained and unconstrained problems in single variable as well as multivariable; apply the methods of optimization in real life situation."
  },
  {
    "course code": "EEPE42D",
    "course title": "Advanced Control Techniques",
    "number of credits": "3-1-0=4",
    "prerequisites": "EEPC21, EEPC35,",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "Course Contents",
    "course content": "## UNIT-I\n\nIntroduction to advances in control theory in 21st century, Model Predictive Control, Popular MPC control techniques\n\n\n## UNIT-II\n\nMPC extensions to MIMO systems, Robust MPC schemes, Advanced MPC strategies.\n\n\n## UNIT-III\n\nVariable Structure Control, sliding modes and switching surfaces. Sliding mode control, introduction to higher order sliding modes.\n\n\n## UNIT-IV\n\nIntroduction to continuous and discrete time jump linear systems. Analysis, Control and filtering issues in jump linear systems. Characterization and Analysis of Time Delay Systems\nReferences:\n- O.L.V. Costa, M.D. Fragoso andR.P. Marques, “Discrete-Time Markov Jump Linear Systems”, Springer 2005.\n- E. F. Camacho and C. Bordons, “Model Predictive Control”, Second Edition, Springer Verlag, 2007.\n- E. Fridman, “Introduction to Time Delay Systems”, Birkhauser, 2014.\n- V. I. Utkin, “Sliding Modes in Control and Optimization”, Springer-Verlag 1992."
  },
  {
    "course code": "EEPE44A",
    "course title": "Smart Grid Systems",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPE33B, EEPC21, EEPE41B",
    "course type": "PE",
    "branch": "ee",
    "course learning objectives": "- Understand the role of automation in transmission and distribution.\n- Understand the features of small grid in the context of Indian grid\n- Apply evolutionary algorithms for smart grid.\n- Understand operation of PMUs, PDCs, WAMs, and voltage and frequency control in micro grid",
    "course content": "## Unit-I\n\nIntroduction to Smart Grid: What is Smart Grid? Working definitions of Smart Grid and Associated Concepts –Smart Grid Functions-Traditional Power Grid and Smart Grid –New Technologies for Smart Grid –Advantages –Indian Smart Grid –Key Challenges for Smart Grid.\n\n\n## Unit-II\n\nSmart Grid Architecture: Components and Architecture of Smart Grid Design –Review of the proposed architectures for Smart Grid. The fundamental components of Smart Grid designs – Transmission Automation –Distribution Automation –Renewable Integration\n\n\n## Unit-III\n\nTools and Distribution Generation Technologies: Introduction to Renewable Energy Technologies – Micro grids –Storage Technologies –Electric Vehicles and plug –in hybrids –Environmental impact and Climate Change –Economic Issues.\n\n\n## Unit-IV\n\nCommunication Technologies and Smart Grid: Introduction to Communication Technology –Synchro Phasor Measurement Units (PMUs) –Wide Area Measurement Systems (WAMS).\nControl of Smart Power Grid System:\nLoad Frequency Control (LFC) in Micro Grid System –Voltage Control in Micro Grid System –Reactive Power Control in Smart Grid. Case Studies for the Smart Grids.\nReferences\n- Stuart Borlase, Smart Grids, Infrastructure, Technology and Solutions, CRC Press, 2013\n- Gil Masters, Renewable and Efficient Electric Power System, Wiley-IEEE Press, 2004.\n- A.G. Phadke and J.S. Thorp, ―Synchronized Phasor Measurements and their Applications, Springer Edition, 2010.\n- T. Ackermann, Wind Power in Power Systems, Hoboken, NJ, USA, John Wiley, 2005.",
    "course outcomes": "At the end of the course the student will be able to:\n- Understand the features of small grid in the context of Indian grid.\n- Understand the role of automation in transmission and distribution. CO3 Apply evolutionary algorithms for smart grid.\n- Understand operation of PMUs, PDCs, WAMs, and voltage and frequency control in micro grid"
  },
  {
    "course code": "EEPE44B",
    "course title": "Signal Processing",
    "number of credits": "3-0-0=3",
    "prerequisites": "EEPC14",
    "course type": "PE",
    "branch": "ee"
  },
  {
    "course code": "EEPE44C",
    "course title": "Electrical Safety and Standards",
    "number of credits": "03",
    "prerequisites": "Basic sciences, EEIR11",
    "course type": "Programme Elective",
    "branch": "ee",
    "course learning objectives": "The contents for this course have been discussed and the syllabus will be framed later.\nTo provide a comprehensive exposure to electrical hazards, various grounding techniques, safety procedures and various electrical maintenance techniques.",
    "course content": "## Unit-I\n\nPrimary and secondary hazards- arc, blast, shocks-causes and effects-safety equipment- flash and thermal protection, head and eye protection-rubber insulating equipment, hot sticks, insulated tools, barriers and signs, safety tags, locking devices- voltage measuring instruments- proximity and contact testers-safety electrical one line diagram- electrician’s safety kit.\n\n\n## Unit-II\n\nGeneral requirements for grounding and bonding- definitions- grounding of electrical equipment bonding of electrically conducting materials and other equipment-connection of grounding and bonding equipment- system grounding- purpose of system grounding- grounding electrode system grounding conductor connection to electrodes-use of grounded circuit conductor for grounding equipment- grounding of low voltage and high voltage systems.\n\n\n## Unit-III\n\nThe six step safety methods- pre job briefings - hot-work decision tree-safe switching of power\nsystem- lockout-tag out- flash hazard calculation and approach distances- calculating the required level of arc protection-safety equipment , procedure for low, medium and high voltage systems- the one minute safety audit Electrical safety programme structure, development- company safety team- safety policy programme implementation- employee electrical safety teams- safety meetings- safety audit accident prevention- first aid- rescue techniques-accident investigation\n\n\n## Unit-IV\n\nSafety related case for electrical equipments, Various Standards : IEEE, IEC, IS... ,regulatory bodies- national electrical safety code- standard for electrical safety in work place- occupational safety and health administration standards, Indian Electricity Acts related to Electrical Safety.\nReferences\n- John Cadick, Mary Capelli-Schellpfeffer, Dennis Neitzel, Al Winfield ,‘Electrical Safety Handbook’, McGraw-Hill Education, 4thEdition, 2012.\n- Sunil S. Rao, Prof. H.L. Saluja, “Electrical safety, fire safety Engineering and safety management”, Khanna Publishers. New Delhi, 1988.\n- Maxwell Adams.J, ‘Electrical Safety- a guide to the causes and prevention of electric hazards’, The Institution of Electric Engineers, IET 1994.\n- Ray A. Jones, Jane G. Jones, ‘Electrical Safety in the Workplace’, Jones & Bartlett Learning, 2000.",
    "course outcomes": "Upon completion of the course, the students would be able to\n- Describe electrical hazards and safety equipment.\n- Analyse and apply various grounding and bonding techniques.\n- Select appropriate safety method for low, medium and high voltage equipment.\n- Participate in a safety team.\n- Carry out proper maintenance of electrical equipment by understanding various standards."
  },
  {
    "course code": "EELR12",
    "course title": "Measurement Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "--",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n1. Understand the concepts in measurements by performing various experiments and tests in the laboratory.\nList of Experiments\n1. To calibrate D.C. Energy Meter at different loads.\n2 To study the error in wattmeter at various p.f,s (power factors)\n- To measure resistance of the order of 5/10 ohm using\n\n\n\nAmmeter, Voltmeter method.\n\n\nMethod of substitution\n\n\nCarrey foster bridge.\n- Ammeter, Voltmeter method.\n- Method of substitution\n- Carrey foster bridge.\n- To measure the inductance and resistance of given inductor at different audio frequencies 200 Hz to 10Kz, using Maxwell’s inductance, capacitance bridge, Hays Bridge.\n- To measure low resistance using Kelvin’s Double Bridge.\n6 To determine the current ratio and phase angle of the given current transformer at different nominal current ratio using direct deflection method.\n- To study Lloyd fisher square and separate hysterises and eddy current losses of the specimen in the square.\n- Study of transducer.\n- Calibration of D.C. Voltmeter 0-300 V and Ammeter 0-10 mA using cromption potentiometer.",
    "course outcomes": "After the completion of the course the student will be able to,\n- Use different measurement equipments in practical.\n- Understand basic principles of different equipments."
  },
  {
    "course code": "EELR 14",
    "course title": "Signals and Systems Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEIR11, MAIR11",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n1. Understand the different standard signals and their properties by performing various experiments and tests in the laboratory.\nList of Experiments\n- Study of types of signals Deterministic & Stochastic ( continuous )\n- Study of time properties of signals.\n- Study of frequency properties of signal.\n- Study of Stochastic properties of signal.\n- Study of Discrete signals.\n- Basic properties of linear system. ( Superposition Theorem etc. )\n- Study of Impulse response to Linear System.\n- Analysis of MIMO System ( 2 – Port )\n- Study of Realization Theorem and filters.\n- Simulation of systems using Op-amps./ Software tools ( Spice/ MATLAB )",
    "course outcomes": "After the completion of the course the student will be able to,\n- Understand the properties of different standard signals.\n- Use signals for other experimental purpose."
  },
  {
    "course code": "EELR21",
    "course title": "Electrical Machines-I Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC 10",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n- Understand the concepts of DC machines and transformers by performing various experiments and tests in the laboratory.\nList of Experiments\n- To separate hysteresis and eddy current losses of a single phase transformer at rated voltage and frequency by conducting no load test at different frequencies keeping v/f ratio constant.\n- To operate two single phase transformer of different KVA rating in parallel and plot the variation of current shared by each transformer vs load current\n- To conduct Sumpner’s test on two identical single phase transformer. Also to determine and plot the efficiency with pf 0.9 lagging load.\n- To perform direct load test on dc shunt motor and plot variation of input current, speed, torque and efficiency against output power.\n- To obtain magnetization characteristics of DC m/c. determine the critical field resistance of DC shunt generator, measure field and armature winding resistance. Derive external characteristics of shunt generator using experimental data as obtained above.\n- To make Scott connection of two single phase transformer and to verify the current relation by drawing phasor diagram for balanced and unbalanced resistive loads.\n- To conduct open and short circuit test on 3-phase transformer and determine the equivalent circuit parameters in per unit.\n- To conduct Swinburne test on DC shunt motor. Compute and plot efficiency as motor for various loads.\n- To conduct load test on DC compound generator with\n\n\n\nShunt field alone\n\n\nCumulative and differential connections Plot the results\n- Shunt field alone\n- Cumulative and differential connections Plot the results\n- To study the three point starter DC m/c. speed control of DC shunt motor using armature and field control. Plot the variation of speed with added resistance.",
    "course outcomes": "After the completion of the course the student will be able to,\n- Evaluate the performance of transformers using the parameters calculated experimentally.\n- Analyze the performance of the DC Machines under various operating conditions by obtaining their characteristics.\n- Understand various speed control methods for DC machines."
  },
  {
    "course code": "EELR25",
    "course title": "Electronics Devices and Circuits Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEIR11, EEPC10",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "To prepare students to perform the analysis and design of various analog and digital electronic circuits.\nList of Experiments\n- To observe the performance of\n\n\nCommon emitter (b) Common base (c) common collector amplifiers\n- Common emitter (b) Common base (c) common collector amplifiers\n- To study the characteristic of BJT (NPN, PNP), JFET (N-channel, P-channel), MOSFET(N- channel, P-channel).\n- To study the following mathematical operations using Op-amps:-\n\n\nAddition (b) Subtraction\n- Addition (b) Subtraction\n(c) Multiplication (d) Division\n(e) Integration (f) Differentiation\n- To study the Op-amp as:\n\n\n\nAstable multivibrator\n\n\nMono-stable multivibrator\n\n\nSchmitt Trigger cicuit\n- Astable multivibrator\n- Mono-stable multivibrator\n- Schmitt Trigger cicuit\n- To study OP-AMP as non-inverting voltage amplifier, low pass filter, high-pass filter and band- pass filter\n- To study NOT, AND, OR, NOR, XOR, XNOR gates.\n- To study and verify the truth table of R-S, D, J-K and T flip flop\n- To verify the operation of a 4 bit UP and DOWN serial/parallel counter\n- Study of a combinational circuit of half adder, full adder, subtractor, encoder, decoder, multiplexer and 4 bit digital comparator.\n- Study of shift register SISO, SIPO, PISO, PIPO using shift register.",
    "course outcomes": "- To understand the concept of small signal amplifiers.\n- To learn the basics of tuned amplifiers such as single tuned, double tuned, stagger tuned & power amplifiers.\n- To study and analyze the performance of negative as well as positive feedback circuits.\n- To study and analyze the wave shaping circuits and operational amplifies.\n- Knowledge about basics of digital electronics.\n- Ability to identify, analyze and design combinational circuits.\n- Ability to design various synchronous and asynchronous sequential circuits."
  },
  {
    "course code": "EELR22",
    "course title": "Control System Lab-I",
    "number of credits": "0-0-3=1",
    "prerequisites": "EEPC-21",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n1. Understand the concepts in control system by performing various experiments and tests in the laboratory.\nList of Experiments\n- Study of Step Response and Feed Back Properties for Ist and 2nd order system.\n- Error Detector Characteristics and Control Applications of the following.\n\n\n\nLVDT, (ii) Potentiometer\n- LVDT, (ii) Potentiometer\n- Performance Analysis of Thermal System and Design using PID/Relay Control.\n- To study the characteristics (using DIGIAC 1750) of (i) Voltage to Current Converter, (ii) Current to Voltage Converter, (iii) Voltage to Frequency Converter, (iv) Frequency to Voltage Converter.\n- To obtain the Frequency Response Characteristics and Design of Compensator for a given system.\n- To obtain the Tr. Function and Control Characteristics of Servo Motor of DC/AC.\n- To obtain the Operational Characteristics for the Control Application of the following devices.\n\n\n\nStepper Motor, (ii) Temperature Detectors (Thermister, Thermo couple etc.)\n- Stepper Motor, (ii) Temperature Detectors (Thermister, Thermo couple etc.)\n- Simulation of control systems using MATLAB.\n- To obtain the Position Control performance of DC Servo Motor.\n- Comparision of different Control Action (P/I/D/Relay) on Industrial Process (Phneumatic/Simulated System.",
    "course outcomes": "After the completion of the course the student will be able to,\n- Understand basics of control systems\n- Realize the different components of control system and their operations,"
  },
  {
    "course code": "EELR24",
    "course title": "Power Engineering-II Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC27",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n1. Understand the different concepts in power systems by performing various experiments and tests in the laboratory.\nList of Experiments\n- Transmission Line Parameter Calculations\n- Reactive power compensation using series and shunt devices\n- Bus Admittance Matrix Formulation\n- Load Flow Analysis\n- Z-bus Formation\n- Symmetrical Fault Analysis\n- Unsymmetrical Fault Analysis",
    "course outcomes": "After the completion of the course the student will be able to,\n- Understand basic operation of power system.\n- Understand the mathematical modelling and basics to analyse the power system operation."
  },
  {
    "course code": "EELR26",
    "course title": "Electrical Machines-II Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC 23",
    "course type": "PC",
    "branch": "ee",
    "course outcomes": "Course Learning Outcomes:\nThe main objective of the course is to:\n1. Understand the concepts of induction machines and synchronous machines by performing various experiments and tests in the laboratory.\nList of Experiments\n- (a) To conduct running light test on a three phase squirrel cage induction motor and measure and plot input current , power, power factor at different values of applied voltage.\n- To conduct blocked rotor test and measure stator winding resistance.\n- Draw equivalent circuit diagram of the motor and compute the performance at slip of 5%.\n- To conduct direct load test on three phase squirrel cage induction motor and plot input current, torque, power factor, speed and efficiency Vs output power.\n- Quadrature axis reactance of a synchronous machine:\nConduct the maximum lagging current test on the machine running as motor and plot variation of armature current Vs field current (reduced to zero, reversed and then increased). Estimate the values of Xq\n- Synchronous impedance of a synchronous machine:\n\n\n\nObtain O.C.C and S.C.C at rated speed\n\n\nDraw the variation of synchronous impedance with field current and determine the value of SCR.\n\n\nEstimate the full load regulation at 0.8 pf (lagging and leading) by E.M.F and M.M.F methods. Compare the results.\n- Obtain O.C.C and S.C.C at rated speed\n- Draw the variation of synchronous impedance with field current and determine the value of SCR.\n- Estimate the full load regulation at 0.8 pf (lagging and leading) by E.M.F and M.M.F methods. Compare the results.\n- Zero pf characteristics of synchronous machine:\n\n\n\nObtain full load ZPF lagging characteristics of a synchronous machine.\n\n\nObtain O.C.C. and field excitation to circulate the rated current during short circuit test.\n\n\nDraw the Potier triangle and estimate the full load regulation using Potier method at 0.8 pf (lagging and leading).\n- Obtain full load ZPF lagging characteristics of a synchronous machine.\n- Obtain O.C.C. and field excitation to circulate the rated current during short circuit test.\n- Draw the Potier triangle and estimate the full load regulation using Potier method at 0.8 pf (lagging and leading).\n- V-curves for synchronous machines:\nRun the machine as the motor and plot the variation of armature current Vs excitation at different loads.\n- Slip test on salient pole machines:\nConduct the test at different values of slip not exceeding 5 %and find out Xd and Xq using recorded data.\n- To run the induction machine as a self-excited induction generator and plot the variation of terminal voltage and frequency Vs speed for different excitation capacitances.\n- To determine the rotor resistance of a three phase squirrel cage induction motor by performing variable frequency blocked rotor test.\n- To start, run and reverse a single phase capacitor start induction motor. Perform running light and block rotor tests to determine its equivalent circuit parameters. Compute its performance at a slip of 5%.\nAfter the completion of the course the student will be able to,\n- Understand the constructional details and principle of operation of AC Induction and Synchronous Machines.\n- Perform various tests on induction synchronous machines to determine their parameters practically.\n- Analyze the performance of the AC Induction and Synchronous Machines using the phasor diagrams and equivalent circuits.\n- Select appropriate AC machine for any application and appraise its significance."
  },
  {
    "course code": "EELR28",
    "course title": "Power Electronics-II Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC-24, EEPC-23, EEPC-26",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n- Understand the operation of power electronic converters by performing various experiments and tests in the laboratory.\nList of Experiments\n- To study the performance of single-phase half-wave and full-wave uncontrolled rectifiers.\n- To study different firing circuits and Commutation of SCR.\n- To study following protection circuits of SCR (i) dv/dt, (ii) di/dt, (iii) Over voltage, (iv) Over current\n- To study the characteristics of a Thyristor and a Triac.\n- To study firing circuit of SCR using (a) ramp-comparator scheme, (b) cosine-wave scheme,\n(c) Op-amps and Gates.\n- To study digital firing circuit of SCR.\n- To study operation of Triac in all four modes and study AC phase control using Triac.\n- To study the operation of full-wave phase control of an A.C. load using parallel – connected SCR’s.\n- To study the operation of single-phase full- wave phase control of a D.C. load using\n\n\n\na fully-controlled full-wave rectifier.\n\n\na half-controlled full-wave rectifier.\n- a fully-controlled full-wave rectifier.\n- a half-controlled full-wave rectifier.\n- To study the D.C. circuit breaker.\n- To study the zero voltage switching.\n- To study the UJT Chracteristics and relaxation Oscillator.\n- To study (i) the U J T trigger circuit of S C R ii ) the P U T trigger circuit of S C R\n- To study speed control of a D.C. motor using single-phase half and fully controlled bridge converters.\n- To study speed control of a D.C. motor using three-phase half and fully controlled bridge converters.\n- To study speed control of a D.C. motor by thyristor chopper.\n- To study cycloconverter based speed control of a 3-phase induction motor.",
    "course outcomes": "After the completion of the course the student will be able to,\n- Explain the operation of different power electronic devices\n- Show the operation by performing experiments."
  },
  {
    "course code": "EELR31",
    "course title": "Power Engineering-III Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC10, EEPC27",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n1. Understand the advanced concepts in power systems by performing various experiments and tests in the laboratory.\nList of Experiments\n- Differential protection scheme for transformers for different types of faults\n- Plot the characteristics of differential protection relay\n- Under/over frequency relay operation\n- Over current and earth fault protection using IDMT/DMT relay\n- Cable fault location using cable fault locator",
    "course outcomes": "After the completion of the course the student will be able to,\n- Explain the relay operation\n- Understand the operation of protection devices."
  },
  {
    "course code": "EELR33",
    "course title": "Microprocessors and Microcontrollers Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC25",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "To prepare students to perform the analysis and design of various interfacing circuits with microprocessor and microcontroller.\nList of Experiments\n- Write and implement on 8085 kit, the program of multiplication of two 8 bit numbers.\n\n\n\nUsing bit wise multiplication method.\n\n\nUsing repetitive addition method.\n- Using bit wise multiplication method.\n- Using repetitive addition method.\n- To interface stepper motor and run clock wise and anti-clock wise at various speeds using 8085µP .\n- To generate square wave, saw tooth wave, triangular wave of 1 KHz frequency and 50% duty cycle using 8085 µ P kit.\n- Write and implement 8085 µ P Programm for\n\n\n\nFactorial of a given number\n\n\nFinding no. I’s in a given data stored in 2050H.\n- Factorial of a given number\n- Finding no. I’s in a given data stored in 2050H.\n- To interface induction motor with 8085 µ P kit for speed control.\n- To generate a square wave of 1 kHz frequency using\n\n\n\n8085-8253 interface and\n\n\ntimer of 8051\n- 8085-8253 interface and\n- timer of 8051\n- To study up/down 4- digit counter in decimal mode.\n- To display your name on the LCD display of kit and operate the buzzer on/off at various duty cycle using 8051 microcontroller.\n- To operate stepper motor in clockwise and anti- clockwise direction at various speeds\nusing 8051 microcontroller.\n- To interface an A/D converter with 8085 microprocessor and store ten conversions in memory.",
    "course outcomes": "- To understand the concept of 8085 and 8051.\n- To learn the basics of programming using 8085 and 8051.\n- To study the interfacing of 8085 with peripherals.\n- To study the timer operation of 8051."
  },
  {
    "course code": "EELR35",
    "course title": "Special Machines and Drives Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC 23, EEPC 29, EEPC 26, EEPC 28",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n- Analyze most of the widely used converters for dc motors\n- Understand the performance of various motors and their characteristics.\n- Learn various control methods for dc and ac drives\n- Learn the modeling and simulation of drives.\nList of Experiments\n- To perform electrical breaking of DC shunt motor. Discuss the results of various types of electrical breaking.\n- Variable frequency control of three phase induction motor. Plot variation of speed and input power with frequency for constant voltage and constant (voltage/frequency) modes. Discuss the results.\n- To study the effect of injected EMF in electrical machines. Plot the variation of speed with injected EMF in case of Schrage motor and discuss the results.\n- Inrush current simulation for squirrel cage induction motor using MATLAB.\n- Performance of chopper fed DC motor drive using PSIM .\n- To perform electrical breaking of three phase induction motor. Discuss the results for various types of electrical breaking.\n- Performance of unbalanced supply operation of three phase induction motor using MATLAB.\n- Performance of voltage controlled induction motor using PSIM.\n- Rotor resistance control of three-phase slip-ring induction motor. Plot the variation of speed and starting current with external resistance in the rotor circuit. Discuss static rotor resistance control for such motors.\n- To plot load characteristics of DC series motor. Discuss the results and applications of this machine. Explain static control of this motor.",
    "course outcomes": "After the completion of the course the student will be able to,\n- Describe the operation of different speed control techniques of ac and dc motors\n- Explain the characteristics of ac and dc drives.\n- Analyse the performance of a drive."
  },
  {
    "course code": "EELR43",
    "course title": "Advanced Power Electronics and Drives Lab",
    "number of credits": "0-0-2=1",
    "prerequisites": "EEPC-29, EEPC-28",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to study the operation of complex power electronics converters and their application to drives.\nList of Experiments\n- To study performance of unity power factor and law power factor choke based tube-light.\n- To study harmonics of supply current and load voltage of three phase full controlled and half controlled converter with R load and motor load.\n- To study phase angle control of AC controlled.\n- To simulated in PISM expt. 2&3\n- To simulate in Matlab expt. 2&3\n- To study the step-up chopper.\n- Identifying and measuring the parameters of a solar PV modules in the field.\n- To study the SCR based cycloconverter.\n- Solar simulation Dark & illuminated current voltage characteristics of solar cell.\n- To simulate dual converter in circulating current mode using PISM.",
    "course outcomes": "After the completion of the course the student will be able to,\n- Describe the operation of different power electronic converters.\n- Describe the operation of different speed control techniques of ac and dc motors\n- Analyse the performance of a power electronic converters and drives."
  },
  {
    "course code": "EELR41",
    "course title": "Control System Lab-II",
    "number of credits": "0-0-3=1",
    "prerequisites": "EEPC-21",
    "course type": "PC",
    "branch": "ee",
    "course learning objectives": "The main objective of the course is to:\n1. Understand the advanced concepts in control systems by performing various experiments and tests in the laboratory.\nList of Experiments\n- Study of PID control for industrial processes.\n- Study of PID control for position Control of DC motor.\n- Study of Relay characteristics.\n- Study of heating process and its control.\n- Study of Micro controller kit with interfacing.\n- Study of micro controller kit with ADC interfacing.\n- Study of Micro controller kit with stepper motor.\n- Study of control device(M/E,L/E,strain/E,humidity/E, Relay, Solenoid, Signal Conditioners)\n- Study of Control Of Inverted Pendulum using LAB VIEW.",
    "course outcomes": "After the completion of the course the student will be able to,\n- Understand the advanced concepts of control system.\n- Use advanced devices to perform the control operation.\n- Explain the operation of Transduces"
  }
]
