[
  {
    "course code": "MEIR-12",
    "course title": "Introduction to Mechanical Engineering",
    "number of credits": "2.0",
    "prerequisites": "Nil",
    "course type": "EPR",
    "branch": "me",
    "course learning objectives": "- To introduce the basic concepts and applications of Mechanical Engineering.\n- To demonstrate importance of Mechanical Engineering in present day scenario.\n- To be able to understand the concept of forces.\n- To be able to understand thermodynamics and their various systems",
    "course content": "## UNIT I\n\nHistory and evolution of Mechanical Engineering and applications, invention in Mechanical Engineering: timeline; case study. (3hrs)\n\n\n## UNIT II\n\nForce systems: moment, couple and resultant, free body diagrams & equilibrium; centroid, centre of mass; moment of inertia: area moment of inertia, mass moment of inertia, product of inertia of different shapes; friction: static & kinetic friction, angle of repose, applications: wedge, screws, screw jack; trusses & frames; virtual work. (7 hrs)\nKinematics & dynamics of particles & rigid bodies in plane motion; impulse & momentum (linear & angular) and energy formulation, collisions. (5 hrs)\n\n\n## UNIT III\n\nIntroduction to thermodynamics, thermodynamic systems and control volume: system, boundary and surroundings; closed, open and isolated system, homogeneous and heterogeneous system, macroscopic and microscopic viewpoint, thermodynamic properties: intensive and extensive, state, path, process and cycle, point function, path function, thermodynamic equilibrium, quasi-static process, concept of continuum, zeroth law of thermodynamics, measurement of temperature: thermometers, thermocouples, pressure: atmospheric, absolute, and gauge pressure, specific heat and latent heat, thermodynamic concept of work, p-dv work, displacement work, indicator diagram, free expansion with zero work transfer, modes of heat transfer. (6 hrs)\n\n\n## Unit –IV\n\nEngineering materials: metals, alloys, ceramics, composites, polymers; their properties and applications, selection criteria of materials for engineering applications, evolution of manufacturing processes, selection criteria of manufacturing processes, introduction to manufacturing systems, plant layout and\nmaterial handling, fundamentals of NC & CNC, product development cycle, case study. (7 hrs)",
    "course outcomes": "The students will learn about:\n- History and evolution of Mechanical Engineering, and recent developments in this field.\n- Basic concepts and applications of applied mechanics.\n- Elemental knowledge about thermodynamic systems, temperature measurements and temperature measuring instruments.\n- Basic concepts of materials, manufacturing and principles of selection of materials and manufacturing processes for engineering applications.",
    "reference books": "- Engineering Mechanics: Statics and Dynamics – J.L. Meriam & L.G. Kraige.\n- Engineering Mechanics (Dynamics), Hibbeler, Pearson Education (Singapore), Pvt. Ltd.\n- Engineering Mechanics: Timoshenko & Young\n- Engineering Mechanics (Statics).-Hibbeler\n- Engineering Mechanics: Statics and Dynamics – Shames, Prentice-Hall (India).\n- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.\n- M P Groover, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.\n- Yunus A. Cengel and Michael A.Boles, Thermodynamics – An Engineering Approach, McGraw Hill Education.\n- P K Nag, Engineering Thermodynamics, McGraw Hill Education.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEIR-11",
    "course title": "Engineering Practice (EP)",
    "number of credits": "2.0",
    "prerequisites": "NIL",
    "course type": "EPR",
    "branch": "me",
    "course learning objectives": "- To impart fundamental Knowledge of engineering practices such as fitting, wood working, foundry, machining, welding, etc. for manufacturing a product.\n- To prepare the students to understand the various tools and equipment’s used in these processes and their working principle\n- To impart fundamental Knowledge of Lathe machine\n- To able to understand the basic knowledge of various welding processes",
    "course content": "Introduction\n\n\n## UNIT- I\n\nIntroduction to engineering practices, safety measures.\nFitting shop\nIntroduction, classification of metals: ferrous and nonferrous, fitting tools: measuring and marking tools, marking schemes for a fitting jobs, cutting tools: files specifications and uses, hacksaw, chisels, clamping tools: Vice, U-clamp, striking tools: hammers, taps and tapering process. (4 hrs)\n\n\n## UNIT- II\n\nCarpentry shop\nIntroduction of carpentry/Joinery, wood working: types of woods, advantage of wood, seasoning of wood, carpentry tolls: measuring tools, marking tolls, cutting tools: saws, chisels, planning tools, drilling tools, striking tools, drilling tools, wood working joints, wood working lathe,\nFoundry Shop\nIntroduction, foundry hand tools, measuring boxes, ladle, moulding, machines, furnaces. (6hrs)\n\n\n## UNIT- III\n\nMachining Shop\nLathe, description of lathe: headstock, tailstock, gearbox, carriage, apron, cutting speed, feed &depth of cut, cutting tools, Chucks: 3 jaw, 4 jaw. (2 hrs)\n\n\n## UNIT IV\n\nIntroduction, classification of welding processes, advantages, disadvantage and applications of welding, arc welding & gas welding equipment’s, soldering & brazing (2hrs)",
    "course outcomes": "At the end of the course student will be able to:\n- Understand the fundamental concept of various basic engineering practices namely fitting, carpentry, foundry, machining welding, etc.\n- Decide and recommended appropriate tools and equipment for different manufacturing techniques.\n- Develop their communication skills in oral, written and developed modes.\n- Function effectively in teams and within a diverse environment.\n- Understanding professionalism, ethics and the associated responsibilities.",
    "reference books": "- S K Hajra Choudhury, Nirjhar Roy, A K Hajra Choudhury, Elements of workshop Technology (vol. 1&2 ), media promoters.\n- B S Raghuwanshi, A Course in Workshop Technology (manufacturing Process vol1) Dhanpat Rai & CO.\n- W A J Chapman, Workshop technology in SI unit (part – 1 &2), Mc Graw Hill Education.\n- MP GROOVER, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Process for Engineering Materials, Pearson Education India.\n- W/S Technology- Baker\n………………………………………………………………………………………………\nSCHEME OF EXAMINATION\nB.Tech (Mechanical Engineering) 2nd Semester"
  },
  {
    "course code": "MEPC-10",
    "course title": "Thermodynamics",
    "number of credits": "4",
    "prerequisites": "None",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To be able to use the First Law of Thermodynamics to estimate thermo- mechanical energy conversion\n- To be able to use the property tables and diagrams to calculate properties of substances\n- To be able to understand and apply the Second Law of thermodynamics and the concept of entropy to various systems\n- To be able to use the general Thermodynamics relations to various systems",
    "course content": "S:\nConcepts of Thermodynamics\n\n\n## UNIT I\n\nDefinition, Classical and statistical thermodynamics, Macroscopic and microscopic approaches, thermodynamic system, state, boundary, surroundings and universe, thermodynamic properties, thermodynamic equilibrium, Quasi-static process, zeroth law of thermodynamics, work and heat transfer. (4hrs)\nThe First Law of Thermodynamics\nFirst law for a closed system; Application of the First Law to non-flow processes viz constant volume, constant pressure, constant internal energy processes; Reversible adiabatic and reversible polytropic processes; Steady Flow Energy Equation and its application to water, steam and gas turbines, pumps, compressors boilers, condensers, nozzles etc; Transient flow processes; PMM-I, Enthalpy. (6hrs)\n\n\n## UNIT II\n\nProperties of Fluids\nProperties of liquids and vapours; P-V, P-T, T-S and H-S diagrams for a pure substance (water), Tables of properties, Expansion of steam, hyperbolic , Isentropic and throttling processes; determination of dryness fraction, Properties of a perfect gas; Equation of state; Property relation for internal energy, enthalpy & heat capacities of an ideal gas, P-V-T surface, Triple point , Real gases, properties of real gases, Vander Waals equation , Reduced equation of state, Generalized compressibility charts, Virial equation. Properties of ideal gas mixtures (12hrs)\n\n\n## UNIT III\n\nThe Second Law of Thermodynamics\nLimitations of the First Law, Heat source & sink, Heat engine, Refrigerator & Heat Pump, The Second Law, Kelvin Planck and Clausius statements; Reversible & Irreversible processes; the Carnot theorem, Absolute temperature scale, Inequality of Clausius, characteristics of Entropy,\nEntropy change for open &closed systems, Third Law of Thermodynamics, Validity & limitations of the Laws of Thermodynamics. (10hrs)\n\n\n## UNIT IV\n\nGeneral Thermodynamic Relations\nMaxwell Relations, specific heat relations, energy equations; relations between internal energy and entropy, Joule Thomson Coefficient, Clausius Clapeyron’s equation, Application of thermodynamic relations. Availability and the Gibbs function, Availability of a closed system, Availability of steady flow system, The Gibbs function and the steady flow system. (8hrs)",
    "course outcomes": "At the end of the course student will be able to\n- understand the basic concepts of thermodynamics such as heat, work, state etc.\n- identify the properties of substances on property diagrams and obtain the data from property tables.\n- apply First Law of Thermodynamics to open and closed systems\n- apply the Second Law of Thermodynamics and the concept of entropy to analyse the thermal efficiencies of heat engines.",
    "reference books": "- Rogers, GFC & Mayhew, Y.R, Engg. Thermodynamics, ELBS\n- Nag, P.K., Engg. Thermodynamics, TMH\n- Achuthan, M., Engg. Thermodynamics,TMH.\n- Cengel and Boles,Thermodynamics: An Engineering Approach, McGraw Hill, 8th edition, 2015.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-11",
    "course title": "Manufacturing Processes",
    "number of credits": "03",
    "prerequisites": "NIL",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To impart fundamental knowledge of engineering materials\n- To impart basic knowledge of various processes such as casting, forming, machining, & welding etc. for manufacturing a product.\n- To prepare the students to understand the advance concepts and processes based on these basic manufacturing processes.",
    "course content": "-\n\n\n## UNIT I\n\nIntroduction to manufacturing, classification of manufacturing, fundamental properties of materials including metals and alloys, polymers, ceramics and composites, plastic processing techniques: compression moulding and injection moulding. (6 hrs)\n\n\n## UNIT II\n\nCasting\nPattern materials, types of allowances, type of patterns, type of mould, desirable properties of moulding materials, core, core print, type of cores, CO2 casting, expandable and permanent mould casting, sand casting, shell casting, plaster casting, investment casting, die casting, centrifugal castings, casting defects & remedies advantages, disadvantages and application of casting.\nMachining\nDefinition, classification, Lathe: parts and accessories, specifications, various operations on lathe. (14 hrs)\n\n\n## UNIT III\n\nForming\nDeformation of metals, elastic and plastic deformation, metal working processes: cold and hot working, forging, rolling, extrusion, wire and tube drawing.\nSheet metal operations\nIntroduction to shearing, blanking and punching, notching, trimming, lancing, nibbling, bending, stretching, embossing and coining. (10 hrs)\n\n\n## UNIT IV\n\nDefinition and classification, thermit welding, electric arc welding: MMAW, SAW, TIG, MIG, gas welding, resistance welding, brazing and soldering, welding defects and remedies. (10 hrs)",
    "course outcomes": "At the end of the course student will be able to\n- Decide and recommend cost effective and reliable engineering materials for the development of an existing and innovative product.\n- Decide and recommend appropriate manufacturing processes for a product under given conditions and constraints.\n- Develop their communication skills in oral, written and visual modes.\n- Function effectively in teams and within a diverse environment.",
    "reference books": "- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.\n- M P Groover, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.\n- Amitabha Ghosh & A K Mallik, Manufacturing Science, Affiliated East-West Press Pvt. Ltd.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-12",
    "course title": "Fluid Mechanics",
    "number of credits": "4",
    "prerequisites": "Nil",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To understand the various properties of fluid and instruments for measurement of pressure\n- To study the behaviour of fluid at rest and in motion\n- To study in detail viscous and turbulent flow and flow of fluid in pipe\n- To understand the concept of boundary layer, study of lift & drag and\nstreamlined bodies",
    "course content": "## UNIT- I\n\nFluid Statics\nProperties of fluid, Fluid pressure, Pascal’s law, General equation of Fluid statics, Pressure head of a fluid, Absolute and gauge pressure, Measurement of pressure, Simple manometers, Differential manometers, Mechanical gauges, Force on submerged surfaces: Horizontal, Vertical, Inclined, Curved, Dams and gates. Buoyancy: Stability of submerged and floating bodies, Determination of metacentric height: analytical and experimental methods, Oscillation of floating body. (6hrs)\nFluid Kinematics\nLagrangian and Eulerian methods, flow lines, types of flow (Steady, unsteady, compressible, incompressible, ideal, real, uniform, non-uniform, Rotational and Irrotational, Laminar and turbulent, 1-D, 2-D and 3-D) Velocity and acceleration, Rate of flow, Continuity equation, Continuity equation in 3-D (differential and Polar), Stream function, Velocity potential function, Flow nets, Types of motion: linear translation, linear deformation, angular deformation and rotation. (6hrs)\n\n\n## UNIT- II\n\nFluid Dynamics\nEuler’s equation, Bernoulli’s equation, Energy equation, Practical applications of Bernoulli’s equation (Venturimeter, Orifice meter, Pitot tube), Kinetic energy and momentum correction factors, Momentum equation, Free liquid jet. (4hrs)\nViscous Flow\nReynolds experiments, flow of viscous fluid in circular pipes, Hagen-Poiseuille equation, Flow through an annulus and two parallel plates, Power absorbed in bearings, Movement of piston in dash-pot, Viscometers; Capillary tube, falling spheres, rotating cylinder, Efflux. (4hrs)\n\n\n## UNIT- III\n\nTurbulent flow\nLoss of head in pipes, Shear stress in turbulent flow, Hydraulically smooth and rough boundaries, Velocity distribution in pipes, Velocity distribution in terms of average velocity, Power law, Friction coefficients of smooth and rough pipes.\n(6hrs)\nPipe flow\nMajor and Minor losses in pipes, Hydraulic gradient and total energy lines, Pipes in series, Pipes in parallel, Equivalent pipe, Siphon, Power transmission through pipes, Water hammer, Flow through nozzles. (4hrs)\n\n\n## UNIT- IV\n\nBoundary layer theory\nIntroduction, Description of a boundary layer on a thin flat plate, Boundary layer parameters (boundary layer, displacement, momentum, and energy thickness), Von-Karman integral momentum equation, Boundary layer separation, Methods to prevent boundary layer separation (6hrs)\nImmersed bodies\nLift and drag, Lift and drag coefficients, Streamlined and bluffed bodies Drag on a cylinder (2D body), drag on a sphere Circulation and lift on a cylinder, Airfoil, Lift and drag on an airfoil (4hrs)",
    "course outcomes": "At the end of the course student will be able to analyse the various flow problems using standard equations. They will understand the concept of boundary layer, design of streamlined bodies and various types of drags encountered by a body immersed in fluid.",
    "reference books": "- Som and Biswas, Introduction to Fluid Mechanics and Machinery, Tata McGraw Hill, 3rd Edition, 2011.\n- Robert W. Fox, Philip J. Pritchard, Alan T. McDonald, Introduction to Fluid Mechanics, Wiley India, 8th Edition, 2012\n- Merle C. Potter, David C. Wiggert, Fluid Mechanics, Cenage Learning (India Edition), 2nd Edition, 2011.\n- Frank M. White, Fluid Mechanics, McGraw-Hill Education; 7th Edition, 2010.\n- D. S. Kumar, Fluid Mechanics and Fluid Power Engineering, S.K. Kataria & Sons, 8th Edition, 2013.\n- P.N.Modi, S.M Seth, Hydraulics and Fluid Mechanics including Hydraulic Machines, Standard Book House, 19th Edition, 2009.\n- S.S. Rattan, Fluid Mechanics and Hydraulic Machines, Khanna Book Publishing, 2014.\n- P. Balachandran, Engineering Fluid Mechanics, Prentice Hall India, 2102.\n- R. K. Bansal,Fluid Mechanics and Hydraulic Machines, Laxmi Publications, 9th Edition, 2017.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-10",
    "course title": "Fluid Mechanics (Practical)",
    "number of credits": "01",
    "prerequisites": "Fluid Mechanics (MEPC-12)",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "The objectives of the course are\n- To provide practical understanding of principles of fluid flow.\n- To compare the results of analytical models introduced in lecture to the actual behavior of real fluid flows\n- To discuss and practice standard measurement techniques of fluid mechanics and their applications",
    "course content": "- To determine metacentric height of the ship model.\n- To verify the Bernoulli’s theorem.\n- To determine coefficient of discharge for an Orificemeter.\n- To determine coefficient of discharge of a venturimeter.\n- To determine the various hydraulic coefficients of an Orifice ( Cd ,Cc ,Cv).\n- To calibrate a given notch.\n- To determine coefficient of discharge for a mouth piece.\n- To determine the Darcy Weisbach Coefficient of friction for flow through commercial pipes.\n- To study the effect of pipe diameter on head loss in friction\n- To determine critical Reynolds’ numbers for flow through commercial pipes.\n- To study development of boundary layer over a flat plate.\n- To study the momentum characteristics of a given jet.",
    "course outcomes": "At the end of the course, the students would be able to\n- Understand the principles of fluid flow using experiments\n- Measure the flow properties in a fluid flow such as: velocity, discharge, pressure, frictional losses etc.\n- Apply the principles of fluid mechanics in design.\n- Demonstrate the ability to prepare lab reports.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEIR-11",
    "course title": "Engineering Practice (EP)",
    "number of credits": "2.0",
    "prerequisites": "NIL",
    "course type": "EPR",
    "branch": "me",
    "course learning objectives": "- To impart fundamental Knowledge of engineering practices such as fitting, wood working, foundry, machining, welding, etc. for manufacturing a product.\n- To prepare the students to understand the various tools and equipment’s used in these processes and their working principle\n- To impart fundamental Knowledge of Lathe machine\n- To able to understand the basic knowledge of various welding processes",
    "course content": "Introduction\n\n\n## UNIT- I\n\nIntroduction to engineering practices, safety measures.\nFitting shop\nIntroduction, classification of metals: ferrous and nonferrous, fitting tools: measuring and marking tools, marking schemes for a fitting jobs, cutting tools: files specifications and uses, hacksaw, chisels, clamping tools: Vice, U-clamp, striking tools: hammers, taps and tapering process. (4 hrs)\n\n\n## UNIT- II\n\nCarpentry shop\nIntroduction of carpentry/Joinery, wood working: types of woods, advantage of wood, seasoning of wood, carpentry tolls: measuring tools, marking tolls, cutting tools: saws, chisels, planning tools, drilling tools, striking tools, drilling tools, wood working joints, wood working lathe,\nFoundry Shop\nIntroduction, foundry hand tools, measuring boxes, ladle, moulding, machines, furnaces. (6hrs)\n\n\n## UNIT- III\n\nMachining Shop\nLathe, description of lathe: headstock, tailstock, gearbox, carriage, apron, cutting speed, feed &depth of cut, cutting tools, Chucks: 3 jaw, 4 jaw. (2 hr)\n\n\n## UNIT- IV\n\nIntroduction, classification of welding processes, advantages, disadvantage and applications of welding, arc welding & gas welding equipment’s, soldering & brazing (2hrs)",
    "course outcomes": "At the end of the course student will be able to:\n- Understand the fundamental concept of various basic engineering practices namely fitting, carpentry, foundry, machining welding, etc.\n- Decide and recommended appropriate tools and equipment for different manufacturing techniques.\n- Develop their communication skills in oral, written and developed modes.\n- Function effectively in teams and within a diverse environment.\n- Understanding professionalism, ethics and the associated responsibilities.",
    "reference books": "- S K Hajra Choudhury, Nirjhar Roy, A K Hajra Choudhury, Elements of workshop Technology (vol. 1&2 ), media promoters.\n- B S Raghuwanshi, A Course in Workshop Technology (manufacturing Process vol1) Dhanpat Rai & CO.\n- W A J Chapman, Workshop technology in SI unit (part – 1 &2), Mc Graw Hill Education.\n- MP GROOVER, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Process for Engineering Materials, Pearson Education India.\n- W/S Technology- Baker\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEIR-12",
    "course title": "Introduction to Mechanical Engineering",
    "number of credits": "2.0",
    "prerequisites": "Nil",
    "course type": "EPR",
    "branch": "me",
    "course learning objectives": "- To introduce the basic concepts and applications of Mechanical Engineering.\n- To demonstrate importance of Mechanical Engineering in present day scenario.\n- To be able to understand the concept of forces.\n- To be able to understand thermodynamics and their various systems",
    "course content": "## UNIT- I\n\nHistory and evolution of Mechanical Engineering and applications, invention in Mechanical Engineering: timeline; case study. (3 hrs)\n\n\n## UNIT- II\n\nForce systems: moment, couple and resultant, free body diagrams & equilibrium; centroid, centre of mass; moment of inertia: area moment of inertia, mass moment of inertia, product of inertia of different shapes; friction: static & kinetic friction, angle of repose, applications: wedge, screws, screw jack; trusses & frames; virtual work. (7 hrs)\nKinematics & dynamics of particles & rigid bodies in plane motion; impulse & momentum (linear & angular) and energy formulation, collisions. (5 hrs)\n\n\n## UNIT- III\n\nIntroduction to thermodynamics, thermodynamic systems and control volume: system, boundary and surroundings; closed, open and isolated system, homogeneous and heterogeneous system, macroscopic and microscopic viewpoint, thermodynamic properties: intensive and extensive, state, path, process and cycle, point function, path function, thermodynamic equilibrium, quasi-static process, concept of continuum, zeroth law of thermodynamics, measurement of temperature: thermometers, thermocouples, pressure: atmospheric, absolute, and gauge pressure, specific heat and latent heat, thermodynamic concept of work, p-dv work, displacement work, indicator diagram, free expansion with zero work transfer, modes of heat transfer. (6 hrs)\n\n\n## UNIT –IV\n\nEngineering materials: metals, alloys, ceramics, composites, polymers; their properties and applications, selection criteria of materials for engineering applications, evolution of manufacturing processes, selection criteria of manufacturing processes, introduction to manufacturing systems, plant layout and material handling, fundamentals of NC & CNC, product development cycle, case study. (7 hrs)",
    "course outcomes": "At the end of the course, students will be able to understand\n- History and evolution of Mechanical Engineering, and recent developments\n- Static and dynamic for particle and rigid body and apply to simple practical problems\n- Thermodynamic systems, temperature measurements, different temperature measuring instruments and will be able to apply to simple practical problems\n- Different materials, manufacturing processes and principles of selection of materials and manufacturing processes for engineering applications.",
    "reference books": "- Engineering Mechanics: Statics and Dynamics – J.L. Meriam & L.G. Kraige.\n- Engineering Mechanics (Dynamics), Hibbeler, Pearson Education (Singapore), Pvt. Ltd.\n- Engineering Mechanics: Timoshenko & Young\n- Engineering Mechanics (Statics).-Hibbeler\n- Engineering Mechanics: Statics and Dynamics – Shames, Prentice-Hall (India).\n- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.\n- M P Groover, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.\n- Yunus A. Cengel and Michael A.Boles, Thermodynamics – An Engineering Approach, McGraw Hill Education.\n- P K Nag, Engineering Thermodynamics, McGraw Hill Education.\n- Beer Johnston, Mechanics of Materials, McGraw Hill Education.\n…..………………….………………………………………………………………………..\nSCHEME OF EXAMINATION\nB.Tech (Mechanical Engineering) 3rd Semester"
  },
  {
    "course code": "MEPC-13",
    "course title": "Kinematics of Machines",
    "number of credits": "4",
    "prerequisites": "Applied Mechanics",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To understand the basic concepts of machines & various parts involved in machines\n- To understand the basic concepts of kinematics of machines for different applications\n- To analyze the motions of various mechanisms\n- To understand the basic concepts of design mechanisms to have given motions",
    "course content": "## UNIT - I\n\nMechanism and machines\nKinematics, introduction to analysis and synthesis of mechanisms, Classification of mechanisms – Basic kinematic concepts and definitions, Mechanism & Machines. rigid and resistance body, link, Kinematic pair, Types of motion, degrees of freedom, classification of Kinematic pairs, Kinematic Chain, Linkage, Mechanics, Gruebler‟s criterion ,Four bar chain and Slider crank chain, Kinematic inversions of four-bar chain and single and double slider crank chains. (5hrs) Velocity Analysis\nVelocity analysis using Relative velocity method and Instantaneous centre method, Kennedy’s theorem, Space cent rode and body cent rode. (3 hrs) Acceleration Analysis\nCentripetal and tangential accelerations, Acceleration determination by graphical method using velocity polygons, Corioli’s component of acceleration, Klein’s construction method to find acceleration of four bar mechanism and slider crank chain mechanism. (4 hrs)\n\n\n## UNIT-II\n\nComputer-aided analysis and synthesis of mechanism\nComputer-aided analysis of four-link mechanism and slider crank mechanism, Synthesis of mechanism by graphical method (function generation by Relative pole method and inversion method, Path generation and motion generation), Computer -aided Synthesis of Mechanism- Freudenstein’s equation (4 hrs) Lower pairs\nPantograph, straight-line motion mechanisms (Paucellier, Hart, Scott Russel, Grasshopper, Watt, Tchebicheff’s Parallel linkages) Indicator mechanisms (Simplex, Crosby, Thomson, etc) Automobile steering gears (Davis and Ackermann), Hooke’s joint (universal coupling), Double Hooke’s joints. (6 hrs)\n\n\n## UNIT-III\n\nFriction\nTypes of friction, Laws of dry friction, Motion along inclined plane, Screw threads, Screw jack, Wedge, Pivots and collars, Plate and cone clutches, Antifriction bearings, friction circle and friction axis. (6 hrs) Cams\nTypes of cams and followers, various motions of the follower, Construction of cam profiles, Analysis for velocities and accelerations of tangent and circular arc cams with roller and flat-faced followers. (6 hrs) UNIT-IV\nBelts, Ropes and Chains\nOpen and crossed belt drives, velocity ratio, slip, material for belts, crowning of pulleys, law of belting, types of pulleys, length of belt, ratio of belt tensions, centrifugal tension, power transmitted by belts and ropes, initial tension, creep, chain drive, chain length, classification of chains. (6 hrs)",
    "course outcomes": "Understanding of common mechanisms used in machines\n- able to perform velocity and acceleration analysis of mechanisms\n- able to do CAD based synthesis of mechanisms\n- Construction of cam profiles and analysis of their velocity and acceleration\n- Knowledge of power transmission devices such as belts , ropes and chains\n- Knowledge of straight line mechanisms and universal coupling",
    "reference books": "- Theory of Machines - S.S.Rattan, Tata McGraw Hill\n- Theory of Mechanism and Machines - Jagdish Lal, Metropolitan Book Co.\n- Theory of Machines by Sadhu Singh, Pearson Publisher\n- Theory of Machines - .L. Ballaney, Khanna Publisher\n..………………….………………………………………………………………………….."
  },
  {
    "course code": "MEPC-14",
    "course title": "Heat Transfer",
    "number of credits": "04",
    "prerequisites": "",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To introduce the principal concepts and different modes of Heat Transfer\n- To analyze the different systems through the use of these conduction, convection and radiation\n- To understand the basic concepts of design of heat exchanger",
    "course content": "Introduction\n\n\n## UNIT-I\n\nDefinition of heat; Modes of Heat Transfer; Basic Laws of heat transfer; Electrical Analogy of heat conduction; Conduction through composite walls; Overall heat transfer coefficient (5hrs)\nConduction\nThe General heat Conduction equation in Cartesian, cylindrical and spherical coordinates; steady one dimensional heat conduction without internal heat generation: the plane slab; the cylindrical shell; the spherical shell; Critical thickness of insulation.\nVariable thermal conductivity, Steady one dimensional heat conduction with uniform internal heat generation: the plane slab; cylindrical and spherical systems. Fins of uniform cross-section: Governing equation; Temperature distribution and heat dissipation rate; Efficiency and effectiveness of fins.\nTransient conduction: Lumped capacitance model, One-dimensional transient problems and analytical solutions. One dimensional Heisler charts (12hrs)\n\n\n## UNIT-II\n\nConvection\nIntroduction to free and forced convection; Newton’s law of cooling; convective heat transfer Coefficient; Nusselt number; Dimensional analysis of free and forced convection.\nInternal Forced convection: Laminar flow heat transfer in circular pipe – constant heat flux and constant wall temperature, thermal entrance region, Turbuent flow heat transfer in circular pipe, pipes of other cross sections\nExternal Flow: Concept of boundary layer; hydrodynamic and thermal boundary layer; Momentum and Energy equations for boundary layer. Exact solution for laminar flow over an isothermal plate using similarity transformation. The integral approach; integral momentum and energy equations; solution of forced convection over a flat plate using the integral method.\nNatural Convection: Analysis of free convection; governing equations for velocity and temperature fields.\nRelation between fluid friction and heat transfer, Reynolds analogy. Dimensionless numbers: Reynolds, Prandtl, Nusselt, Grashoff and Stanton\nNumbers and their significance, Heat transfer with change of phase; Nusselt theory of laminar film Condensation. (13hrs)\n\n\n## UNIT-III\n\nHeat Exchangers\nIntroduction; classification of heat exchangers; Logarithmic mean temperature Difference; Area calculation for parallel and counter flow heat exchangers; Effectiveness of heat exchangers; NTU method of heat exchanger design. Applications of heat exchangers. (5hrs)\n\n\n## UNIT-IV\n\nRadiation\nTheories of thermal radiation; Absorption, reflection and transmission; Monochromatic and total emissive power; Black body concept; Planck’s distribution law; Stefan Boltzman law; Wien’s displacement law; Lambert’s cosine law; Kirchoff’s law; Shape factor; Heat Transfer between black surfaces. (5hrs)",
    "course outcomes": "- The students will be able to understand about the different modes of heat transfer.\n- The students will be able to apply related heat transfer laws\n- The students will be able to calculate the heat flow rate in different engineering applications and its implications on temperature.\n- The students will be able to design Fins and heat exchangers for industrial applications",
    "reference books": "- Heat Transfer: A Practical Approach: Cengel, Y. A., McGraw Hill\n- Fundamentals of Heat and Mass Transfer: Incropera and Dewitt, John Wiley\n- Heat Transfer: Holman, J.P., Eighth Edition, McGraw Hill\n- A Text Book on Heat transfer: S.P. Sukhatme, University Press\n- Heat & Mass Transfer. D.S. Kumar, S.K. Katariya\n..………………….………………………………………………………………………….."
  },
  {
    "course code": "MEPC-15",
    "course title": "Fluid Machines",
    "number of credits": "4",
    "prerequisites": "Fluid Mechanics",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To learn and under/stand application of fluid mechanics to generate power\n- To provide the student the necessary analytical skills to solve and analyze a variety of fluid power related problems\n- To use concepts of momentum principles in order to impart the knowledge of impact of jets, pumps and turbines",
    "course content": "## UNIT- I\n\nPrinciples of Hydraulic Machines\nImpact of jet on stationary and moving flat and curved plates, Force on series of vanes, Radial vanes, Jet propulsion of ships. (2hrs) Hydraulic Turbines\nIntroduction, development of hydraulic turbines, Components of hydro-power plant, Classification of turbines, Euler’s equation and degree of reaction, Losses and efficiency of turbines, Surge tank and its types. (5hrs) Impulse Turbines\nPelton turbine, its components and design, Energy conversion, Condition for maximum efficiency, Governing of impulse turbines. (3hrs)\n\n\n## UNIT- II\n\nReaction Turbines\nFrancis turbine: components, working principles, draft tube, types of draft tube, design considerations, outward vs. inward flow reaction turbines, Evolution of axial flow turbines, Propeller and Kaplan turbines, Governing of reaction turbines.\n(5hrs)\nPerformance of Turbines\n\n\n## Unit quantities, specific speed, runway speed, characteristics of turbines, cavitation and its effects, cavitation parameters and Thoma’s cavitation factor, Detection and prevention of cavitation (5hrs)\n\n\n\n## UNIT- III\n\nCentrifugal Pumps\nIntroduction, classification & components of centrifugal pumps, Principle of working, Various heads, Energy conversion, Euler’s head and its variation with vane shapes, Effect of finite number of vanes, Losses and efficiencies, Minimum starting speed, Limitation of suction lift, Net Positive Suction Head (NPSH), Multistage pumps, Priming, Specific speed and performance. (5hrs) Reciprocating Pumps\nWorking principles, Classification, Components, Discharge, Slip, Power input, Indicator diagram, Effect of accelerating head and pipe friction, Maximum speed, Air vessels, Comparison with centrifugal pumps. (5hrs)\n\n\n## UNIT- IV\n\nOther Hydraulic Pumps\nPropeller pump, Jet pump, Airlift pump, Gear pump, Screw pump, Vane pump, Radial piston pump, Submersible pump, pump problems. (3hrs) Hydraulic Systems\nHydraulic accumulators, Hydraulic intensifier, Hydraulic lift, Hydraulic crane, Hydraulic coupling, Torque convertor, Hydraulic ram. Hydraulic valves: check valve, relief valve, speed control valve, pressure compensating valve, direction control valve, Hydraulic filters and piping. (5hrs) Dimensional Analysis and Model Testing\n\n\n## Units and dimensions, Dimensional analysis method: Rayleigh and Buckingham methods, Dimensionless numbers, Similitude laws, Model testing of turbine and pumps. (2hrs)",
    "course outcomes": "- At the end of the course student will be able to understand the working and design of various types of hydraulic turbines and pumps.\n- They would also understand the working of various types of hydraulic machines and systems.",
    "reference books": "- Som and Biswas, Introduction to Fluid Mechanics and Machinery, Tata McGraw Hill, 3rd Edition, 2011.\n- D. S. Kumar, Fluid Mechanics and Fluid Power Engineering, S.K. Kataria & Sons, 8th Edition, 2013.\n- P.N.Modi, S.M Seth, Hydraulics and Fluid Mechanics including Hydraulic Machines, Standard Book House, 19th Edition, 2009.\n- D. Rama Durgaiah, Fluid Mechanics and Machinery, New Age International Publishers, 2002.\n- S.S. Rattan, Fluid Mechanics and Hydraulic Machines, Khanna Book Publishing, 2014.\n- P. Balachandran, Engineering Fluid Mechanics, Prentice Hall India, 2102.\n- R. K. Bansal, Fluid Mechanics and Hydraulic Machines, Laxmi Publications, 9th Edition, 2017.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-16",
    "course title": "Strength of Materials-I",
    "number of credits": "4",
    "prerequisites": "-",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To learn about the simple and compound stresses at a point in a material and its evaluation.\n- To understand the concept of strain energies that forms the basis of analysis in many cases.\n- To know about the shear forces, bending moments, bending stresses and shear stresses in a beam.\n- To study various methods to find the deflection of beams under various load conditions.\n- To study the various theories of failure of materials.",
    "course content": "## UNIT- I\n\nSimple Stress and Strain\nConcept of stress and strain, normal and shear stresses, Hooke’s law, principle of St. Venant, Modulus of elasticity, Modulus of rigidity, stress-strain diagram, elongation due to self-weight, column of uniform strength, composite sections, statically indeterminate systems, temperature stresses, strain analysis, Poisson’s ratio, volumetric strain, factor of safety, tensile test diagram, elastic constants, relation between elastic constants. (5hrs) Compound Stress and Strain\nStresses on an inclined plane, principal stresses and principal planes, Mohr’s stress circle, three coplanar stresses, ellipse of stress, strain analysis, principal strains, Mohr’s strain circle, principal stresses from principal strains. (5hrs)\n\n\n## UNIT- II\n\nShear Force and Bending Moment Diagrams\nTypes of supports and beams, shear force, bending moment, relation between load, shear force and bending moment, shear force and bending moment diagrams for various types of loading and supports, maximum bending moment and point of contra flexure, loading and bending moment diagrams from shear force diagrams. (6hrs)\nStrain Energies\nStrain energy, resilience, strain energy in 3-D system, shear strain energy, shear strain energy in 3-D system, stresses due to various types of loading. (4hrs)\n\n\n## UNIT- III\n\nCentre of Gravity and Moment of Inertia\nCentre of gravity, Moment of an area, Centroid of a uniform lamina, centroid of laminas of various shapes, Moment of inertia of laminas of different shapes.\n(2hrs)\nBending Stress in Beams\nStresses due to simple bending, moment of inertia, beams with uniform bending strength, composite or flitched beams, unsymmetrical bending, determination of principal axes, ellipse of inertia, combined direct and bending stress, middle-third and middle-quarter rules. (4hrs)\nShear Stress in Beams\nShear stress distribution, Variation of shear stress in beams of various sections, any combination of sections subjected to shear force, built up beams, shear centre. (4hrs)\n\n\n## UNIT- IV\n\nSlope and Deflection\nBeam differential equation, slope and deflection at a point, double integration method, Macaulay’s method, moment-area method, strain energy methods, Castigliano’s theorem, conjugate beam method, Maxwell’s reciprocal theorem, deflection of beams due to shear stress. (7hrs) Theory of Failures\nDifferent theories of failure, Significance, graphical representation. (3hrs)",
    "course outcomes": "After studying this course, students should be able to\n- Determine the values of stresses in materials under simple and compound loading\n- Draw shear force and bending moment diagrams for beams under different load conditions\n- Evaluate strain energies in materials under gradual, sudden and impact loading\n- Find shear and bending stresses in beams\n- Find slope and deflection of beams using different methods\n- Explain different theories of failure",
    "reference books": "- G H Ryder, “Strength of Materials”, ELBS, 3rd edition, 1969\n- S S Rattan, “Strength of Materials”, Tata McGraw Hill, India, 3rd Edition, 2017\n- Beer P F and Johnston (Jr) E R, “Mechanics of Materials”, McGraw Hill Education, 7th edition, 2015.\n- Sadhu Singh “Strength of Materials”, Khanna Publishers, 3rd edition, 2001.\n- D K Singh, “Strength of Materials”, Ane Books India, 1stEdition , 2007.\n- Popov E P, “Engineering Mechanics of Solids”,Prentice Hall of India, New Delhi, 2nd edition, 1999.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-17",
    "course title": "Machine Drawing",
    "number of credits": "03",
    "prerequisites": "Engineering Graphics / Drawing",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "The student will acquire knowledge of fastening arrangements such as welding, riveting, and the different styles of attachment for shaft. The student also is enabled to prepare the assembly of various machine or engine components and miscellaneous machine components.\n- Study the conventions and rules to be followed by engineers for making accurate drawings.\n- Understand the basic dimensioning practices that have to be followed in the preparation of drawings.\n- Help the student in the visualization of assembly and sub assembly of various machine elements.\n- Train the students in the preparation of assembly drawings",
    "course content": "## Unit-I\n\nFasteners\nConventional representation of materials, common machine elements and parts such as Screw Threads screws, nuts, bolts, keys, cotters,. Rivets and riveted joints. Welds and welded joints [7 hrs]\n.\nMachine Drawing\nFree hand drawing of simple machine parts i.e. cotter joint, knuckle joint and shaft couplings, pipe fittings and pipe joints. [7 hrs]\nBearing\nSimple solid, bushed, pedestal, footstep bearings, I.S. conventional representation of ball and roller bearings, bracket and hangers of different types and bracket bearings, Plumber block etc [14 hrs]\n\n\n## Unit-II Introduction\n\nIntroduction of unit assembly drawing, Practice in drawing details and assembly of simple units. [7 hrs]\n\n\n## Unit-III\n\nValves\nFeed Check Valve, Blow off Cock, Stop Valve, Safety Valves [21 hrs]\n\n\n## Unit-IV\n\nSimple Steam and I.C. Engine Parts\nPistons, piston rod, cross head, stuffing box and glands, connecting rods, piston and connecting rod for I.C. engine. [10 hrs]\n.\nNote: Drawings should be in first angle method of projection.",
    "course outcomes": "At the end of the course students are able to:\n- Drafting their technical ideas\n- Creating knowledge about the various practices with regard to the dimensioning, sectioning and development of views.\n- Understanding the importance of the linking functional and visualization aspects in the preparation of the part drawings\n- Preparation of the part or assembly drawings as per the conventions.\n- Interpretation of machine drawings that in turn help the students in the preparation of the production drawings and to enhance the ability to work as practicing mechanical engineers in manufacturing Industries and consulting firms.",
    "reference books": "- Machine Drawing - N.D. Bhatt, Charotar Pubs.\n- Machine Drawing - Sidheshwar, Tata McGraw-Hill\n- A text book of Machine drawing - R.B. Gupta, Satya Prakasham Tech. Pub.\n- Machine Drawing –K.L.Narayana, P.Kannaiah& K. Venkata Reddy / New Age/ Publishers\n- Machine Drawing – P.S.Gill.\n- Machine Drawing – Luzzader\n- Machine Drawing – Rajput\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-11",
    "course title": "Fluid Machines (Practical)",
    "number of credits": "1",
    "prerequisites": "Experimental Test Rigs of Turbines, Pumps and Hydraulic Ram",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "- To provide practical knowledge in verification of principles of fluid flow.\n- To impart knowledge in measuring pressure, discharge and velocity of fluid flow.\n- To understand Major and Minor Losses.\n- To gain knowledge in performance testing of Hydraulic Turbines and Hydraulic Pumps at constant speed and Head.",
    "course content": "- Determine the overall efficiency of Pelton wheel Turbine at Constant Speed and Constant Head\n- Determine the overall efficiency of Francis Turbine at Constant Speed and Constant Head.\n- Determine the overall efficiency of Kaplan Turbine at Constant Speed and Constant Head.\n- Determine the overall efficiency of Centrifugal pump at Constant Speed and Constant Head.\n- Determine the overall efficiency of Reciprocating pump at Constant Speed and Constant Head.\n- Study and perform test on a Gear pump.\n- Study and perform test on a Torque Convertor.\n- Study and perform test on a Hydraulic Ram to find out its efficiency.",
    "course outcomes": "At the end of the course student will be able to\n- Do performance analysis of fluid machines specially turbines and pumps.\n- Analyse practical problems in all power plants and chemical industries.\n- Conduct experiments (in teams) and analyse a variety of practical fluid-flow devices and utilize fluid mechanics principles in design.\n- Optimize the pumping efficiency and select the proper pump, if provided with flow rate and pressure rise.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-12",
    "course title": "Strength of Materials-I (Practical)",
    "number of credits": "01",
    "prerequisites": "",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "The objectives of the course are:\n- To understand the behavior of materials under different tests like hardness, impact, tensile, etc\n- To understand the basic principles of strength of materials and structural analysis.\n- To understand the concept of stress and strain under different loading conditions.\n- To impart knowledge about the testing of springs and beams and behavior of materials.\n- To understand the mechanics of different testing machines like Servo hydraulic UTM, Servo electric UTM, etc.\nList of Experiments:\n- To study the Impact testing machine and to perform the impact tests (Izod and Charpy).\n- To study the Rockwell Hardness testing machine and find the Rockwell Hardness of the given specimen.\n- To study the Vickers Hardness testing machine and find the Vickers Hardness of the given specimen. 4. To study the Brinell Hardness Testing machine and find the Brinell Hardness of the given specimen.\n- To study the Erichsen Cupping machine and find out the Erichsen value of the given specimen of Sheet Metal.\n- To study the Strut-Testing Structure and to determine i) The Buckling Load of a Pinned-End Strut ii) The effect of End Conditions on the Buckling Load.\n- To study the Bending stress in a Beam Structure and to find the Bending Stress in a Beam.\n- To study the Torsion testing machine and to perform the Torsion test on a given specimen.\n- To study the Universal Testing Machine(UTM) and to perform the Tensile test.\n- To perform the Compression test on Universal Testing Machine (UTM).\n- To perform the Bending Test on Universal Testing Machine (UTM).\n- To find the Stiffness of a given Spring on Universal Testing Machine (UTM).\n- To perform the Fracture Mechanics Test on a Servo Hydraulic Universal Testing Machine of 100kN capacity.\n- To perform Low Cycle Fatigue Test on a Servo Hydraulic Universal Testing Machine of 100kN capacity.\n- To study the constant load creep behaviour of metals on a Servo Electric Universal Testing Machine of 100kN capacity.",
    "course outcomes": "At the end of the course, the students would be able to\n- Understand the procedure of doing different tests like hardness, compression, torsion, tension, impact, etc in various materials.\n- Understand the effect of stress and strain in different types of machines/structures under different loading conditions.\n- Describe the behavior of materials upon normal external loads.\n- Predict the behavior of the material under impact conditions.\n- Recognize the mechanical behavior of materials.\n- Measure the properties of the materials such as impact strength, tensile strength, compressive strength, hardness, ductility, etc."
  },
  {
    "course code": "MELR-13",
    "course title": "Heat Transfer (Practical)",
    "number of credits": "01",
    "prerequisites": "",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "Through this course, students will study about the various heat transfer processes, so as to train the students practically to utilize this knowledge in industry.",
    "course content": "- Determination of thermal conductivity of a metal rod.\n- Determination of thermal conductivity of an insulating powder.\n- Determination of thermal conductivity of a liquid using Guard-plate method.\n- Determination of thermal resistance of a composite wall\n- Temperature distribution of a pin fin in free-convection.\n- Temperature distribution of a pin fin in forced-convection\n- Forced convection heat transfer from a cylindrical surface\n- Determination of Effectiveness of a Heat Exchanger\n- Determination of Stefan-Boltzman constant\n- Determination of critical heat flux\n- Performance of solar water heater\n- Measurement of solar radiation using solar integrator.\n- Heat Transfer in Agitated Vessel",
    "course outcomes": "At the end of the course, the students would be able to perform experiments on heat conduction, convection and radiation.\n…..………………….………………………………………………………………………..\nSCHEME OF EXAMINATION\nB.Tech (Mechanical Engineering) 4th Semester\nSCHEME OF EXAMINATION\nB.Tech (Mechanical Engineering) 4th Semester Programme Electives (PE)"
  },
  {
    "course code": "MEPC-18",
    "course title": "Production Technology – I",
    "number of credits": "4",
    "prerequisites": "Manufacturing Processes, Engineering Practice",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To understand milling machine tool and associated machining operations\n- To understand hole making operations\n- To understand grinding process and other super finishing processes\n- To understand measurement of machined surface and associated aspects\n- To understand metal cutting and associated aspects",
    "course content": "Milling\n\n\n## UNIT- I\n\nIntroduction, Milling machines types, milling cutters, milling operations, dividing head and indexing types, Up milling down milling, milling operations, special set- ups. (5hrs)\nHole Making Operations\nIntroduction, Drilling, reaming, boring, tapping, other hole making operations\n(3hrs)\n\n\n## UNIT- II\n\nMetal Cutting\nBasic tool geometry, single point tool nomenclature, Chips- various type and their characteristics, mechanism of chip formation, Theoretical and experimental determination of shear angle. Orthogonal and oblique metal cutting. Metal cutting theories, relationship of velocities, forces and power consumption. (6hrs) Tool Life and Wear\nEffect of operating parameters like tool geometry, cutting speed, feed depth of cut, coolant, materials etc. on force, temp, tool life, surface finish etc. Tool life relationship, Taylor's equation of tool life. Tool materials, flank wear, crater wear, mechanism of tool wear. (6hrs)\n\n\n## UNIT-III\n\nThermal aspects of machining:\nCutting temperature and factors affecting it, measurement, cutting fluids and its types, selection of cutting fluids. (3hrs)\nAnalysis of Machining processes\nMechanics of machining of turning, boring, shaping and planning, milling (Slab and face milling), drilling, machining time calculations of above operations. (4hrs) Economics of metal machining\nElements of machining cost, tooling economics, machining economics and optimization. (3hrs)\n\n\n## UNIT- IV\n\nGrinding and super finishing processes\nGrinding process, wheel characteristics, specifications, lapping, honing. (4 hrs)\nMetrology\nLinear and angular measurements, sine bar, auto-collimator, comparators: mechanical, electrical, optical and pneumatic, Surface finish and its measurement, Micro and macro deviations, factors influencing surface finish and evaluation of surface finish. Limits, fits & tolerances, gauge design. (7hrs)",
    "course outcomes": "At the end of the course student will be able to know\n- milling machine tool and associated machining operations\n- various hole making operations\n- grinding, honing and lapping processes\n- various direct and indirect methods of linear and angular measurement of machined components, types of fits as well as gauges and its design\n- orthogonal metal cutting theory, tool wear and tool life, economics and analysis of conventional machining processes.",
    "reference books": "- Manufacturing Science - Ghosh and Mallik, E.W. Press\n- Principles of Metal cutting - Sen and Bhattacharya, New central book.\n- Metal Cutting Principles - Shaw, MIT Press, Cambridge\n- Manufacturing Analysis- Cook, Addision-Wesley\n- Production Engineering Science- Pandey and Singh\n- DeGarmo, E. P., Black, J.T., and Kohser, R.A., “Materials and Processes in Manufacturing”, Prentice-Hall of India.\n- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.\n- Groover, M.P., “Fundamentals of Modern Manufacturing”, John Wiley & Sons.\n- Boothroyed, G. et al., Fundamentals of Metal Cutting and Machine Tools, McGraw Hill.\n- Rao,P.N., “Manufacturing Technology”, (Vol. 2), Tata McGraw-Hill\n- Ghosh, A. and Mallik, M., “Manufacturing Science”, E.W. Press\n- Lal, G.K., “Introduction to Machining Science”, New Age International Publishers.\n- Production Engineering Science- Pandey and Singh.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-19",
    "course title": "Strength of Materials-II",
    "number of credits": "4",
    "prerequisites": "-",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To learn about fixed and continuous beams and methods to find fixing moments and end reactions.\n- To study the theory to find the stresses in curved bars (Winkler-Bach theory).\n- To study torsion of shafts and to know the stresses and deflections of various types of springs.\n- To learn about various types of stresses in thin and thick cylinders\n- To study Euler theory and other formulae to find the stresses in long columns and struts.\n- To learn about stresses developed in rotating cylinders",
    "course content": "## UNIT- I\n\nFixed and Continuous Beams\nFixed beams, continuous beams and overhanging beams, moment-area method, Macaulay’s method,Clapeyrons’s three moment equation, moment distribution method, slope and deflection of propped (elastic and rigid) cantilevers and beams subjected to point loads and/or uniformly distributed loads. (5Hrs)\nBending of Curved Bars\nStresses in bars of small initial curvature, Stresses in bars of large initial curvature, Winkler-Bach theory, stresses in crane hooks, circular hooks, circular rings, simple chain links, deflection of curved bars, crane hooks, rings, and simple chains. (5 Hrs)\n\n\n## UNIT- II\n\nTorsion\nCircular shafts, power transmission, Shear stresses in hollow and solid shafts, shafts in series and parallel, Stepped and composite shafts, shafts subjected to combined bending and twisting loads, equivalent twisting and bending moments, strain energy in torsion, Bredt-Batho theory, thin-walled sections, thin rectangular members. (5 Hrs)\nSprings\nClosed-coiled helical springs subjected to axial loads and couples, springs in series and parallel, concentric springs, stresses and deflections in open-coiled helical springs subjected to axial loads, and/or twisting couples, stresses and deflections in leaf springs, flat spiral springs. (5 Hrs)\n\n\n## UNIT- III\n\nThin Cylinders and Spheres\nThin cylinders subjected to internal pressure, Circumferential and longitudinal stresses and strains, Maximum shear stress, thin spherical shells subjected to internal pressure, wire winding of thin cylinders. (5 Hrs) Thick Cylinders\nLame’s theory, thick cylinders subjected to internal and external pressures, compound cylinders, stresses and strains in thick spherical vessels subjected to internal and external pressures. (5 Hrs)\n\n\n## UNIT- IV\n\nColumns and Struts\nColumns under axial load, concept of instability and buckling, slenderness ratio, various end conditions, Euler's theory for initially straight columns, assumptions and limitations, empirical formulae, stresses and deflections in eccentrically loaded straight long columns, secant formula, stresses and deflections in struts with initial curvature and in straight long columns with transverse loads for different end conditions. (6Hrs)\nRotating Discs and Cylinders\nStresses and strains in rotating rims or rings of uniform thickness, stresses and strains in rotating thin solid and hollow discs of uniform thickness, stresses and strains in rotating thin disc of uniform strength, stresses and strains in rotating solid and hollow cylinders. (4Hrs)",
    "course outcomes": "After studying this course, students should be able to\n- Draw bending moment and shear force diagrams in fixed end continuous beams using various methods.\n- Determine stresses and deflections in curved bars\n- Find the stresses in shafts under torsion and stresses and deflection of springs.\n- Differentiate thick and thin cylinders and to determine stresses in them.\n- Find stresses in rotating discs and cylinders.\n- Deduce expressions for crippling load for columns with various types of end conditions.",
    "reference books": "1. G H Ryder, “Strength of Materials”, ELBS, 3rd edition, 1969\n2 S S Rattan, “Strength of Materials”, Tata McGraw Hill, India, 3rd Edition, 2017\n- Beer P F and Johnston (Jr) E R, “Mechanics of Materials”, McGraw Hill Education, 7th edition, 2015.\n- Sadhu Singh “Strength of Materials”, Khanna Publishers, 3rd edition, 2001..\n- Popov E P, “Engineering Mechanics of Solids”,Prentice Hall of India, New Delh, 2nd edition, 1999.\n- R Subramaniam, “Strength of Materials”,Oxford University Press,2nd Edition, 2010."
  },
  {
    "course code": "MEPC-20",
    "course title": "Machine Design-I",
    "number of credits": "4",
    "prerequisites": "-",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To understand the engineering materials their properties, concept of endurance strength, the manufacturing and assembly considerations during design process.\n- To understand the design process of riveted joint, welded joint, bolted joint, cotter joint, knuckle joint, keys and pipe joints.\n- To understand the process of shaft design for different types of loadings, coupling design, their types and applications.\n- To understand the design and applications of different types of levers, basic concepts and design of power screw.",
    "course content": "## UNIT- I\n\nEngineering Materials and Concepts of Design\nProperties: chemical, physical, mechanical and dimensional; Ferrous metals, Non- ferrous metals, Plastics, Composite materials etc, Selection of Engineering Materials. Design methodology, Classification of machine design and the general considerations, Design criterion based on fracture, deformation and elastic stability, design stresses, factor of safety. Significant stress and significant strength, stresses-concentration, causes and mitigation, Endurance limit, Effect of concentration, Notch sensitivity, Size and surface finish, Goodman diagram, Gerbers parabola and Soderberg line. (6 hrs)\nManufacturing and Assembly Considerations\nSupports and retainment of rotating assemblies; manufacturing considerations in design, design of castings and weldments. (4 hrs)\n\n\n## UNIT- II\n\nDesign of joints\nRiveted joints for boiler shell according to I.B.R., riveted structural joint, and riveted joint with eccentric loading. Types of welded joints, strength of welds under axial load, Welds under eccentric loading, designation of various types of bolts and nuts, Design of bolted joints, Bolts of uniform strength, Bolted joints with eccentric loads. (7 hrs)\nDesign of Keys, Cotter joint and knuckle joints. (3 hrs)\n\n\n## UNIT - III\n\nDesign of Shaft\nDesign of shafts subjected to pure torsion, pure bending load, Combined bending & torsion, combined torsion, bending and axial loads, Design of shaft on the basis of rigidity. (5 hrs)\nDesign of Couplings\nTypes of shaft couplings, Design of sleeve or muff coupling, flange coupling and bush type flexible couplings. (5 hrs)\n\n\n## UNIT - IV\n\nDesign of Levers\nIntroduction, hand and foot levers, cranked levers, lever for a lever safety valve, Bell crank lever, miscellaneous levers. (3 hrs) Pipe joints\nIntroduction, Types of pipe joints, Design of circular, oval shaped and square flanged pipe joints. (4 hrs)\nPower screw\nFunction, types of power screws, stresses in screws, Self locking screw, Design of Screw jack, Differential and Compound Screws. (3 hrs)",
    "course outcomes": "At the end of the course student will be able to\n- Understand the engineering materials their properties, concept of endurance strength, the manufacturing and assembly considerations during design process.\n- Understand the design process of riveted joint, welded joint, bolted joint, cotter joint, knuckle joint, keys and pipe joints.\n- Understand the process of shaft design for different types of loadings, coupling design, their types and applications.\n- Understand the design and applications of different types of levers, basic concepts and design of power screw.",
    "reference books": "- Design of Machine Elements - Bhandari, Tata McGraw-Hill\n- Machine Design- Maleev and Hartmann, CBS Public.\n- Machine Design - Sharma and Aggarwal, Kaston Publc.\n- PSG Design data book - PSG Publication, Coimbtore\n- Machine Design – An Integrated Approach - Robert L. Norton, Prentice-Hall Inc.\n- Fundamentals of Machine Component Design - R.C. Juvinall, John Wiley & Sons\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC- 21",
    "course title": "Dynamics of Machines",
    "number of credits": "4",
    "prerequisites": "Applied Mechanics, Kinematics of Machines",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To equip the student with fundamental knowledge of dynamics of machines so that student can perform static and dynamic force analysis\n- To develop knowledge of analytical and graphical methods for calculating balancing of rotary and reciprocating masses.\n- Develop understanding of flywheel analysis, gyroscopic forces and governors\n- To familiarize with the type of gears, gear trains and brakes",
    "course content": "Static Forces in Mechanisms\n\n\n## UNIT-1\n\nIntroduction, Static force analysis, Static equilibrium, Equilibrium of members, Force convention, free body diagram, Principle of superposition, static force analysis of Four bar mechanisms ,Static forces analysis of Slider-Crank mechanism, Static force analysis of Quick Return Mechanism. (4hrs) Dynamic Forces in Mechanisms\nD’ Alembert’s principle, Equivalent offset inertia force, Dynamic force analysis of four-bar mechanism, Dynamics of reciprocating parts, Piston effort, Crank effort, Equivalent dynamical systems, and Inertia force in reciprocating engines by graphical and analytical method. (6hrs)\n\n\n## UNIT-II\n\nGears\nTypes of gears, gear terminology, condition for correct gearing, cycloidal and involutes profiles of gear teeth, pressure angle, path of contact, arc of contact, interference, undercutting, minimum number of teeth, number of pairs of teeth in contact, Helical gear and spiral gear, Expression for centre distance between two shafts connected by spiral gear or helical gear, Efficiency of spiral and helical gear, Efficiency of worm and worm gear. (5hrs) Gear Trains\nTrain value, Limitations in design of gear trains, Types of gear trains- simple, compound, reverted, and epicyclic gear train, Solution of gear trains, sun and planet gear, bevel epicyclic gear, compound epicyclicgear, pre- selective gear box, differential of automobile, torque in gear trains. (4hrs)\n\n\n## UNIT-III\n\nGovernors\nTypes of governors: Watt, Porter, Proell, spring loaded centrifugal governors- Hartnell and Wilson Hartnell, Sensitiveness, Stability, Isochronism’s-- Hartnell and Wilson Hartnell, Hunting, Effort and power of governor, controlling force. (4 hrs) Flywheels\nTurning moment (crank effort) diagrams for single cylinder and multi-cylinder engines, coefficient of fluctuation of energy, coefficient of fluctuation of speed, flywheel and its function. (4hrs)\nBrakes and Dynamometers\nTypes of brakes, Block or shoe break, band brakes, band and block brakes, internal expanding shoe brake, dynamometers: absorption, transmission, and tensional. (4 hrs)\n\n\n## UNIT-IV\n\nBalancing\nBalancing and its classification, Need of balancing, Balancing of rotating weights, Balancing of reciprocating parts, balancing of I.C. engines, balancing of multi- cylinder engine: V-engines and radial engines, balancing of machines. (5hrs) Gyroscope\nGyroscope, Gyroscopic couple and its effect on aircraft, naval ships during steering, pitching and rolling, Stability of an automobile (2-wheelers & 4-wheelers).\n(4hrs)",
    "course outcomes": "- Students should be able to perform static and dynamic analysis of machines\n- Students should be able to perform balancing of rotating and reciprocating parts of machines\n- Students should be able to describe the working of different types of brakes, dynamometers and governors\n- Students should know different types of gears, gear terminology and understand important gear trains and their practical applications.\n- Student should be able to construct turning moment diagram and have the Knowledge of flywheels and Gyroscopic Motion",
    "reference books": "- Theory of Machines - S.S.Rattan, Tata McGraw Hill\n- Theory of Mechanism and Machines - Jagdish Lal, Metropolitan Book Co.\n- Theory of Machines by Sadhu Singh, Pearson Publisher\n- Theory of Machines- .L. Ballaney, Khanna Publisher\n- Dynamics of Machinery by S. Balaguru, Scitech Publications\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR -14",
    "course title": "Computer Aided Design Lab",
    "number of credits": "1 (3hrs Lab)",
    "prerequisites": "Computer Aided Design (MEPE-11)",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "- To get the knowledge of modelling softwares\n- To understand the 2D, 3D and assembly drawing features of different CAD softwares.\n- To understand and generate 2D entities using programming techniques",
    "course content": "- To perform 2D scaling, reflection, rotation and translation transformations of a geometric entity.\n- To perform 3D scaling, reflection, rotation and translation transformations of a geometric entity and show its application for a unit cube.\n- To generate the top, front and side views of a truncated cube.\n- To generate isometric projection and apply it to view a given object.\n- To generate dimetric projection and apply it to view a given object in different orientations.\n- To perform single point perspective projection and use it to view a truncated cube.\n- To perform joining a set of points in space by Hermite curve segments and demonstrate the manipulation of curve shape by varying the geometric conditions.\n- To generate a Bezier curve for a given set of control points and demonstrate the manipulation of curve shape by varying the geometric conditions.\n- To generate a B-Spline curve for a given set of control points and demonstrate the manipulation of curve shape.\n- To generate and view a ruled surface between two given rails.\n- To generate and view a Bezier surface for a given mesh of control points.\nList of Software’s required\n- SOLIDWORKS/CATIA/Auto Desk INVENTOR/PTC Creo\n- MATLAB",
    "course outcomes": "At the end of the course student will be able to\n- Draw the 2D, 3D drawing of complex machine components\n- Design contours and surfaces using modelling softwares.\n- Generate 2D entities using MATLAB"
  },
  {
    "course code": "MELR-15",
    "course title": "Production Technology –I (Practical)",
    "number of credits": "1.0",
    "prerequisites": "Manufacturing Processes, Workshop Practice",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "To have hands on training by preparing various jobs in machine shop, foundry shop, welding shop.",
    "course content": "- To measure various angles of a single point cutting tool in ASA system\n- To measure various angles of Plain milling cutter\n- To prepare a job on a lathe having various operations viz. drilling, boring, taper turning, thread cutting, knurling, etc.\n- To prepare a given job on milling machine\n- Prepare a wooden pattern of the given item considering allowances etc.\n- Prepare a mould and do casting of the pattern (Sl. No.3) prepared above.\n- Study of linear, angular measuring devices and to measure the linear and angular dimensions using various equipments.\n- To carry out welding by electric arc welding in flat, horizontal and vertical position of given jobs\n- Introduction to various grinding wheels and demonstration on the cylindrical and surface grinder.\n- Introduction to tool and cutter grinder and dynamometer.",
    "course outcomes": "The students will be able to measure various tool angles, carry out various operations on lathes, milling machine tools, precision measurements in metrology lab as well as welding of jobs\nReferences:\nHandouts provided in the lab.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-16",
    "course title": "Theory of Machines (Practical )",
    "number of credits": "1",
    "prerequisites": "Dynamics of Machines",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "To prepare students for kinematic and dynamic of various machines and mechanisms.",
    "course content": "- To determine experimentally the ratio of cutting to idle time to the crank & slotted lever (QRM) & Compare the result with theoretical values. Plot the following:\n- θ v/s displacement of slider\n- θ v/s velocity\n- θ v/s acceleration\n- To determine velocity & acceleration of slider in Slider Crank mechanism and plot the following:\n- θ v/s displacement of slider\n- θ v/s velocity\n- θ v/s acceleration Compare the values of velocities and acceleration with those obtained theoretically. Assume W= 1 rad/sec\n- To determine the values of coefficient of friction between the screw & nut of jack while:\n- Raising the load\n- Lowering the load\n- To draw experimentally a curve of the follower displacement v/s cam angle. Differentiate the above curve to get velocity & acceleration plot & compare the values with those obtained analytically.\n- To determine the value of coefficient of friction between belt & pulley and plot a graph between log T1/T2, &θ and measure the slip and creep in belt drive.\n- To determine the value displacement, velocity and acceleration of driven shaft of Hook’s joint for a constant speed of the driven shaft.\n- To find experimentally the gyroscopic couple on motorized Gyroscope and compare with applied couple.\n- To find critical speed experimentally and to compare whirling speed of shaft with theoretical values.\n- To perform the experiment of balancing of rotating parts and find unbalanced couples and force.\n- To find experimentally the Coriolli's component of acceleration and compare with theoretical values.\n- To study different types of Centrifugal governor.\n- To measure Epicyclic Gear ratio between input shaft and output shaft.",
    "course outcomes": "Students are able to perform the static and dynamic analysis of mechanisms.\n- Should be able to perform the experiment on balancing of masses.\n- Able to perform the experiment on various mechanisms.\n- Able to perform the experiment of Coriolli’s component of acceleration.\n- Knowledge of Gyroscopic Motion, Governors and Gear Tra\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-17",
    "course title": "Numerical Methods and Computer Programming (Practical )",
    "number of credits": "1",
    "prerequisites": "CSIR-11",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "- To Embedding the skills of programming with mathematical formulation of dynamic analysis.\n- The source codes for the following problems are to be developed by the students and results should be verified.\n- The programming has to be done in MATLAB environment using C style i.e functions available in MATLAB have to be used only for comparing the results obtained from the program developed by the students.",
    "course content": "## UNIT-I\n\n- Solution to Non-linear equation in single variable using the method of successive Bisection\n- Solution to Non-Linear Equation in single variable using the Newton- Raphson method\n- Solution to Non-Linear Equation in single variable using the secant method.\n\n\n## UNIT-II\n\n- Solution to a system of simultaneous algebraic equations using the Gaussian elimination procedure.\n- Solution to a system of simultaneous algebraic equations using the Gauss- Seidel iterative method.\n- Solution to a system of simultaneous algebraic equations using the Crout’s triangularisation method.\n- Solution to a system of simultaneous algebraic equations using the Gauss- Seidel iterative method employing the technique of successive relaxation.\n- Solution to a system of simultaneous algebraic equations using the LU decomposition.\n\n\n## UNIT-III\n\n- Curve fitting i.e. obtaining a best fit curve of linear, quadratic or higher polynomial. And find the error of fit.\n- Numerical solution to an ordinary differential equation using the Euler’s method\n- Numerical solution to an ordinary differential equation using the Range-Kutta method\n- Numerical solution to an ordinary differential equation using the Predictor- corrector method\n- Numerical solution to an ordinary differential equation using the Picard’s method\n- Numerical solution to an ordinary differential equation using the Euler’s method\n\n\n## UNIT-IV\n\n- Numerical solution to the Laplace equation using the method of Finite Differences.\n- Numerical solution to the Laplace equation using the ADI approach.\n- Numerical solution to the one dimensional transient equation using the Finite Differences with forward, backward and central approximation.\n- Solving an ODE using the Milne’s predictor-corrector method.",
    "course outcomes": "At the end of the course student will be able to deal with various methods needed to solve the mathematical modeling of various systems.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-10",
    "course title": "Thermal Power Engineering",
    "number of credits": "3",
    "prerequisites": "Nil",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To understand the basic fundamentals of boilers and power plant cycles.\n- To understand operations of steam turbines and steam power plants.\n- To understand operations of diesel and gas turbine power plants.\n- General understanding of challenges in thermal power plants.",
    "course content": "## UNIT-I\n\nIntroduction\nIntroduction to thermal power, Description and classification of boilers, Boiler mountings & accessories, Natural draught, Artificial draught: Chimney design, Steam jet draught and mechanical draught, Calculation of boiler efficiency & equivalent evaporation. (6hrs)\nVapour Power Cycles\nCarnot cycle, Simple & modified Rankine cycles, Effect of operating variables on Rankine cycle, Rankine cycle with superheating, Reheating & regeneration, Reheat factor, Binary vapour cycle. (4hrs)\n\n\n## UNIT-II\n\nSteam Turbines\nIntroduction, Classification of steam turbines, Working principle, Compounding, Velocity diagrams, Calculation of power output and efficiency, Condition for maximum efficiency, Degree of reaction, Governing of steam turbine.\n(8hrs)\nSteam (Thermal) Power Plants\nAnalysis of steam power cycles for power plant application; High pressure boilers- La-Mont boiler, Benson boiler, Loeffler boiler; Velox boiler; Super pressure steam power plants; Economizers; Air-preheaters; Super heaters and reheaters; Feed water heaters. General layout of thermal power plant; Site selection for thermal power plant; Coal as fuel, classification of coals, analysis of coal; Coal handling; Dead and live storage; Combustion of coal: coal burning methods, overfeed stokers, underfeed stokers, Pulverized fuels and burners. Ash handling and disposal; Dust collectors. Heat balance sheet for thermal power plants. (6 hrs)\n\n\n## UNIT-III\n\nDiesel Power Plants\nIntroduction; Field of use; Outline of diesel electric power plant; Different systems of diesel power plant; Supercharging of diesel engines; Performance of diesel power plant; Advantages and disadvantages of diesel plants over thermal power plants. (4 hrs)\nGas Turbine Plants\nElements of plant; Thermal refinements; Performance of plants; Gas turbine characteristics; Comparison with other plants; Combined steam and gas turbine power plants. (4 hrs)\n\n\n## UNIT-IV\n\nFluctuating Loads on Power Plants\nIntroduction, Load curves, Different terms and definitions, Effects of variable loads on power plant design and operation. (4 hrs) Economic Analysis of Power plants and Tariffs\nCost of electrical energy; Selection of type of generation; selection of generating equipment; performance and operating characteristics of power plants; Load division among generators; Tariffs methods for electrical energy. (4hrs)",
    "course outcomes": "By the end of this education program, the students will be able to:\n- Understand the over view of boilers and power plant cycles.\n- Understanding the operations of steam turbines and steam power plants.\n- Analysis of operations of diesel and gas turbine power plants.\n- Rectify the general challenges in thermal power plants.",
    "reference books": "- Thermal Engineering by Ballaney, Khanna Publisher\n- Thermal Engineering by Domkundar& Arora, Dhanpat Rai\n- Steam Turbine Theory & Practice by Kearton, W.J. Pitman.\n- Power Plant Engineering by Morse\n- Power Plant Engineering by Domkundwar\n- Power Plant Technology by El-Wakil\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-11",
    "course title": "Computer Aided Design",
    "number of credits": "3",
    "prerequisites": "Nil",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To understand 2D & 3D geometric transformation techniques in CAD\n- Develop mathematical models to represent curves and surfaces\n- To understand and generate solid geometries",
    "course content": "## UNIT-I\n\nIntroduction\nIntroduction to CAD/CAM, Historical developments, Industrial look at CAD/CAM, Introduction to CIM, Basics of geometric and solid modeling, explicit, implicit, intrinsic Polar envelope and parametric equations coordinate systems. Torsion, Frenet-Serret formulae. (6 hrs)\nTransformations\nIntroduction, transformation of points and line, 2-D rotation, reflection, scaling and combined transformation, homogeneous coordinates, 3-D scaling, shearing, rotation, reflection and translation, combined transformations orthographic, Axonometric, Oblique and perspective projections. (8 hrs)\n\n\n## UNIT-II\n\nCurves\nAlgebraic and geometric forms, Analytical & Synthetic Curves, tangents and normal, blending functions, re-parametrization, straight lines, conics, cubic splines, bezier curves and B-spline curves; Rational curves, Non-uniform Rational curves, NURBS; Curve manipulation. (10 hrs)\nSurfaces\nAlgebraic and geometric forms, Analytical and Synthetic Surfaces, tangents and twist vectors, normal, blending functions, re-parametrization, sixteen-point form, four curve form, plane surface, ruled surface, surface of revolution, tabulated cylinder, bi-cubic surface, Bezier surface, B-spline surfaces, Coons surface, Blending surface, Offset surface, Triangular patches, Sculptured surfaces, Rational parametric surfaces; surface manipulation. (10 hrs)\n\n\n## UNIT-III\n\nSolids\nSolid models and representation scheme, Fundamentals of Solid Modeling, boundary representation, constructive solid geometry, sweep representation, cell decomposition, spatial occupancy enumeration, Half spaces, Octree Encoding, Pure Primitive Instancing. (6 hrs)",
    "course outcomes": "At the end of the course student will be able to\n- Perform transformations of 2D & 3D objects (such as lines, surfaces and solids)\n- Generate curves and surfaces by developing mathematical models\n- Model components using solid modeling techniques",
    "reference books": "- CAD/CAM by Groover and Zimmer, Prentice Hall\n- CAD/CAM: Theory and Practice by I. Zeid, Tata McGraw Hill\n- Mathematical Elements for Computer Graphics by Rogers & Adams, McGraw Hill.\n- Computer Aided Engineering Design by Anupam Saxena and Birendra Sahay, Springer\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-12",
    "course title": "Mechatronics",
    "number of credits": "3",
    "prerequisites": "Nil",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To understand the basic concepts of mechatronics, digital technology and their applications.\n- To understand the functioning of various types of sensors, transducers and their applications.\n- To understand the concept of pneumatic, hydraulic and mechanical actuation systems.\n- To perceive the functioning of microprocessors, Programmable logic controllers, their architecture, structure and applications.\n- To understand the basics of robotics, robot types, their drive systems and applications.",
    "course content": "## UNIT-I\n\nIntroduction to Mechatronics and its Systems\nEvolution, Scope, Measurement Systems, Control Systems, open and close loop systems, sequential controllers, microprocessor based controllers, mechatronics approach. (5 hrs)\nBasics of Digital Technology\nNumber System, Boolean algebra, Logic Functions, Karnaugh Maps, Timing Diagrams, Flip-Flops, Applications. (5 hrs) UNIT-II\nSensors and transducers\nIntroduction, performance terminology-Displacement, Position and Proximity, Velocity and motion, force, Fluid Pressure-Temperature Sensors-Light Sensors- Selection of Sensors-Signal Processing. (6 hrs) Pneumatic and Hydraulic actuation systems\nActuation systems, Pneumatic and hydraulic systems, directional control valves, pressure control valves, cylinders, process control valves, rotary actuators. (5 hrs)\n\n\n## UNIT-III\n\nMechanical actuation systems\nMechanical systems, types of motion, kinematics chains, cams, gear trains, ratchet and pawl, belt and chain drives, bearings, mechanical aspects of motor selection. (5 hrs)\nMicroprocessor\nIntroduction, Architecture, Pin Configuration, Instruction set, Programming of Microprocessors using 8085 instructions-Interfacing input and output devices- Interfacing D/A converters and A/D converters, Applications, Temperature control, Stepper motor control, Traffic light controller. (6 hrs)\n\n\n## UNIT-IV\n\nProgrammable Logic Controller\nIntroduction, Basic structure, Input/output Processing, Programming, Mnemonics, Timers, Internal relays and counters, Data handling, Analog Input/output, Selection of a PLC. (4 hrs)\nRobotics\nIntroduction, types of robots, Robotic control, Robot drive systems Robot end effectors, selection parameters of a robot, applications. (4 hrs)",
    "course outcomes": "At the end of the course student will be able to\n- Understand the basic concepts of mechatronics, digital technology and their applications.\n- Understand the functioning of various types of sensors, transducers and their applications.\n- Understand the concept of pneumatic, hydraulic and mechanical actuation systems.\n- Perceive the functioning of microprocessors, Programmable logic controllers, their architecture, structure and applications.\n- Understand the basics of robotics, robot types, their drive systems and applications.",
    "reference books": "- Bolton W., “Mechatronics”, Longman, Second Edition, 2004.\n- Histand Michael B. and Alciatore David G., “Introduction to Mechatronics and Measurement Systems”, McGraw Hill International Editions, 2003.\n- Kamm, M.L.J., Mechatronics, Prentice Hall of India, New Delhi (2007).\n- HMT Ltd., “Mechatronics”, Tata McGraw Hill Publishing Co. Ltd., 1998.\n- NitaigourPremchandMahalik, “Mechatronics Principles, Concepts and Applications”, Tata McGraw-Hill publishing company Ltd, 2003.\n- Auslander, D. M. and Kempf, C. J., Mechatronics: Mechanical System Interfacing, Prentice Hall, New Jersy (1996).\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-13",
    "course title": "Nuclear Engineering",
    "number of credits": "3",
    "prerequisites": "PHIR-11/12",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To be able to understand the concepts of neutron physics and various nuclear Processes involved in Nuclear Power Plants.\n- To be able to calculate heat generation from nuclear reaction.\n- To be able to design and analyze the performance of nuclear power plants.\n- To get acquainted with applications of radioactivity.\n- To be able to appreciate the hazards associated with radioactivity and the necessity of waste disposal.",
    "course content": "## UNIT-I\n\nConcepts of Nuclear Physics\nThe atom, structure, the nucleus, nuclear structure, atomic transmutation of elements, detection of radio-activity, particle accelerator, decay, natural of elements, nucleus interactions, decay rates, half-life, transuranic elements. (6 hrs) Neutorn Interaction\nAdvantages of using neutron, neutron moderation, fission chain reaction, thermalisation of neutrons, fast neutrons, prompt and delayed neutrons, fission products. (4 hrs)\n\n\n## UNIT-II\n\nEnergy Release\nMass energy equivalence, mass defect, binding energy, energy release in fission & fusion, thermonuclear reaction, fusion bomb. (4 hrs) Reactor Materials\nFissile & fertile materials, cladding & shielding materials, moderators, coolants.\n(4 hrs)\n\n\n## UNIT-III\n\nReactor Technology\nBasic principles, fuel assembly, neutron balance, reactor kinetics, reactor coefficients, reactor stability, excess reactivity, Xenon poisoning, burnable absorbers, reactivity control, heat balance, production& transfer of heat to the coolant, structural considerations. (10 hrs) UNIT-IV\nNuclear Reactors\nTypes of nuclear reactors, pressurized water reactors, boiling water reactors, CANDU type reactors, gas cooled & liquid metal cooled reactors, fast breeder reactors. (6 hrs)\nSafety Considerations & Waste Disposal\nHazards, plant site selection, safety measures incorporated in; plant design, accident control, disposal of nuclear waste. (4 hrs)\nHealth Physics & Radio-isotopes\nRadiation: units, hazards, prevention, preparation of radio-isotopes & their use in medicine, agriculture & industry. (2 hrs)",
    "course outcomes": "At the end of the course student will be able to\n- Understand the concepts of neutron physics and various nuclear Processes involved in Nuclear Power Plants.\n- Calculate heat generation from nuclear reaction.\n- Design and analyze the performance of nuclear power plants.\n- Get acquainted with applications of radioactivity.\n- Appreciate the hazards associated with radioactivity and the necessity of waste disposal.",
    "reference books": "- M. M. El-Wakel, Nuclear Power Engineering, McGraw Hill\n- Shultis and Faw, Fundamentals of Nuclear Science and Engineering, CRC Press\n- Stephenson, Introduction to Nuclear Engineering, McGraw Hill\n- Murray, Nuclear Energy, Butterworth-Heinemann\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-14",
    "course title": "Introduction to MATLAB Programming",
    "number of credits": "3",
    "prerequisites": "-",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- Become familiar with the main features of the MATLAB integrated design environment and its user interfaces\n- Understand the MATLAB Desktop, Command window and the Graph Window.\n- Able to do simple and complex calculation using MATLAB.\n- Able to understand how to automate commands with scripts ,\n- To Increase automation by encapsulating modular tasks as user-defined functions.\n- Understand the tools that are essential in solving engineering problems",
    "course content": "## UNIT-I\n\nIntroduction to MATLAB, MATLAB Windows, Variables, Keywords, Special variables, Managing the workspace, Complex Numbers, Number display formats, Mathematical functions, MATLAB search path, Script M-File use, Use of Special functions-disp, input, pause, wait for button press, Comments, Block comments, punctuation and aborting execution, Simple arrays, Array addressing, Array construction, array orientation,, scalar-array mathematics, array-array mathematics, standard arrays, array manipulation, array sorting, sub array searching, array manipulation functions, array size, multidimensional arrays.\n(8hrs)\n\n\n## UNIT-II\n\nNumeric Data types- integer data types, floating point data types, cell array creation, cell array manipulation, retrieving cell array content, cell functions, structure creation, structure manipulation, retrieving structure content, structure functions, Relational operators, logical operators, operator precedence, relational and logical functions (9hrs)\n\n\n## UNIT-III\n\nControl flow-for loops, While loops, if-Else-End, Switch-Case, Try-Catch block.\n(9hrs)\n\n\n## UNIT -IV\n\nM-FILE function construction rules, input and output arguments, nested functions, Function handles and anonymous functions (7hrs)\n\n\n## UNIT - V\n\nTwo dimensional graphics- The plot function, Line style, Markers, Colors, plot grids, axes box and labels, Customizing plot axes, Multiple plots, Multiple figures, Subplots, Interactive plotting tools, Specialized 2D plots, Three- Dimensional graphics- Line plots, Scalar functions of two variables, Mesh plots, Surface plots,\nContour plots, How to do Debugging in MATLAB, Native data files, directory management (7hrs)",
    "course outcomes": "- Student will be able to generate matrix and manipulate matrix\n- Student will be able to use cell and structures\n- Student will be able to use control flow statements\n- Student will be able to write script file\n- Students will be able to use functions\n- Students will be able to plot 2-D and 3-D graphs",
    "reference books": "- Mastering MATLAB 7 BY Duane Hanselman, Bruce Lttle field\n- MATLAB Programming for Engineersby Stephen J. Chapman\n- Introduction to MATLAB for Engineers by William J. Palm III\n- A Guide to MATLAB: For Beginners and Experienced Users by Brian R. Hunt\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-15",
    "course title": "Engineering Economy",
    "number of credits": "03",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "This course emphasizes the strong correlation between engineering design and manufacturing of products/systems and the economic issues they involve. The following learning objectives are to be achieved-\n- The basic concepts of the time value of money and economic equivalence\n- To incorporate different cash flows, the cost of funds, capital, operational and maintenance costs, salvage value, depreciation, amortization, and taxation in the economic analysis of engineering projects\n- To apply different economic analysis methods – like present worth, annual- equivalent worth, rate-of-return, life-cycle cost etc in evaluation of the economic viability of a project\n- To enable the students to make replacement decisions, capital-budgeting decisions, and evaluate project risk and uncertainty.",
    "course content": "Introduction:\n\n\n## UNIT-I\n\nNature and purpose of engineering economy studies, functions of engineering economy, physical and economic laws, consumer and producer goods. (4hrs) Interest and Annuity Relationships:\nProductivity of capital, nominal and effective interest, interest factors, CAF, PWF, SPWF, SCAF, SFF, and CRF, deferred annuities, perpetuities and capitalized cost, equivalence, gradient factors, GPWF and GUSF. (6hrs)\n\n\n## UNIT-II\n\nDepreciation:\nClassification of depreciation, methods of computing depreciation, economic life and mortality data, capital recovery and return. (6hrs) Industrial Costing:\nClassification of costs: Direct material, direct labour and overheads, fixed and variable cost, semi-fixed cost, increment, differential and marginal cost, sunk cost and its reasons, direct and indirect cost, prime cost, factory cost, production cost and total cost. (6hrs)\n\n\n## UNIT-III\n\nCost Analysis:\nBreak-even analysis, two and three alternatives, graphical solution, break-even charts, effects of changes in fixed and variable cost, minimum cost analysis, economic order quantity, effect of risk and uncertainty on lot size. (4hrs) Replacement Studies:\nReason of replacement, evaluation of proposals, replacement because of inadequacy, excessive maintenance, declining efficiency, obsolescence, MAPI formula. (6hrs)\n\n\n## UNIT-IV\n\nCost Estimation:\nDifference between cost estimation and cost accounting, qualifications of an estimator, estimating procedure, estimate of material cost and labour cost, estimate of cost in machining, forging, welding and foundry operations. (6hrs) Economy Study Patterns:\nBasic economy study patterns and their comparison, effect of taxation on economic studies. (4hrs)",
    "course outcomes": "The course is targeted at enabling the students to-\n- Apply the appropriate engineering economics analysis method(s) for problem solving: present worth, annual cost, rate-of-return, payback, break-even, benefit-cost ratio.\n- Evaluate the cost effectiveness of individual engineering projects using the methods learned and draw inferences for the investment decisions.\n- Compare the life cycle cost of multiple projects using the methods learned, and make a quantitative decision between alternate facilities and/or systems.\n- Compute the depreciation of an asset using standard depreciation techniques to assess its impact on present worth.",
    "reference books": "- Leland Blank, Anthony Tarquin; Engineering Economy, McGrawhill Education (India), New Delhi, 2017.ISBN13: 978-1-25-902740-6\n- William G. Sullivan, C. Patrick Koelling; Engineering Economy, Pearson Education (Asia), 2017.\n- Grant, E.L., Grant, W., and Leavenworth, R.S., Principles of Engineering Economy, John Wiley & Sons, 2015.\n- Eschenbach , T.G., Engineering Economy by Applying Theory to Practice, Oxford University Press, 3rd edition, ISBN-13: 978-0199772766\n…..………………….………………………………………………………………………..\nB.Tech (Mechanical Engineering) 5th Semester\nB.Tech (Mechanical Engineering) 5th Semester Programme Electives (PE)"
  },
  {
    "course code": "MEPC-22",
    "course title": "Production Technology – II",
    "number of credits": "4",
    "prerequisites": "Manufacturing Processes (MEPC 11) Production Technology-I (MEPC-18)",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To understand the mode of metal removal in various unconventional machining processes like USM, EDM, ECM, etc\n- To understand the working of Capstan and Turret Lathes\n- To understand the process of gear generation and gear finishing methods\n- To understand the classification of presses and dies\n- To understand the concepts of jigs and fixtures\n- To understand the theory of wire drawing, extrusion and forging processes",
    "course content": "## UNIT- I\n\nUnconventional Machining Processes\nNeed for unconventional processes, Ultrasonic machining, Electric discharge machining, Electrochemical machining, Electrochemical grinding, Laser beam machining, Electron beam machining – their mechanism of metal removal, process parameters, advantages, limitations and applications. (8 hrs)\n\n\n## UNIT- II\n\nCapstan and Turret Lathe\nLimitations of a center lathe, Introduction to Capstan and Turret lathe, Universal Bar equipment, tool layout for simple parts. (4 hrs) Gear Manufacturing\nClassification of gear production methods, gear generation – gear hobbing, gear shaping, gear finishing methods – shaving, burnishing, grinding, lapping, honing.\n(5 hrs)\n\n\n## UNIT-III\n\nPress Working Tools\nIntroduction, classification of presses, shearing action, cutting forces, clearance and its effect, shear, angular clearance, stripper, Types of dies – Progressive, compound and combination, center line of pressure and its mathematical calculation. (7 hrs)\nJigs and Fixtures\nIntroduction, difference between jig and fixture, principles of location, locating and clamping devices, Jig bushes, Milling fixtures, Turning fixtures, Different Materials for jigs and fixtures, Economics of Jigs and Fixtures. (6 hrs)\n\n\n## UNIT- IV\n\nMetal Forming\nMetal flow condition, plasticity conditions for plain strain, Friction conditions in metal working, Analysis of forming processes wire drawing , extrusion of circular rods, Theory of forging for plates. (8 hrs)",
    "course outcomes": "At the end of the course student will be able to know\n- Mechanisms of material removal in different advanced machining processes like USM, EDM, ECM, etc\n- Difference between capstan and turret lathe along with tool layout for turrets\n- Gear hobbing and gear shaping processes along with the various methods of finishing hardened and unhardened gears\n- Detailed classification of presses and dies along with the steps involved for mathematical calculation of centre of pressure\n- Principles of location, locating and clamping devices and different types of jigs and fixtures used for drilling, milling, etc\n- Theory of various metal forming processes like wire drawing, extrusion and forging along with power consumption requirements for accomplishments of the processes",
    "reference books": "- Modern Machining Processes by Pandey & Shan, Tata – Mc Graw Hill\n- Advanced Machining Processes by V. K. Jain, Allied Publishers Pvt. Ltd.\n- Manufacturing Science by Ghosh & Mallick, Affiliated East West Press.\n- Tool Design by Donaldson, Mc Graw Hill\n- Manufacturing Technology:by P.N. Rao, Tata Mc Graw Hill Metal Cutting Principles by Milton C. Shaw, MIT Press, Cambridge\n- Production Engineering Science by P. C. Pandey and C. K. Singh, Standard Publishers\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-23",
    "course title": "Machine Design – II",
    "number of credits": "4",
    "prerequisites": "",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To understand the design process of different types of gears, gear box, different types of belt drives, chain drive, rope drive and their applications in industry.\n- To understand the utility and design process of different types of cluches, brakes and springs used in automotive industry.\n- To understand the process of design for various types of bearings and crane hook.\n- To understand the design process of I.C. engine components like cylinder, piston, crankshaft, connecting rod, valve gear mechanism and flywheels.",
    "course content": "- Design of spur, helical, bevel and worm gears, gear box design including housing. (6 hrs)\n- Design of flat and V - belt, chain drive, Wire ropes and Sheaves. (4 hrs)\n- Design of single and multiple plate and cone clutches, centrifugal clutch\n(4 hrs)\n- Design of brakes, Energy absorbed by brake, Heat dissipation during braking, External and internal shoe type and disk type. (4 hrs)\n- Design of Coil and leaf springs. (3 hrs)\n- Design of various hydro-dynamically lubricated bearings. (4 hrs)\n- Selection of rolling contact bearings. (3 hrs)\n- Design of cam and follower mechanism. (3 hrs)\n- Design of cylinder, piston, crankshaft, connecting rod and valve gear mechanism for I.C. Engine. (5 hrs)\n- Design of Crane hook. (2 hrs)\n- Design of flywheels. (2 hrs)\nNote: Prepare the drawing sheets for above problems based on your calculated dimensions.",
    "course outcomes": "At the end of the course student will be able to\n- Understand the design process of different types of gears, gear box, different types of belt drives, chain drive, rope drive and their applications in industry.\n- Understand the utility and design process of different types of cluches, brakes and springs used in automotive industry.\n- Understand the process of design for various types of bearings and crane hook.\n- Understand the design process of I.C. engine components like cylinder, piston, crankshaft, connecting rod, valve gear mechanism and flywheels.",
    "reference books": "- Design of Machine Elements by Bhandari, Tata McGraw-Hill\n- Machine Design by Maleev and Hartmann, CBS Public.\n- Machine Design by Sharma and Aggarwal, Kaston Publc.\n- PSG Design data book by PSG Publication, Coimbtore\n- Machine Design – An Integrated Approach by Robert L. Norton, Prentice- Hall Inc.\n- Fundamentals of Machine Component Design by R.C. Juvinall, John Wiley & Sons\n- Machine design data book by V.B.Bhandari\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-24",
    "course title": "Material Science",
    "number of credits": "4",
    "prerequisites": "",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To understand and distinguish between the various mechanisms of plastic deformation and apply this knowledge to explain ductility\n- To explain the mechanism of work hardening and other strengthening processes and apply this knowledge for hardening the materials\n- To apply the concepts of failure analysis to identify the mode of failure (ductile/brittle fracture, fatigue or creep) and suggest design measures for the prevention of failure\n- To find out the number of phases, their compositions and mass fractions using the phase diagrams of binary isomorphous, eutectic and iron-iron carbide systems\n- To explain and suggest heat treatment techniques to improve the mechanical properties of various types of steel\n- To suggest the use of ceramics as engineering materials in accordance with the application",
    "course content": "Plastic Deformation\n\n\n## UNIT-I\n\nTypes of defects in crystals- point, line and surface defects, deformation by slip, slip planes, twinning, mechanical and annealing twins, dislocation- edge and screw dislocation, critical resolved shear stress, dislocation loop, energy of dislocation, force on dislocation, stress field around dislocation, dislocation motion, perfect, extended and sessile dislocation, jogs, dislocation density, Frank Read source, dislocation pile-up, interaction between dislocation and vacancies.\n(6 hrs)\n\n\n## UNIT-II\n\nWork Hardening\nWork hardening of single crystal and polycrystalline materials, mechanism of work hardening, work softening, Bauschinger’s effect, grain boundaries, its effect on crystal and on strength, grain size, low angle grain boundaries, polygonization, solid solution hardening, yield point phenomenon, strain aging, dispersion of second phase particles, preferred orientation, recovery and its mechanisms, recrystallization - mechanisms and laws, grain growth, hot working and cold working and their effects on mechanical properties. (6 hrs) Fracture and Creep\nIntroduction, types fracture, theoretical cohesive strength of metals, Griffith's theory of brittle fracture and its modification, stages in development of ductile fracture, methods of fracture protection, creep test, creep curve, creep curve\nequations, creep curve at constant temperature, stress- rupture test, effects of metallurgical variables on creep, creep mechanisms. (6 hrs)\n\n\n## UNIT-III\n\nFatigue of Metals\nIntroduction, factors to cause fatigue failure, stress cycles, S-N curve, fatigue test, theories of fatigue-Orowan theory, fatigue limit theory, Wood's theory and dislocation movement theory, effect of stress concentration on fatigue, size effects, corrosion fatigue, fretting, low temperature and high temperature fatigue.\n(6 hrs)\nPhase Diagrams\nIntroduction, plotting of binary diagram, equilibrium cooling of an alloy, solid solutions, eutectic, eutectoid and peritectic systems, Iron-Iron carbide (Iron Carbon)equilibrium diagram- various phases present, various reactions involved, critical points, explanation of Iron Carbon diagram; phase rule. (4 hrs)\n\n\n## UNIT-IV\n\nHeat Treatment\nTTT diagram, pearlite transformation and bainite transformation, continuous cooling and TTT diagram- transformation of austenite, factors affecting critical cooling rate, heat treatment processes- annealing, normalizing, spheroidizing, hardening and tempering, austempering, martempering, precipitation hardening, case hardening- carburising, nitriding, cyaniding, flame hardening, induction hardening. (6 hrs)\nCeramics and Powder Metallurgy\nClassification of ceramic materials, ceramic and non- ceramic materials, mechanical and magnetic properties of ceramics, classification and properties of composite materials, whiskers and whisker composites, various methods of preparations of raw powders, blending, compacting, sintering, finishing operations-sizing, impregnation, infiltration, advantages and disadvantages, typical applications of powder metallurgy. (6 hrs)",
    "course outcomes": "Upon completion of this course, student would be able to\n- Understand and distinguish between the various mechanisms of plastic deformation and apply this knowledge to explain ductility\n- Explain the mechanism of work hardening and other strengthening processes and apply this knowledge for hardening the materials\n- Apply the concepts of failure analysis to identify the mode of failure (ductile/brittle fracture, fatigue or creep) and suggest design measures for the prevention of failure\n- Find out the number of phases, their compositions and mass fractions using the phase diagrams of binary isomorphous, eutectic and iron-iron carbide systems\n- Explain and suggest heat treatment techniques to improve the mechanical properties of various types of steel\n- Suggest the use of ceramics as engineering materials in accordance with the application",
    "reference books": "- Material Science and Engineering - V. Raghavan, Prentice Hall\n- Materials Science and Engineering An Introduction - W.D. Callister, John Wiley\n- Mechanical Behaviour of Materials - McClontock& Argon, Addison-Wesley\n- Mechanical Behaviour of Materials - Courtney, McGraw-Hill\n- Mechanical Metallurgy-Dieter\n- Introduction to Elastic Wave Propagation' by A. Bedford & D. S. Drumheller\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-25",
    "course title": "Internal Combustion Engines and Gas Turbines",
    "number of credits": "4",
    "prerequisites": "",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To make students familiar with the design and operating characteristics of modern internal combustion engines.\n- To apply analytical techniques to the engineering problems and performance analysis of internal combustion engines.\n- To study combustion, heat transfer, friction and other factors affecting engine power, efficiency and emissions.\n- To describe the effects of transient operations of vehicle on emissions and types of emissions.\n- To make students familiar with the practical importance of contemporary engines.",
    "course content": "Introduction\n\n\n## UNIT-I\n\nInternal & external combustion engines; classification, cycle of operation in four stroke and two stroke I.C. Engines and Valve timings .Wankel Engine. (3 hrs) Air Standard Cycles\nAssumptions made in air standard cycles, Otto cycle, Diesel cycle, Dual cycle; comparison of these cycles; Sterling and Ericsson cycles; Air standard efficiency; specific work output, work ratio & mean effective pressure, Deviation of actual cycle from ideal cycle. (3 hrs)\n\n\n## UNIT-II\n\nCombustion in I.C. Engines\nSI engines: Ignition Limits, stages of combustion, Effect of engine variables on Ignition Lag and flame-propagation, abnormal combustion, Detonation, Effect of Engine variables on detonation, Pre-ignition, Octane rating of fuels, SI engine combustion chambers. CI engine: stages of combustion, Delay period, variables affecting delay period, Diesel knock, Cetane rating, CI engine combustion chambers. (5 hrs)\nCarburetion, Fuel Injection & Ignition systems\nMixture requirements for various operating conditions in SI engines: Elementary carburetor, Calculation of A/F ratio, The complete carburetor. Diesel injection systems: requirements, types, petrol, injection. Requirements of ignition systems, types of ignition systems, ignition timing, spark plug. (5 hrs)\n\n\n## UNIT-III\n\nLubrication and Cooling\nTotal engine friction, Function of the lubrication systems, properties of lubricating oil, rating of oils, Lubrication systems, engine performance & lubrication. Necessity of engine cooling, Cooling systems, Water cooling, air cooling, Radiators. (5 hrs)\nEngine Testing & Performance\nPerformance parameters, BHP, IHP, Mechanical efficiency, B M E P, I M E P, torque, volumetric efficiency B S F C And I S F C , thermal efficiency, Heat balance, Basic engine measurements: fuel and air consumption, brake power, indicated power and friction power, performance curves. (5 hrs)\n\n\n## UNIT-IV\n\nAir Pollution and its Control\nSources and classification of air pollution, Effect on human health, pollutants from IC engines, methods of emission control, Alternative fuels, current scenario on the pollution front. (5 hrs)\nAir compressors\nSingle stage reciprocating air compressors, work input, volumetric efficiency, isothermal efficiency, Advantages of multi stage compression, Two stage compressor with inter cooling, optimum pressure ratio. Rotary air compressors and their applications. (5 hrs)\nGas Turbines\nBrayton cycle, components of a gas turbine plant, open and closed type, optimum pressure ratio, Improvements upon the basic cycle, multi stage compression with inter cooling, multi stage expansion with reheating, Regeneration, Applications of gas turbines. (4 hrs)",
    "course outcomes": "- Students will be able to differentiate among different internal combustion engine designs.\n- Students will be able to recognize and understand reasons for differences among operating characteristics of different engine types and designs.\n- Students will be able to predict performance and fuel economy trends with given engine design specifications.\n- Students will be able to to understand the effects of transient operations of vehicle on emissions and types of emissions.\n- Students will be able to perform various tests on single cylinder and multi- cylinder SI and CI engines.",
    "reference books": "- Internal Combustion Engines by Obert E.F.\n- Internal Combustion Engines by Mathur& Sharma, DhanpatRai.\n- Internal Combustion Engines by Gill, Smith &Zuriys, IBH\n- Internal Combustion Engines by Ganesan V, TMH\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-18",
    "course title": "Industrial Engineering (Practical)",
    "number of credits": "01",
    "prerequisites": "NIL",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "The objectives of the course are\n- To draw various Control Charts (p, 𝑋 and R chart) and understand their applications.\n- To develop the understanding of basic concepts of various plant layouts and suggest improvements in existing Machine Shop Layout.\n- To analyze the requirements of a newly established industry and draw its basic organization structure.\n- To develop the basic understanding of Inventory Control Management through case study on ABC/VED analysis.\n- To develop the complete understanding of organization structure of purchase department and analyze various purchase procedure.\n- To develop the understanding of various Quality Improvements Tools & Techniques.\n- To draw a Flow Process Chart and understand its concept, importance and applications.",
    "course content": "- To draw p chart for given product lot and to verify its acceptance.\n- To draw 𝑋 and R chart for a given sample of product to check their acceptance.\n- To study various plant layouts and suggest improvements in existing Machine shop Layout.\n- To study and draw organization structure of newly established industry to suggest changes.\n- A case study on ABC/VED analysis.\n- To study various purchase procedures & draw organization structure of purchase department.\n- A case study on quality Improvement Technique.\n- To draw a Flow Process Chart with time estimates for a simple welding process.",
    "course outcomes": "At the end of the course, the students will be able to\n- Draw various Control Charts (p, 𝑋 and R chart) and understand their applications.\n- Develop the understanding of basic concepts of various plant layouts and suggest improvements in existing Machine Shop Layout.\n- Analyze the requirements of a newly established industry and draw its basic organization structure.\n- Develop the basic understanding of Inventory Control Management through case study on ABC/VED analysis.\n- Develop the complete understanding of organization structure of purchase department and analyze various purchase procedure.\n- Develop the understanding of various Quality Improvements Tools & Techniques.\n- Draw a Flow Process Chart and understand its concept, importance and applications.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-19",
    "course title": "Production Technology – II (Practical)",
    "number of credits": "01",
    "prerequisites": "MEPC-22",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "The prime objectives of this course are:\n- Make students to perform different machining operations of varying shapes on lathe.\n- To understand the effect of various input parameters on the machining properties of the material.\n- To make the students familiar with different type of arc welding process and understand the difference among them.\n- To determine the properties of molding sand like hardness, permeability, grain fineness using various testing methods.",
    "course content": "- To perform various operations like drilling, boring, taper turning, thread cutting, knurling on a given work piece using lathe machine.\n- To prepare a gear blank of given dimension on lathe machine.\n- To cut spur gear teeth on milling machine.\n- To study various welding processes like MIG, TIG, submerged arc welding processes.\n- To find the molding hardness testing.\n- How to calculate the quantity of sand required for 100 boxes of dimensions given as 15”*18”*6”.\n- To determine the permeability no. of green sand and dry sand.\n- Performing grain fineness and distribution test for foundry sand.",
    "course outcomes": "At the end of the course, students would be able to\n- Smoothly perform various machining operations on different shapes of jobson lathe and milling machines.\n- Understand the gear manufacturing process on milling machine.\n- Understand and differentiate among the various arc welding processes used in industry.\n- Understand various testing methods and techniques for different mechanical properties of molding sand.\n- Demonstrate the ability to prepare lab reports.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-20",
    "course title": "Internal Combustion Engines and Gas Turbines (Practical)",
    "number of credits": "1",
    "prerequisites": "",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "The objective of course is\n- To understand the performance of I C Engine.\n- To analyze the various parameters related to I C Engine.\n- To study boiler operations.\n- To study the fuel system of engine.",
    "course content": "- To make a trial on single cylinder 4 –stroke Diesel Engine to calculate B.H.P., S.F.C. and to draw its characteristics curves.\n- To make a trial on 4- stroke high – speed diesel engine and to draw its Heat Balance Sheet.\n- To make a trial on Wiley’s jeep Engine at constant speed to calculate B.H.P., S.F.C., thermal efficiency and to draw its characteristic Curves.\n- To make Morse Test to calculate IHP of the multi cylinder petrol engine and to determine its mechanical efficiency.\n- To study Boiler and its components.\n- To study the following models:\n\n\n\nGas Turbine\n\n\nWankel Engine\n- Gas Turbine\n- Wankel Engine\n- To study\n\n\n\nVariable compression ignition Engine.\n\n\nBraking system of automobile in the Lab.\n- Variable compression ignition Engine.\n- Braking system of automobile in the Lab.\n- To study a Carburetor.\n- To study\n\n\n\nFuel Injection System of a C.I. Engine\n\n\nBattery ignition system of S.I. Engine\n- Fuel Injection System of a C.I. Engine\n- Battery ignition system of S.I. Engine\n- To study multi-cylinder four strokes vertical Diesel Engine test RIG with Hydraulic Dynamometer.",
    "course outcomes": "- By the end of this education program, the students will be able to:\n- To calculate various performance parameters related to I C Engine.\n- To draw the heat balance sheet of Engine.\n- Understand the performance of Variable compression Engine.\n- To make trial run of Engine and recording reading from the measuring instruments to evaluate performance.\nReference:\n- Thermal Engineering by r.k.rajput 7th edition book\n- An Introduction to Thermodynamics, Y.V.C. Rao, University Press (India) Private Limited, Revised Edition, 2004).\n- Thermodynamics: an Engineering Approach, Y.A.Cengal and M.A.Boles, McGraw Hill (Fifth edition).\n- Fundamentals of Classical Thermodynamics, G.VanWylen, R.Sonntag and C.Borgnakke, John Willey & Sons (Fourth edition).\n- NPTEL Videos courses of Basic and Applied Thermodynamics (https://nptel.ac.in/course.php)\n- Edx Videos courses of Thermodynamics (https://courses.edx.org/courses/ coursev1:IITBombayX+ME209.1x+1T2017 /course/)\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-16",
    "course title": "Industrial Engineering",
    "number of credits": "3",
    "prerequisites": "",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To make students aware on the concept of industrial Engineering and various Organization systems.\n- To impart knowledge about production systems and Sales Forecasting methods.\n- To make students aware on production planning methods.\n- To enable students to learn about Inventory control and material handling.",
    "course content": "## UNIT-I\n\nIntroduction to Industrial Engineering\nDefinition, Techniques of Industrial Engineering, Origin & Development of Factory System, Pioneers of Scientific Management, Concept of Productivity. (5 hrs) Factory Organization\nPrinciples of Organization, Importance and Characteristics of Organization, Types of Organization-Military or Line Organization, Functional Organization, Line and Staff Organization, Committees Organization. (4 hrs)\n\n\n## UNIT-II\n\nIndustrial Production Systems\nClassification of Production Systems, Introduction to Flexible Manufacturing System. (4 hrs)\nSales Forecasting\nIntroduction, Objectives and Importance of Sales Forecasting, Collective Opinion Method, Economic Indicator Method, Regression Analysis, Moving Average Method, Time Series Analysis, Break Even Analysis, Numerical Problems. (6 hrs)\n\n\n## UNIT-III\n\nProduction Planning and Control\nObjectives of PPC, Functions of PPC, Preplanning and Planning, Routing, Estimating, Scheduling – Master Schedule, Daily Schedule, Gantt chart, Dispatching-Centralized v/s. Decentralized, Control and Progress Reporting.\n(6 hrs)\nMaterial Requirement Planning\nIntroduction to Material Requirement Planning (MRP), Capacity Requirement Planning (CRP) Enterprise Resource Planning (ERP): Objectives and Functions.\n(5 hrs)\n\n\n## UNIT-IV\n\nInventory Control\nIntroduction, Types of Inventory, Inventory Control Importance and Functions, Inventory Costs, Factors Affecting Inventory Control, Just in Time (JIT)\nManufacturing, Various Inventory Control Models, ABC Analysis, Numerical Problems. (6 hrs)\nMaterials Handling\nObjectives, Functions & Principle of Material Handling, Methods, Introduction to Concept of Palletization, Unit Load Concept and Automated Guided Vehicle (AGV) System. (4 hrs)",
    "course outcomes": "- Students will be able to understand the Basic Concepts of Industrial Engineering as well\n- as the organization structures of Industry.\n- Students will be able To Understand the Various Production Systems and Sale\n- Forecasting Methods.\n- Students will be able To Understand the Importance of Planning in the Industry\n- About Everything at Every Stage of Production.\n- Students will be able to know the Importance of Inventory Control and Material Handling systems.",
    "reference books": "- Production Planning and Control by S. Eilon\n- Industrial Engineering and Production management by Martland T Telsang Publication S. chand\n- Production and operations management by S.N.Chary Publication Tata Mc Graw Hill (TMH)\n- Modern Production Management by S.S. Buffa Publication Wiley\n- Industrial Engineering and Operation Research by S.K. Sharma & Savita Sharma Publication Kataria & sons\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-17",
    "course title": "Tribology",
    "number of credits": "3",
    "prerequisites": "",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To develop an understanding of tribology, surface topography and the importance of tribology in engineering\n- To understand the basic laws and theories of friction and wear along with measurement techniques\n- To understand the types and properties of lubricants\n- To gain knowledge regarding the mathematical equation governing the\nperformance of various bearings and other transmission components",
    "course content": "S:\nIntroduction\n\n\n## UNIT-I\n\nIntroduction to tribological systems and their characteristic features, Analysis and assessment of surface topography, deterministic and stochastic tribo-models for asperity contacts, techniques of surface examination, tribological properties of surfaces. (6 hrs)\nFriction\nQuantitative laws of sliding friction, causes of friction, adhesion theory, laws of rolling friction, measurement of friction. (7 hrs) UNIT-II\nWear\nIntroduction, mechanism of wear, types of wear, quantitative laws of wear, measurement of wear, wears resistance materials. (7 hrs) Lubrication and Lubricants\nIntroduction, dry friction, boundary lubrication, hydrodynamic, hydrostatic and elasto-hydrodynamic lubrication, functions of lubricants, types and properties of lubricants, lubricant additives, solid lubricants. (7 hrs)\n\n\n## UNIT-III\n\nBearings and Bearing Materials\nGeometry and pressure equation of journal bearing, hydrostatic bearings, thrust bearings, porous bearings and hydrodynamic gas bearings. Journal bearings with specialized applications. General requirements and different types of bearing materials. (7 hrs)\nElasto-hydrodynamic lubrication\nPrinciples, application to rolling contact bearings, cams, gears. (6 hrs)",
    "course outcomes": "- The students will be able to analyse the contact between rough surfaces and determine important tribological characteristics.\n- The students will be able to correlate material properties and other parameters with friction and wear behaviour.\n- The students will be able to select lubricant and evaluate load carrying capacity, friction coefficient etc. for various bearings.\n- The students will be able to explain various aspects related to advanced topics in the area of Tribology.",
    "reference books": "- Principles of Tribology by J. Halling, Macmillan\n- Mechanics and Chemistry in lubrication by Dorinson and Ludema, Elsevier\n- Friction and wear of Materials by E. Robinowicz, John Wiley\n- Principles of Lubrication by A. Cameron, Longmans\n- Introduction to Tribology of Bearings by B.C. Majumdar, S Chand\n- Engineering Tribology by Prasanta Sahoo, PHI\n- Friction and Lubrication by E.P.Bowden and Tabor.D, Heinemann Educational Books Ltd.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-18",
    "course title": "Operations Research",
    "number of credits": "3",
    "prerequisites": "",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To develop an understanding of tribology, surface topography and the importance of tribology in engineering\n- To understand the basic laws and theories of friction and wear along with measurement techniques\n- To understand the types and properties of lubricants\n- To gain knowledge regarding the mathematical equation governing the\nperformance of various bearings and other transmission components",
    "course content": "S:\nIntroduction\n\n\n## UNIT-I\n\nIntroduction to tribological systems and their characteristic features, Analysis and assessment of surface topography, deterministic and stochastic tribo-models for asperity contacts, techniques of surface examination, tribological properties of surfaces. (6 hrs)\nFriction\nQuantitative laws of sliding friction, causes of friction, adhesion theory, laws of rolling friction, measurement of friction. (7 hrs) UNIT-II\nWear\nIntroduction, mechanism of wear, types of wear, quantitative laws of wear, measurement of wear, wears resistance materials. (7 hrs) Lubrication and Lubricants\nIntroduction, dry friction, boundary lubrication, hydrodynamic, hydrostatic and elasto-hydrodynamic lubrication, functions of lubricants, types and properties of lubricants, lubricant additives, solid lubricants. (7 hrs)\n\n\n## UNIT-III\n\nBearings and Bearing Materials\nGeometry and pressure equation of journal bearing, hydrostatic bearings, thrust bearings, porous bearings and hydrodynamic gas bearings. Journal bearings with specialized applications. General requirements and different types of bearing materials. (7 hrs)\nElasto-hydrodynamic lubrication\nPrinciples, application to rolling contact bearings, cams, gears. (6 hrs)",
    "course outcomes": "- The students will be able to analyse the contact between rough surfaces and determine important tribological characteristics.\n- The students will be able to correlate material properties and other parameters with friction and wear behaviour.\n- The students will be able to select lubricant and evaluate load carrying capacity, friction coefficient etc. for various bearings.\n- The students will be able to explain various aspects related to advanced topics in the area of Tribology.",
    "reference books": "- Principles of Tribology by J. Halling, Macmillan\n- Mechanics and Chemistry in lubrication by Dorinson and Ludema, Elsevier\n- Friction and wear of Materials by E. Robinowicz, John Wiley\n- Principles of Lubrication by A. Cameron, Longmans\n- Introduction to Tribology of Bearings by B.C. Majumdar, S Chand\n- Engineering Tribology by Prasanta Sahoo, PHI\n- Friction and Lubrication by E.P.Bowden and Tabor.D, Heinemann Educational Books Ltd.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-19",
    "course title": "Aerodynamics",
    "number of credits": "3.0",
    "prerequisites": "Thermodynamics, Fluid Mechanics",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- General knowledge of the history of aeronautics\n- Understanding the basic physical principles of flight\n- Basic knowledge of aerodynamics/fluid dynamics\n- General understanding of how the design of an aircraft influences the performance",
    "course content": "## UNIT-I\n\nIntroduction (10 hrs)\nIntroduction, Ballooning, the International Standard Atmosphere, How aircraft fly, Cockpits & Navigations, Instruments, Structural concepts, Stability & Control, Paper aircraft. Aircraft and Aerodynamic Forces and Moments, Fluids and Forces in Fluids, Kinematics of fluid motion, speed of sound, Shock Waves Normal & Oblique shock Waves.\n\n\n## UNIT-II\n\nAerodynamics (10 hrs)\nFundamentals of Aerodynamics quantities & equations, Bernoullli’ s principle, Compressibility, Conditions for Incompressibility , Non-dimensional Form of the Equations and Possible Simplifications, High Reynolds Number Approximation Viscous flows, Pressure distributions and flow separation Airfoils, Critical Mach number, Finite wings.\n\n\n## UNIT-III\n\nFlight Mechanics (10 hrs)\nIntroduction to flight mechanics, Horizontal flight performance, Climbing and descending flight envelope, Equations of Motions, Equations of Fluid Motion - Navier - Stokes Equation, Conservation of Energy and Energy Equation, Equations of Motions. Kinematics of fluid motion - Velocity with specified extension and vorticity\n\n\n## UNIT-IV\n\nPropulsion (10 hrs)\nPropulsion, Water Rocket, Materials & Exploring the limits, Special Vehicles. Aircraft Power plant, Fuel system design, design and Manufacturing Standards in Aircraft industry, Performance of Turboprop & Turbofan Engine.",
    "course outcomes": "By the end of this education program, the students will be able to:\n- Understand the basic laws and its concepts\n- Understand the aerodynamics laws and its concepts.\n- Analysis of governing equations for fluid\n- Understand different propulsion, and aircraft power plant system.\nReference:\n- Power Plant Engineering by P.K. Nag, Tata McGraw Hill, Second Edition\n- Introduction to Aerodynamics - Video course by Dr. K.P. Sinhamahapatra Department of Aerospace Engineering IIT Kharagpur (https://nptel.ac.in\n/courses/101105059/).\n- Fundamentals of Propulsion by V.Babu ANE Student Edition, 2009.\n- Introduction to Aeronautical Engineering online course edx by TuDelft university.(https://courses.edx.org/courses/course-v1:DelftX+AE1110x+2T 2018/course/)\n- Gas Dynamics and Propulsion- Video course by Prof. V. Babu Department of Mechanical Engineering IIT Madras (https://nptel.ac.in/courses/112106 166/).\n- Hypersonics – from Shock Waves to Scramjets online course Edx by University of Queensland. (https://courses.edx.org/courses/coursev1:UQx\n+Hypers301x+1T2018/course/)\n- Jet Aircraft Propulsion (Video) by Prof. Bhaskar RoyIIT Bombay (https://nptel\n.ac.in/courses/101101002/37).\n- Aerospace Propulsion by Dr. P.A. RamakrishnaIIT Madras(https://nptel.ac.in/ courses/101106033/4).\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-20",
    "course title": "Renewable Energy Systems",
    "number of credits": "3",
    "prerequisites": "",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To make students aware about different renewable energy resources.\n- To able to understand the conversion of energy from one form to other.\n- To gain knowledge regarding the solar radiation.",
    "course content": "-\n\n\n## UNIT-I\n\nIntroduction\nIntroduction to energy, Relevance of energy in the development of country, conventional, non-conventional and renewable sources of energy. Status of conventional sources of energy and their conservation, Exploring renewable sources of energy. (5hrs)\n\n\n## UNIT-II\n\nSolar Radiation and Applications of Solar Heat\nExtraterrestrial solar radiation, components of radiation, geometry of earth and sun, geometry of collector and the solar beam, effects of earth’s atmosphere, measurements of solar radiation, type of water heaters, selective surfaces, space heating, space cooling, water desalination, solar ponds, solar concentrators, thermos- electric power system, problems. (8hrs) Photovoltaic Generation\nIntroduction, the silicon p-n junction, photon absorption solar radiation input, photovoltaic circuit properties and loads, limits to cell efficiency, solar cell construction, other types of photoelectric and thermo-electric generation. (5hrs)\n\n\n## UNIT-III\n\nHydro and Wind Powers\nPrinciple of hydro power conversion, impulse turbine, reaction turbines, wind turbine types, linear momentum and basic theory, dynamic matching, characteristics of the wind, power extraction by a turbine, electricity generation, mechanical power, problems. (7hrs)\nBio-Fuels\nIntroduction, Bio fuels, classification, bio-mass production for energy farming, direct combustion for heat, pyrolysis (destructive distillation), alcoholic fermentation, anaerobic digestion for bio-gas, agrochemical fuel extractions.(5hrs)\n\n\n## UNIT-IV\n\nWave Energy and Tidal Power\nIntroduction, wave motion, wave energy and power, wave patterns, devices, the causes of tides, enhancement of tides flow power, tidal range, power, world tidal power sites. (5hrs)\nOTEC and Geothermal Energy\nPrinciples of Ocean Thermal Energy Conversion (OTEC), Claude cycle, Andersan cycle, Introduction to geothermal energy, dry rock and hot aquifer analysis, harnessing geothermal resources (6hrs)",
    "course outcomes": "At the end of the course student will be able to understand about energy, its importance and different sources of energy and its conversion into different forms",
    "reference books": "- Renewable Energy Rsources by john W. Twidell and Anthony D. Weir, published by E.& F. N. SponLtd,Lndon.\n- Solar Energy by S P Sukhatme, Publisher Tata Mc Graw- Hill New Delhi\n- Renewable energy by Bent Sorensen by Academic press\n- Non-conventional Energy Sources by G D Rai by Khanna PublishersDelhi\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-21",
    "course title": "Industrial Robotics",
    "number of credits": "3",
    "prerequisites": "Nil",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- The overall objective of this course is to understand the concepts of Robotics\n- To understand Direct and Inverse Kinematics of Robot Manipulator\n- To understand Dynamic modeling of Robot Arm and Control of Manipulators.",
    "course content": "S:\nIntroduction to Robotics\n\n\n## UNIT-I\n\nEvolution of Robots and Robotics, Laws of Robotics, Progressive advancement in Robots. Robot anatomy, Human Arm Characteristics, Design and Control issue, Manipulation and Control, Programming Robots. (3 hrs) Coordinate Frames, Mapping and Transforms\nCoordinate Frames, Description of objects in space, Transformation of Vectors, Inverting a Homogeneous Transform, Fundamental Rotation matrices. (4 hrs)\n\n\n## UNIT-II\n\nDirect Kinematic Model\nMechanical structure and notations, Kinematic modeling of the manipulator, DenavitHartenberg Notation, Manipulator Transformation Matrix. (4 hrs) The Inverse Kinematies\nManipulator workspace, solvability of Inverse kinematics model, solution techniques, closed form solution. (4 hrs)\n\n\n## UNIT-III\n\nManipulator Differential Motion and Statics\nLinear and angular velocity of a rigid body, relationship between transformation matrix and angular velocity, manipulator Jacobian, Jacobian Inverse, Jacobian Singularities, Static Analysis. (5 hrs)\nDynamic Modeling\nLargrangian Mechanies, Two Degree of Freedom manipulator-Dynamic Model, Lagrange-Euler formulation Newton-Euler formulation, Inverse Dynamics. (4 hrs)\n\n\n## UNIT-IV\n\nControl of Manipulators\nOpen and Close loop control, linear control schemes, linear second order SISO model of a manipulator joint. Joint Actuators, Computed Torque Control, force control of Robitics, Manipulators, Hybrid position/force control, Impedance Force/Torque Control. (4 hrs)\nRobotic Sensors\nSensors in Robitcs, classification of Robotic sensors, kinds of sensors used in robotics-Acoustic sensors optic, Pneumatic, force/Torque sensors. (4 hrs) Robot Applications\nIndustrial Applications-Material Handling, Processing Applications, Assembly applications, inspection application, Principles for Robot application and application planning, Robert safety, Non-Industrial Application. (4 hrs) Robert Languages and Programming\nThe Textual Robot Languages, Generations of Robot Programming Languages, Methods of Robot Programming. (4 hrs)",
    "course outcomes": "At the end of course students will be able to:\n- Understand the concepts of Industrial Robotics.\n- Understand the Kinematics and Dynamics analysis of Robot Arm.\n- Understand the Robot applications, Robot language and Programming.",
    "reference books": "- Fundamental of Robotics by Robert J. Sehilling Prentice Hall of India.\n- Introduction to Robotics by SaeedB.NikuPearson Education Asia.\n- Robot Modeling and kinematics by RachidManseur, Luxmi Publications.\n…..………………….………………………………………………………………………..\nB.Tech (Mechanical Engineering) 6th Semester\nOR\nProject Work\nB.Tech (Mechanical Engineering) 7th Semester\nB.Tech (Mechanical Engineering) 7th Semester Programme Electives (PE)"
  },
  {
    "course code": "MEPC-26",
    "course title": "Refrigeration And Air Conditioning",
    "number of credits": "4",
    "prerequisites": "Thermodynamics",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To analyze the refrigeration cycles and method of improving of performance.\n- To familiarize the components of basic refrigeration systems.\n- To understand vapor compression system and vapor absorption system.\n- To design air condition systems using cooling load calculations.\n- To know the applications of refrigeration and air conditioning systems.",
    "course content": "S:\n\n\n## UNIT-I\n\nREFRIGERATION\nIntroduction\nBasics of heat pump & refrigerator, Carnot refrigeration and heat pump, units of refrigeration, COP of refrigerator and heat pump, Carnot COP, Ice refrigeration, evaporative refrigeration, refrigeration by expansion of air, refrigeration by throttling of gas, vapour refrigeration system, steam jet refrigeration, thermo- electric cooling, adiabatic demagnetization. (4 hrs) Air Refrigeration\nBasic Principle of operation of air refrigeration system, Bell Coleman air refrigerator, advantages of using air refrigeration in air craft, disadvantage of air refrigeration in comparison to other cold producing methods, simple air refrigeration in air craft, simple evaporative type, air refrigeration in air craft, necessity of cooling the air craft. (4 hrs)\n\n\n## UNIT-II\n\nSimple Vapour Compression refrigeration System\nSimple vapour compression refrigeration system, different compression processes (wet, dry and saturated Compression, superheated compression), Limitations of vapour compression refrigeration system if used on reverse Carnot cycle, representation of theoretical and actual cycle on T-S and P H charts, effects of operating conditions on the performance of the system, advantages of vapour compression system over air refrigeration system. (4 hrs) Advanced Vapour Compression refrigeration system\nMethods of improving COP, flash chamber, flash inter cooler, optimum inter stage pressure for two stage refrigeration system, single expansion and multi expansion cases, basic introduction of single load and multi load systems, cascade systems.\n(5 hrs)\nVapour absorption refrigeration system and special topics\nBasic absorption system, COP and maximum COP of the absorption system. Actual NH3 absorption system, function of various components, Li-Br absorption system, Selection of refrigerant and absorbent pair in vapour absorption system, Electro-Lux refrigerator, comparison of compression and absorption refrigeration\nsystem, Nomenclature of refrigerants, desirable properties of refrigerants, cold storage and Ice Plants. (4 hrs)\n\n\n## UNIT-III\n\nAIR CONDITIONING\nIntroduction\nDifference between refrigeration and Air Conditioning, Psychrometric properties of moist air (web bulb, dry bulb, dew point temperature, relative and specific humidity temperature of adiabatic saturation), empirical relation to calculate PV of moist air.\n(3 hrs)\nPsyschrometry\nPsychrometry chart, construction and use, mixing of two air streams, sensible heating and cooling, latent heating and cooling, humidification and dehumidification, cooling with dehumidification, cooling with adiabatic humidification, heating and humidification, By- pass factor of coil, sensible heat factor, ADP of cooling coil, Air washer. (4 hrs) UNIT-IV\nAir Conditioning system\nClassification, factors affecting air conditioning systems, comfort air conditioning system, winter air conditioning system, summer Air Conditioning system, year round air conditioning system, unitary air conditioning system, central air conditioning system, Room sensible heat factor, Grand sensible heat factor, effective room sensible heat factor. (5 hrs) Cooling Load calculation\nInside design conditions, comfort conditions, components of cooling load, internal heat gains from (occupancy, lighting, appliances, product and processes), system heat gain (supply air duct, A.C. fan, return air duct), External heat gain (heat gain through building, solar heat gain through outside walls and roofs), sol-air temperature, solar heat gain through glass windows, heat gain due to ventilation and infiltration. (5 hrs)\nIndustrial and commercial application\nTransport air conditioning, evaporative condensers, cooling towers, heat pumps.\n(2 hrs)",
    "course outcomes": "- Students should be able to understand the need and importance of various refrigeration and air conditioning cycles, the typical and some advanced and innovative schematic designs, and the goals of R&AC systems.\n- Students should be able to design the VCRS and VARS with improving performance parameters.\n- Students should be able to describe the working of different types of air conditioning systems.\n- Student should be able to understand the actual applications of R&AC.",
    "reference books": "- Refrigeration and Air Conditioning - C.P. Arora, Tata McGraw-Hill\n- Basic Refrigeration and Air Conditioning- Ananthana and Rayanan, McGraw-Hill\n- Refrigeration and Air Conditioning- Arora and Domkundwar, Dhanpat Rai.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-27",
    "course title": "Quality Control And Reliability",
    "number of credits": "4",
    "prerequisites": "Production Technology-II (MEPC22)",
    "course type": "EPR",
    "branch": "me",
    "course learning objectives": "- To understand the fundamentals of Quality, Economics of Quality and T.Q.M.\n- To understand the basic statistical concepts, decision preparatory of the control charts, their applications and Process Capability Behaviour.\n- To understand the concepts of Acceptance Sampling, Sampling Plans and their applications.\n- To understand the Reliability and its relationship with Availability and Maintainability.",
    "course content": "S:\nIntroduction\n\n\n## UNIT-I\n\nQuality – Basic Concepts: Issues in Quality, factors affecting quality, creating quality by design, product development cycle, economics of quality, Various definitions, ISO definition of quality and its meanings, and various phases till TQM and its meaning to industries, customers and employees, contribution of quality gurus etc. towards quality concepts. Total Quality management: its scope application and implementation. Quality circle: its objectives, structure and techniques, Variability concept in manufacturing –cycle, fishbone diagrams, charts in time philosophy. (8 hrs)\n\n\n## UNIT-II\n\nQuality Control\nBasic statistical concepts, various types of distributions, General theory X and R chart. Decision preparatory to the control charts. Trial control limits. Selection of sub-groups.Charts with variable subgroups. Reject and Revoke, limits for average on X charts, modified control limits, specification limits, practical limitations. Control charts for fraction defectives, calculation and plotting of control limits, sensitivity of p chart, applications, and Control charts for Defects, difference between defect and defective, calculation and plotting of control limits, application. Pi charts and u charts, plotting of charts. Tests for various control charts. Tests for various control charts, process capability- inherent and potential capability.\n(12 hrs)\n\n\n## UNIT- III\n\nAcceptance Sampling\nPurpose, Acceptance by Attributes, single sampling plans.O.C.curve selection of sampling plans, Acceptance number, Type A and Type B errors, O.C. curves, Double sampling plan and its analysis, Multiple and sequential sampling , A.O.Q.L., Acceptance sampling plans under risk. Design of various sampling plans, Dodge- Roming type system for acceptance sampling by attributes (use of\nvarious tables). Determination of process average, Acceptance sampling by variables. (10 hrs)\n\n\n## UNIT- IV\n\nReliability\nConcepts of Reliability, factors affecting Reliability, pattern of Failure, Mean Time to Failure, Fundamental of Statistical Concepts, consideration of Reliability in Series and Parallel System, effect of Redundancy and Reliability, method of Reliability Evaluation, Reliability Optimization, Availability and Maintainability, means to improve Reliability, Reliability Control during manufacture. (10 hrs)",
    "course outcomes": "- Students will be able to understand the fundamentals of Quality, Economics of Quality and T.Q.M.\n- Students will be able to understand the basic statistical concepts, decision preparatory of the control charts their applications and Process Capability Behaviour.\n- Students will be able to understand the concepts of Acceptance Sampling, Sampling Plans and their applications\n- Students will be able to understand the Reliability and its relationship with Availability and Maintainability",
    "reference books": "- Statistical Quality Control by Grant and Leaven, McGraw-Hill.\n- Quality Control and Reliability by Mahajan, Dhanpat Rai.\n- Quality Control by Hansen, Prentice-Hall.\n- Statistical Quality Control, a modern introduction by Douglas C. Montgomery.\n- Elementary Statistical Quality Control, 2nd Edition - CRC Press Book By. John T. Burr.\n- Total Quality Management – An Integrated Approach Paperback – 2016 by DR. Kiran\n- Handbook of Reliability Engineering and Management Book by Clyde F. Coombs Jr. and William Grant Ireson.\n- Practical Reliability Engineering Book by Patrick D. T. O'Connor.\n- Maintenance, Replacement, and Reliability: Theory and Applications, Second Edition.Book by A. K. S. Jardine and Albert H. C. Tsang.\n- Reliability Engineering Book by A.K. Goel.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-28",
    "course title": "Mechanical Vibrations",
    "number of credits": "4",
    "prerequisites": "Engineering Mechanics, Mathematics III",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To learn effects of periodic disturbance due to external excitation; due to rotating and reciprocating unbalance; due to excitation of the support on performance of a Machine.\n- To learn method of vibration analysis of Mechanical Systems.\n- To learn Mathematical Modelling of Mechanical Systems for vibration analysis.\n- To learn methods of Vibration isolation of Mechanical systems under periodic inputs.",
    "course content": "Fundamental of Vibrations\n\n\n## UNIT- I\n\nIntroduction, Definitions, Kinematics of simple vibrating motions, Simple harmonic motions, Vector Method and Complex Method representation of a harmonic motion, Fourier series representation of periodic Inputs, Mathematical Model for Vibration Analysis. (4 hrs)\nFree Vibrations of a Single Degree of Freedom Systems\nDegrees of freedom, equations of motions, general solution of equation of motions, Undamped and Damped free vibrations of Mechanical Systems. (4 hrs)\n\n\n## UNIT- II\n\nForced Vibrations of a Single Degree of Freedom Systems\nUndamped and damped forced vibrations, Transient and Steady state response, Viscous damping, Coulomb damping, Forced vibration – due to external excitation; due to rotating and reciprocating unbalance; due to excitation of the support, Transmissibility and isolation and Vibration measuring Instruments.\n(10 hrs)\n\n\n## UNIT - III\n\nTwo Degrees of Freedom Systems\nUndamped free vibration, principal modes, Damped Free Vibrations, Forced Vibration with Harmonic excitation and Vibration Absorber. (6hrs)\nMulti-Degrees of Freedom Systems\nExact Analysis: Undamped Free Vibrations, Influence Numbers, Undamped Forced Vibration, Generalized Coordinates, Coordinate Coupling, Principal Coordinate. (4hrs)\n\n\n## UNIT - IV\n\nMulti-Degrees of Freedom Systems\nNumerical Methods:Dunkerley’s Method, Method of Matrix iteration, Holzer’s method, Rayleigh’s method, Rayleigh–Ritz method. (6 hrs)\nContinuous Systems\nTransverse vibration of strings, longitudinal vibration of bars, lateral vibration of beams, tensional vibration of circular shafts. (4hrs) Critical speeds of shafts\nCritical speed of Undamped and Damped light shaft having Single Disk. (2 hrs)",
    "course outcomes": "At the end of the course, student will be able to\n- make Mathematical model of a Mechanical system for vibration analysis.\n- write differential equations of motion of the Mathematical model of the Mechanical system for vibration analysis.\n- solve governing equation of motions of the Mechanical systems using Numerical Methods as well as exact analysis.\n- predict response of the Mechanical Systems under periodic inputs.\n- deal with mechanical systems involving vibration isolation and rotating and reciprocating unbalance.",
    "reference books": "- Mechanical vibration by G.K. Grover, Nemchand& Brothers\n- Mechanical vibration by S. S. Rao, Pearson Education\n- Mechanical Vibration by Thomson, Prentice Hall\n- Mechanical Vibration by Den Hartog, McGraw-Hill\n- Introductory course on Mechanical Vibrations by Rao and Gupta, Wiley Eastern\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-21",
    "course title": "Refrigeration & Air-Conditioning Lab",
    "number of credits": "4",
    "prerequisites": "NIL",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "- To provide a fundamentals of refrigeration and air conditioning, Psychrometry.\n- To accustom with various methods of production of cold.\n- To impart knowledge about applications of refrigeration and air conditioning.\n- To familiarize with industrial protocols, regulations in the field.",
    "course content": "S:\n- To study the performance of refrigeration cycle using different expansion devices.\n- To prepare Heat Balance sheet of Refrigeration cycle.\n- To study humidification with heating & dehumidification with cooling.\n- To compare C.O.P. of the refrigeration test rig when working as heat pump refrigerator.\n- To study the constructional details of hermetically sealed reciprocating compressor.\n- To study constructional details of rotary compressor.\n- To study constructional details of thermostatic expansion valve.\n- To study constructional details of automatic expansion valve.\n- To study constructional details of Thermostatic switch.\n- To study High Pressure (HP) and Low Pressure (LP) control devices.\n- To find the ice making capacity of ice plant.\n- To study performance of cooling water.\nLab Course Outcomes:\nAt the end of the lab course student will be able to\n- Study of refrigerant compressors, expansion devices used in vapour compression refrigeration system, thermostat with range and differential setting, charging of refrigeration system.\n- Trial on pilot ice plant to evaluate cycle performance and actual coefficient of performance\n- Participate in a group atmosphere for the understanding of an industrial refrigeration system.\n- Communicate effectively both verbally and in written form through the preparation of journal report and practical presentation.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPC-22",
    "course title": "Mechanical Vibrations(Practical)",
    "number of credits": "01",
    "prerequisites": "Engineering Mechanics, Mechanical Vibrations, Tribology, Measurements",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "The objectives of the course are\n- To develop the understanding of basic concepts of Mechanical Vibrations and Tribology with the help of experiments.\n- To find natural frequency of free and forced vibrations of undamped and damped Mechanical systems for understanding the theoretical concepts of Mechanical Vibrations.\n- To find viscous damping from the response curve of damped free vibrations of a Mechanical System.\n- To develop the understanding of Torsional Vibrations.\n- To verify some of the methods of finding natural frequency of Mechanical Systems.",
    "course content": "S:\n- To study undamped free vibrations of equivalent spring mass system & determine the natural frequency of vibrations.\n- To study the free vibrations of the system for different damper setting. Draw the decay curve and determine the log decrement and damping factor. Find also the natural frequency.\n- To study the torsional vibrations of a single rotor shaft system and to determine the natural frequency.\n- To determine the two frequencies of the torsional spring type double pendulum and compare them with theoretical values.\n- To determine the radius of gyration of given bar by using Bifilar suspension.\n- To verify the Dunkerley’s rule.\n- To study the forced vibrations of the system with damping. Plot magnification factor vs. frequency and phase angle vs. frequency curves. Also, determine the damping factor.\n- To study the pressure distribution of a journal bearing using a journal bearing apparatus.\n- To determine the rate of wear of a metallic plate from the plot of displacement vs. time curve by using friction and wear monitor apparatus.\n- To determine abrasion index of a material with the help of a dry abrasion test rig.\n- To evaluate the load wear index and the weld point of a lubricant with the help of a four-ball extreme pressure tester.",
    "course outcomes": "At the end of the course, the students will be able to:\n- Perform Vibrations and Tribology tests on a Mechanical System.\n- Find inertial properties of a component of machine or Machine itself by performing free vibrations tests.\n- Determine the viscous damping present in a Mechanical system.\n- Understand theoretical concepts of Mechanical Vibrations and Tribology.\n- Analyze the response of the Vibrations Test to understand the theoretical results obtained from Mathematical Modelling of the Mechanical System under periodic input.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-22",
    "course title": "Finite Element Method",
    "number of credits": "3.0",
    "prerequisites": "",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- The students will learn about the modelling of the various engineering problems",
    "course content": "## UNIT-I\n\nIntroduction to Finite Element Method\nBasic Concept, Historical background, Engineering applications, general description, Comparison with other methods.Need for weighted-integral forms, relevant mathematical concepts and formulae, weak formulation of boundary value problems, variational methods, Rayleigh-Ritz method, and weighted residual approach. (10hrs)\n\n\n## UNIT-II\n\nFinite Element Techniques\nModel boundary value problem, finite element discretization, element shapes, sizes and node locations, interpolation functions, derivation of element equations, connectivity, boundary conditions, FEM solution, post-processing, compatibility and completeness requirements, convergence criteria, higher order and isoparametric elements, natural coordinates, Langrange and Hermite polynomials.\n(10hrs)\n\n\n## UNIT-III\n\nApplications To Solid Mechanics Problems\nExternal and internal equilibrium equations, one-dimensional stress-strain relations, plane stress and strain problems, axis-symmetric and three dimensional stress-strain problems, strain displacement relations, boundary conditions, compatibility equations, computer programs. (5hrs)\nApplications To Heat Transfer Problems\nVariational approach, Galerkin approach, one-dimensional and two-dimensional steady-state problems for conduction, convection and radiation, transient problems. (5hrs)\nApplications To Fluid Mechanics Problems\nInviscid incompressible flow, potential function and stream function formulation, incompressible viscous flow, stream function, velocity-pressure and stream function-vorticity formulation, Solution of incompressible and compressible fluid film lubrication problems. (5hrs)\n\n\n## UNIT-IV\n\nComputer Programming of FEM to problems arising in various domains discussed above. (5hrs)",
    "course outcomes": "- At the end of the course student will be able to get a feel of an important numerical technique used to solve various problems which are governed by different laws of Physics.\n- They will also be able to appreciate the similarities in the solution procedure which exists among the seemingly different branches of engineering.",
    "reference books": "- The Finite Element Method by Zienkiewicz, Tata McGraw Hill\n- The Finite Element Method for Engineers by Huebner, John Wiley\n- An Introduction to the Finite Element Method by J.N.Reddy, McGraw Hill\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-23",
    "course title": "Computational Fluid Dynamics",
    "number of credits": "3.0",
    "prerequisites": "",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To be able to understand the concepts of PDEs, their application to CFD problems and fundamentals of discretization.\n- To be able to solve problems related to heat transfer and fluid flow using Finite Difference and Finite Volume Methods.\n- To be able to understand the limitations and errors involved in solution to CFD problems.",
    "course content": "S:\n\n\n## UNIT-I\n\nIntroduction\nIntroduction to C.F.D., models of the flow, governing differential equations – continuity equation, momentum equation, energy equation, Navier- Stokes equation, physical boundary conditions. (10hrs)\n\n\n## UNIT-II\n\nMathematical behaviour of governing equation\nClassification of quasi linear partial differential equation, General method of determining the Classification of partial differential equation, hyperbolic, parabolic, elliptic equations. (5hrs)\nDiscretization methods\nFinite difference methods, difference equations, explicit & implicit approach, errors & analysis of stability. Basics of finite control volume method (5hrs)\n\n\n## UNIT- III\n\nHeat conduction problem\nSolution of One dimensional heat conduction through a pin, solution of two dimensional steady state and transient heat conduction problems, heat conduction problems in cylindrical coordinates: axisymmetric and non-axisymmetric problems.\n(5hrs)\nHeat conduction with convection & diffusion\nSteady state one dimensional convection and diffusion, upwinding, exact solution, exponential scheme, hybrid scheme, power law scheme, Discretization equation for two dimensions & three dimensions, false diffusion. (5hrs)\n\n\n## UNIT- IV\n\nFluid flow problem\nViscous incompressible flow, solution of the couette flow problem by F.D.M., calculation of the flow field using stream function –vorticity method numerical algorithms for solving complete Navier-Stokes equation – MAC method; SIMPLE method. (10hrs)",
    "course outcomes": "At the end of the course student will be able to\n- understand the concepts of PDEs, their application to CFD problems and fundamentals of discretization.\n- solve problems related to heat transfer and fluid flow using Finite Difference and Finite Volume Methods.\n- .to understand the limitations and errors involved in solution to CFD problems.",
    "reference books": "- Suhas. V. Patankar, Numerical heat transfer and fluid flow, Hemisphere\n- John. D. Anderson, Jr, Computational fluid dynamics, McGraw Hill\n- Anil .W. Date, Introduction to Computational fluid dynamics, Cambridge University Press\n- Niyogi, Chakraborty and Laha, Introduction to Computational fluid dynamics, Pearson Education\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-25",
    "course title": "Thermal Power Engineering",
    "number of credits": "3.0",
    "prerequisites": "Thermodynamics",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "- To understand the basic fundamentals of boilers and power plant cycles.\n- To understand operations of steam turbines and steam power plants.\n- To understand operations of diesel and gas turbine power plants.\n- General understanding of challenges in thermal power plants.",
    "course content": "S:\nIntroduction\n\n\n## UNIT-I\n\nIntroduction to thermal power, Description, and classification of boilers, Boiler mountings & accessories, Natural draught, artificial draught: Chimney design, Steam jet draught, and mechanical draught, Calculation of boiler efficiency & equivalent evaporation. (6 hrs)\nVapour Power Cycles\nCarnot cycle, Simple & modified Rankine cycles, Effect of operating variables on Rankine cycle, Rankine cycle with superheating, Reheating & regeneration, Reheat factor, Binary vapour cycle. (4hrs) UNIT-II\nSteam Turbines\nIntroduction, Classification of steam turbines, Working principle, Compounding, Velocity diagrams, Calculation of power output and efficiency, Condition for maximum efficiency, Degree of reaction, Governing of steam turbine. (8 hrs) Steam (Thermal) Power Plants\nAnalysis of steam power cycles for power plant application; High-pressure boilers- La-Mont boiler, Benson boiler, Loeffler boiler; Velox boiler; Super pressure steam power plants; Economizers; Air-preheaters; Superheaters and reheaters; Feed water heaters. General layout of thermal power plant; Site selection for thermal power plant; Coal as fuel, classification of coals, analysis of coal; Coal handling; Dead and live storage; Combustion of coal: coal burning methods, overfeed stokers, underfeed stokers, Pulverized fuels and burners. Ash handling and disposal; Dust collectors. Heat balance sheet for thermal power plants. (6 hrs)\n\n\n## UNIT-III\n\nDiesel Power Plants\nIntroduction; Field of use; Outline of diesel-electric power plant; Different systems of diesel power plant; Supercharging of diesel engines; Performance of diesel power plant; Advantages and disadvantages of diesel plants over thermal power plants. (4 hrs)\nGas Turbine Plants\nElements of plant; Thermal refinements; Performance of plants; Gas turbine characteristics; Comparison with other plants; Combined steam and gas turbine power plants. (4 hrs)\n\n\n## UNIT-IV\n\nFluctuating Loads on Power Plants\nIntroduction, Load curves, Different terms and definitions, Effects of variable loads on power plant design and operation. (4 hrs) Economic Analysis of Power plants and Tariffs\nCost of electrical energy; Selection of type of generation; selection of generating equipment; performance and operating characteristics of power plants; Load division among generators; Tariffs methods for electrical energy. (4 hrs)",
    "course outcomes": "By the end of this education program, the students will be able to:\n- Understand the overview of boilers and power plant cycles.\n- Understanding the operations of steam turbines and steam power plants.\n- Analysis of operations of diesel and gas turbine power plants.\n- Rectify the general challenges in thermal power plants.",
    "reference books": "- Thermal Engineering by Ballaney, Khanna Publisher\n- Thermal Engineering by Domkundar& Arora, Dhanpat Rai\n- Steam Turbine Theory & Practice by Kearton, W.J. Pitman.\n- Power Plant Engineering by Morse\n- Power Plant Engineering by Domkundwar\n- Power Plant Technology by El-Wakil\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-26",
    "course title": "Supply Chain Management And Logistics",
    "number of credits": "3",
    "prerequisites": "",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "To understand concept of Supply chain management and apply this knowledge to understand the working of corporate world.",
    "course content": "S:\n\n\n## UNIT-I\n\nUnderstanding the Supply Chain, Performance, Drivers and Obstacles Objectives of supply chain, Stages of supply chain, Supply chain process cycles, Push/pull view of supply chain processes, Importance of supply chain flows, Examples of supply chain, Strategic decisions in supply chain management. Supply Chain Performance, Supply chain strategies, Achieving strategic fit, Product life cycle, Supply Chain drivers and Obstacles, Four drivers of supply chain – inventory, transportation, facilities, and information, Obstacles to achieve strategic fit. (10 hrs)\n\n\n## UNIT-II\n\nPlanning Demand and Supply in a Supply Chain,\nRole of forecasting in a supply chain, Forecasting methods in a supply chain, Basic approach to demand forecasting, Aggregate planning resources. Managing economies of scale in a supply chain, Role of cycle inventory in a supply chain.\n(4 hrs)\nTransportation and Coordination in a Supply Chain\nFacilities affecting transportation decisions, Transport selection, Modes of transportation and their performance characteristics, Trade-offs in transportation decision, Making transportation decisions in practice, Models for transportation and distribution, Third party logistics (3PL). Coordination in a Supply chain, Lack of supply chain coordination and the Bullwhip effect, Effect of lack of coordination on performance, Obstacles to coordination, Achieving coordination in practice.\n(6 hrs)\n\n\n## UNIT-III\n\nSource Management and IT in Supply Chain\nInventory management in supply chain, Information technology in supply chain, Typical IT solution, Reverse supply chain, Reverse supply chain Vs. Forward supply chain. (6 hrs)\nAdvanced topics in SCM\nGreen, Lean, Sustainable, Global and Agile supply chain Management, Quality in Supply Chain. (6 hrs)",
    "course outcomes": "- Upon completion of this course, the students will be able to\n- Understand the decision phases and apply competitive & supply chain strategies.\n- Understand drivers of supply chain performance.\n- Analyze factors influencing network design.\n- Analyze the influence of forecasting in a supply chain.\n- Understand the role of aggregate planning, inventory, IT and coordination in a supply chain.",
    "reference books": "- Christopher Martin, “Logistics and Supply Chain Management”, Pearson Education Asia.\n- Chopra Sunil and Meindl Peter, “Supply Chain Management – Strategy, planning and operation’s”, Pearson Education, Asia.\n- Kapoor K K, KansalPurva, “Marketing logistics: A Supply Chain Approach”, Pearson Education Asia.\n- Mohanty, R.P and Deshmukh, S.G., “Supply Chain Management”, Pearson Education Asia.\n- Fawcett, S. E., Ellram, L. M and Ogden, J. A., “Supply Chain Management” Pearson Education Asia.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-27",
    "course title": "Maintenance Engineering",
    "number of credits": "4.0",
    "prerequisites": "Nil",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "To understand the basic concepts of Maintenance Engineering and apply them to address the practical maintenance problems of Industries.",
    "course content": "Introduction:\n\n\n## UNIT-I\n\nImportance of maintenance engineering, definitions and concepts used in maintenance, objectives and benefits of maintenance. Maintenance Systems: Various types of industrial maintenance systems, preventive corrective and breakdown maintenance systems, their merits, demerits and applications, new maintenance practices: CBM, TPM, RCM etc. (10hrs)\n\n\n## UNIT-II\n\nMaintenance Planning& Control:\nPlanned maintenance procedure, maintenance schedule and maintenance programme, benefits of planned maintenance and control, Computerized Maintenance Management System. (10hrs)\n\n\n## UNIT-III\n\nReliability, Maintainability & Availability:\nBasic concepts and definitions, availability models, economics of reliability, availability and maintainability, distribution of down time and its basic elements.\n(10 hrs)\n\n\n## UNIT-IV\n\nRepair Discard Decisions:\nIntroduction, factors affecting repair –discard decisions, cost-analysis and optimum module size.\nSpare Parts Management:\nMaterial and store control, consideration of spare provisioning on operational availability. (10 hrs)",
    "course outcomes": "Upon completion of this course, student would be able to\n- Understand the basic concepts of Maintenance Engineering.\n- Understand the fundamentals of various Industrial Maintenance Systems.\n- Understand the significance of Maintenance Planning and Control.\n- Analyse the relationship and economics of Reliability, Availability and Maintainability.\n- Understand the relevance of Repair-Discard Decisions and Spare Parts Management.",
    "reference books": "- R.H. Cliffton,Principles of Planned Maintenance, McGraw Hill, New York, 2001.\n- A. Kelly,Maintenance Planning and Control, PHE, London, 1984.\n- Heintzelman, Handbook of Maintenance Management, PHE.\n- F. Phillips &Rayers,Reliability, Availability and Maintainability, M/A Press.\n- E. Balagurusamy, Reliability Engineering, Tata McGraw Hill, 4th print, 2003.\n- L. S. Srinath, Reliability Engineering, East West Press Pvt. Ltd., 3rd Ed., 1991.\n- A.Birolini, Reliability Engineering: Theory and Practice, Springer, 5th edition, 2007.\n- H.P. Garg and B.P. Gupta, Industrial Maintenance, S. Chand Publishing, revised edition, 2010.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE- 28",
    "course title": "Product Design & Development",
    "number of credits": "3",
    "prerequisites": "Productivity Management, Manufacturing Fundamentals & Techniques",
    "course type": "PE",
    "branch": "me",
    "course learning objectives": "The focus of Product Design and Development is integration of the marketing, design, and manufacturing functions of the firm in creating a new product. The course is intended to provide the following benefits:\n- Competence with a set of tools and methods for product design and development.\n- Develop abilities to create a new product.\n- Awareness of the role of multiple functions in creating a new product (e.g. marketing, finance, industrial design, engineering, production).\n- Ability to coordinate multiple, interdisciplinary tasks in order to achieve a common objective.\n- Reinforcement of specific knowledge from other courses through practice and reflection in an action-oriented setting.\n- Enhanced team working skills.",
    "course content": "## UNIT-I\n\nIntroduction: Design theory, design materials, human factors in design, man- machine system, applied ergonomics, characteristics of successful product development, challenges to product development. (6 hrs)\n\n\n## UNIT-II\n\nDevelopment process and product planning: Generic development process, Concept development, product development process flows, product planning process, identify customer needs. (6 hrs)\n\n\n## UNIT-III\n\nProduct specifications and concept generation: Product specification, steps to establish the target specifications, Concept generation, five step concept generation method, concept selection, concept screening, concept testing, product architecture. (10 hrs)\n\n\n## UNIT-IV\n\nProduct design methods: Creative and rational, clarifying objectives - the objective tree method, establishing functions- the function analysis method, setting requirements – the performance specification method, determining characteristics\n– the QFD method, generating alternatives – morphological chart method, evaluating alternatives – the weighted objective method, improving details – the value engineering method and design strategies. (6 hrs)\n\n\n## UNIT-V\n\nDesign for manufacture: Estimating manufacturing cost, reducing component, assembly and support costs, design for assembly, design for disassembly, design\nfor environment, design for graphics and packaging, effective prototyping – principle and planning (4hrs)\n\n\n## UNIT-VI\n\nIndustrial design: Its need, impact and quality, industrial design process and its management, legal issues in product design, design resources, economics and management of product development projects. (4 hrs)\n\n\n## UNIT-VII\n\nErgonomics / Aesthetics: Gross human autonomy. Man-Machine interaction. Concepts of size and texture, colour .Comfort criteria. Psychological & Physiological considerations. Creativity Techniques: Creative thinking, conceptualization, brain storming, primary design, drawing, simulation, detail design. (6 hrs)",
    "course outcomes": "- At the end of the course student will be able to:\n- Describe an engineering design and development process\n- Demonstrate individual skill using selected manufacturing techniques\n- Employ engineering, scientific, and mathematical principles to execute a design from concept to finished product\n- Work collaboratively on a team to successfully complete a design project\n- Effectively communicate the results of projects and other assignments in a written and oral format",
    "reference books": "- K.T. Ulrich and S.D. Eppinger, “Product design and development”, Tata McGraw Hill\n- Chitale& Gupta, “Product Development”, Tata McGraw Hill\n- Monks, J. G., “Operations Management”, McGraw Hill, 1997.\n- George Dietor, A material and Processing approach, McGraw Hill\n…..………………….………………………………………………………………………..\nB.Tech (Mechanical Engineering) 8th Semester\nB.Tech(Mechanical Engineering) 8th Semester Programme Electives (PE)"
  },
  {
    "course code": "MEPC-29",
    "course title": "Measurement and Instrumentation",
    "number of credits": "4.0",
    "prerequisites": "",
    "course type": "PC",
    "branch": "me",
    "course learning objectives": "- To impart the knowledge to the students about significance, applications and types of measurement, identification of functional elements of a measuring system.\n- To study the instrument characteristics, classification, sources and statistical analysis of errors.\n- To learn the statistical analysis of experimental data.\n- To make students understand the construction, working principle and application of various types of transducers.\n- To study the use of strain gauges for load, force, torque and thrust measurement.",
    "course content": "## UNIT-I\n\nIntroduction\nDefinition, application of measurement instrumentation, functional elements of a generalized measuring system, measuring standards, types of measurement, types of input to measuring instruments and instrument system, classification of measuring instruments, merits and demerits of mechanical measuring systems, comparison of mechanical measuring system with electrical measuring systems, calibration. (6 hrs)\nGeneralized performance characteristics of instruments\nIntroduction, types of error, types of uncertainties, propagation of uncertainties in compound quantity, Static performance parameters: accuracy, precision, resolution, static sensitivity, linearity, hysteresis, dead band, backlash, and drift., sources of error, selection of a measuring instruments, mechanical and electrical loading, fundamentals of dynamic characteristics, generalized mathematical model of measuring systems, types of input, dynamic performance parameters: dynamic error, speed of response, etc, dynamic response of a first order mechanical systems with different inputs e.g. step, ramp, sinusoidal and impulse input. (12 hrs)\n\n\n## UNIT-II\n\nStatistical analysis of experimental data\nIntroduction, types of measuring data, statistical attributes, various method of presentation, estimation of presentation and uncertainties, confidence level, precision and statistical treatments of single and multi-sample type experimental data, Chauvenet’s criteria of rejecting a dubious data, curve fitting, best linear calibration and its precision, significant figures and rounding off. Overall\nuncertainty estimation of measuring systems, common sense approach, and engineering applications. (8 hrs)\nTransducers\nIntroduction, primary function, classification, electrostatic transducers: principle theory, types, advantages, and limitations, Fixed contact mechano-resistive transducers: classification, and uses, Metallic resistance strain gauge: types, construction theory of operation, Adhesive: property, selection criteria, mounting of strain gauges, Mathematical analysis of ballast and DC Wheatstone bridge circuits, characteristic and comparison of ballast and DC Wheatstone bridge circuits, temperature effects and their compensation. (8 hrs)\n\n\n## UNIT-III\n\nMeasuring of non-electrical physical quantities\nMeasurement of load, force, and thrust using resistant strain gauges, Elastic load cells, proving rings, fluid pressure measurement in pipe and containers, using strain gauges, Measuring of torque in transmission shaft under axial and bending loads in varying ambient conditions. (6 hrs)",
    "course outcomes": "- The students will be able to identify and explain the various functional components of a measurement system.\n- The students will be able to evaluate the static and dynamic characteristics of the measurement devices.\n- The students will be able to analyze the measurement data to calculate the various types of errors involved.\n- The students will be able to explain working principles of sensors and transducers.\n- The students will be able to measure the strain for load, force, torque and thrust measurement using various Wheatstone- Bridge circuits.",
    "reference books": "- Mechanical measurements & controlby D.S. Kumar, Metropolitan book\n- Instrumentation and Mechanical measurements by A.K. Tayal, Galgotia Publ.\n- Measurements systems application and design by E. Doebelin, McGraw-Hill\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-29",
    "course title": "Gas Dynamics",
    "number of credits": "3.0",
    "prerequisites": "Thermodynamics, Fluid Mechanics",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "- To understand the Basic fundamentals equations.\n- To understand the flow of compressible and normal shock waves.\n- To understand the moving normal, oblique shock waves and flow phenomenon.\n- To understand the measuring instruments gas dynamics.",
    "course content": "Review of Elementary Principles\n\n\n## UNIT-I\n\nIntroduction; Thermodynamic concepts for control mass analysis; Comments on Entropy; Pressure energy equation; Stagnation concept; Stagnation pressure; Energy equation; Momentum equation. (4 hrs) Introduction to Compressible Flow\nIntroduction; Objectives; Speed of propagation of a pressure front; Mach Number; Sonic velocity; Pressure field due to moving source of disturbance; Mach cone; Mach angle; Equation for a perfect gas in terms of Mach number; H-S & T-S diagrams. (6 hrs)\n\n\n## UNIT-II\n\nOne Dimensional Compressible Flow\nIntroduction; Isentropic flow; General fluid- without losses; Perfect gas with losses; The reference concept; Isentropic tables; Nozzle operation; Nozzle performance; Diffuser performance; Friction effects on nozzle flow. (6 hrs) Standing Normal Shocks\nIntroduction; Shock analysis; General fluid; Working equations for perfect gas; Normal shock tables; Shocks in nozzles; Thermodynamic directions of normal shock; Rankine-Hugoniat relation; Strength of shock. (6 hrs)\n\n\n## UNIT-III\n\nMoving Normal Shocks and Oblique Shocks\nIntroduction; Normal shocks; Tangential velocity superimposition; Oblique shocks; Oblique shock analysis; Oblique shock tables and charts; Boundary conditions of flow direction; Boundary conditions of pressure equilibrium. (6 hrs) Fanno and Rayleigh Flow\nIntroduction; Analysis for general fluid; Working equations for a perfect gas; Reference state & Fanno tables; Applications; Correlation with shocks; Friction choking; Rayleigh flow; Analysis for a general fluid; Working equations for a perfect gas; Reference state and Rayleigh tables; Applications; Correlation with shocks. (6 hrs)\n\n\n## UNIT-IV\n\nHigh Temperature Gas Dynamics and Measurements\nIntroduction; Importance of high-temperature flows; Nature of high temperature flows; Pressure measurements; Temperature measurements; Velocity and direction measurements; Density measurements. (6 hrs)",
    "course outcomes": "By the end of this education program, the students will be able to:\n- Understand the fundamental laws and its concepts.\n- Understand the concept of compressible flow and normal shocks.\n- Understand the principle of moving normal, oblique shock waves and flow phenomenon.\n- Understand the measuring instruments of gas dynamics.",
    "reference books": "- Gas Dynamics - Video course NPTEL T. M. Muruganandam Indian Institute of Technology Madras https://nptel.ac.in/courses/101106044/1\n- Gas Dynamics by E. Rathakrishnan\n- Fundamentals of Gas Dynamics by S. M. Yahya.\n- Gas Dynamics by Becker\n- Fundamentals of Gas Dynamics by R. D. Zucker\n- Prof. V. Babu, Air breathing Engines NPTEL Video course, Department of Mechanical Engineering IIT Madras.\n- Fundamentals of Propulsion by V. Babu ANE Student Edition, 2009\n- P. G. Hill and C. R. Peterson, Mechanics and Thermodynamics of Propulsion, Addison Wesley, Third Edition, 1991.\n- J. D. Mattingly, Elements of Gas Turbine Propulsion, Aeronautical and Aerospace Engineering, McGraw-Hill Series in 1996.\n- G. C. Oates, Aerothermodynamics of Gas Turbine and Rocket Propulsion, AIAA Education Series, Third edition, 1997.\n- G. C. Oates, Aerothermodynamics of Aircraft Engine Components, AIAA Education Series, 1985.\n- H. I. H. Saravanamuttoo, G. F. C. Rogers and H. Cohen, Gas Turbine Theory, Pearson Education, Fifth edition, 2004.\n- Introduction to Aeronautical Engineering online course edx by TuDelft university. (https://courses.edx.org/courses/course-v1:DelftX+AE1110x+ 2T2018/course/)\n- Gas Dynamics and Propulsion - Video course by Prof. V. Babu Department of Mechanical Engineering IIT Madras (https://nptel.ac.in\n/courses/112106166/).\n- Jet Aircraft Propulsion (Video) by Prof. Bhaskar Roy IIT Bombay (https:// nptel.ac.in/courses/101101002/37).\n- Aerospace Propulsion by Dr. P.A. Ramakrishna IIT Madras (https://nptel. ac.in/courses/101106033/4).\nHyperlinks:\n- http://www.grc.nasa.gov/WWW/K-12/airplane/\n- http://www.rolls-royce.com/\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-30",
    "course title": "Advanced Manufacturing Technology",
    "number of credits": "3.0",
    "prerequisites": "Production Technology",
    "course type": "PE/OE",
    "branch": "me",
    "course content": "Course Learning Objective:\n- To impart knowledge of advanced knowledge of manufacturing technology such as thread manufacturing, metal forming & die casting.\n- To impart through knowledge to student about the various metal processing.\n\n\n## UNIT-I\n\nSpecial Processing Methods\nHot machining, Machining of Plastics, Unit heads, Plastics Tooling, Electro forming, Surface Cleaning and Surface Treatments, Surface Coatings, Paint Coating and Slushing, Adhesive Bonds, Adhesive Bond Joints, Adhesives, Surface Coating for Tooling, Graphite Mould Casting, and Vacuum Mould Process. (4 hrs)\nCeramic Materials and Their Processing\nIntroduction, Classification of ceramics, Properties of Ceramics, Processing of ceramics, Product Application, Enamels, Glass, Glass forming Constituents, Types of Glasses, forms of Glasses and their manufacture. (4 hrs)\n\n\n## UNIT-II\n\nComposite Materials and Their Processing\nIntroduction, Types of Composites materials, Agglomerated Materials, Reinforced materials, Laminates, Surface Coated Materials, Production of Composite Structures, Fabrication of particulate composite Structures, Fabrication of reinforced Composite, Fabrication of Laminates, Machining, Cutting and Joining of Composites. (6 hrs)\nProcessing of Plastics\nIntroduction, Polymers, Polymerization, Addition of Polymers, Plastics, Types of plastics, Properties of Plastics, Processing of Thermoplastic Plastics, Injection Moulding, Extrusion Process, Sheet forming processes, Processing of Thermosetting Plastics, Compression Moulding, Transfer Moulding, Casting of Plastics, Machining of plastics, other processing methods of plastics. (4 hrs)\n\n\n## UNIT-III\n\nThread Manufacturing\nIntroduction, casting, thread chasing, Thread Rolling, Die Threading and Tapping, Thread Milling, Thread Measurement and Inspection. (4 hrs)\nAnalysis Of Metal Forming Processes\nTheoretical basis of metal forming, classification of metal forming processes, cold forming, hot working, Warm working, Effect of variables on metal forming\nprocesses, Methods of analysis of manufacturing processes, Open Die forging, Rolling Power Rolling, Drawing, Extrusion. (6 hrs)\n\n\n## UNIT-IV\n\nDie Casting\nIntroduction, Product Application, Limitation of Die Casting, Die Casting Machines, Molten metal Injection systems, Hot chamber machines, Cold chamber machines, Die casting Design, Design of Die casting Dies, Types of Die casting Dies, Die design, Die material, Die Manufacture, Die Lubrication and Coating, Preheating of Dies, Vacuum Die Casting, Recent trends in Die Casting Process. (6 hrs)\nCost Estimation\nDefinition, Cost accounting or costing, Elements of costing, cost structures, Estimation of cost elements, Methods of estimating, Data requirements of cost estimating, Steps in making cost estimate, Chief factors in cost estimating, Numerical examples, calculation of machining times, Estimation of total unit time.\n(6 hrs)",
    "course outcomes": "- Understand various surface treatment methods commonly used for materials\n- Understand ceramic materials, composite materials and plastics along with their processing to manufacture components\n- Understand and apply thread manufacturing methods and their measurements\n- Understand and carry out metal forming process analysis\n- Understand die casting machines and to carry out die design\n- Understand cost accounting and apply to compute cost for manufacture of components.",
    "reference books": "- Principles of Manufacturing by J.S.Campbell, Tata McGraw-Hill\n- Production Engineering Sciences by Pandey and Sinh Standard Pub.\n- A text book of Production Technology by P.C. Sharma S.Chand& Company.\n- Manufacturing Materials and Processes by Lindberg Prentice Hall"
  },
  {
    "course code": "MEPE-31",
    "course title": "Entrepreneurship",
    "number of credits": "3.0",
    "prerequisites": "Productivity Management, Product Design and Development",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "This course is designed to help students to\n- Evaluate the business skills and commitment necessary to successfully operate an entrepreneurial venture and review the challenges and rewards of entrepreneurship.\n- Students will learn about themselves, their decisions, and their goals to determine how entrepreneurship can play a role in their lives.\n- Students will also be introduced to entrepreneurship from an economic perspective and the concepts of environmentally sustainable practices and social entrepreneurship and ability to recognize a business opportunity that fits the individual student\n- Demonstrate the understanding of how to launch the individual's entrepreneurial career and to recognize the innate entrepreneurial potential within themselves;\n- Recognize the critical importance of values and ethics when engaged in entrepreneurial activities.",
    "course content": "Engineering Economics\n\n\n## UNIT-1\n\nDefinition and concept, Importance of economics for engineers, present value and future value, Wealth, Goods, Wants, Value and price, capital, money, utility of consumer and producer goods. (4 Hrs)\n\n\n## UNIT-II\n\nCosting\nIntroduction, Elements of cost, Prime cost, Overhead, Factory cost, Total cost, Selling price, Nature of cost, Types of cost. (4 Hrs) Depreciation\nDefinition and concept, Causes of depreciation, Methods of calculating depreciation. (4 Hrs)\nEconomic analysis of investment and selection of alternatives\nIntroduction, Nature of selection problem, Nature of replacement problem, Replacement of items which deteriorate, Replacement of machines whose operating cost increase with time and the value of money also changes with time, methods used in selection of investment and replacement alternatives. (6 Hrs) UNIT-III\nEntrepreneurship\nEntrepreneurship, Characteristics of an entrepreneur, some myths and realities about entrepreneurship. (4 Hrs)\nProduct planning and Development\nIntroduction, Requirement of a good product design, Various controlling agencies involved -their role and formalities for getting clearance before starting individual venture. (3 Hrs)\nMarketing\nThe modern concept of marketing, Definitions, functions and principle of marketing, STPD, 4Ps, Marketing research, Advertising. (4 Hrs)\n\n\n## UNIT-IV\n\nSmall scale Industries\nIntroduction, Role and scope of small scale industries, concept of small scale and ancillary industrial undertakings, How to start a small scale industry, Steps in launching own venture, procedure for registration of small scale industries, various developmental agencies-their functions and role in industrial and entrepreneurship development, Infrastructure facilities available for entrepreneurship development in India. MSMEs (6 Hrs)\nFinancial Management\nFinancial concept for small-scale industries, financial requirements Financial support program of banks, government financial agencies, Hire-purchase facilities alternate sources of finance. (4 Hrs)\nPreparation of feasibility Project Report\nTools for evaluation of techno economic feasibility project report, SWOT analysis.\n(2 Hrs)",
    "course outcomes": "After successful completion of course the student will be able to:\n- Recognize a business opportunity that fits the individual student.\n- Analyze the global, national and local business environment and use critical thinking skills in business situations.\n- Demonstrate the ability to provide a self-analysis in the context of an entrepreneurial career and to find an attractive market that can be reached economically and create an appropriate a business model\n- Apply effective written and oral communication skills to business situations.\n- Apply an ethical understanding and perspective to business situations.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-32",
    "course title": "Work Study & Ergonomics",
    "number of credits": "3.0",
    "prerequisites": "",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "- To understand the basic concepts of production and productivity and to study the methods of productivity improvement.\n- To understand the main concepts of Work Study and apply them to know about the practical aspects of Industrial World.\n- To inculcate the skills among the students for analysing and improving existing methods of working on the shop floor of an organisation.\n- To impart thorough knowledge to the students with respect to allowances, rating, determination of basic and standard time for various operations in an organisation.\n- To understand the basic concepts of Ergonomics and to apply them in real work environment.",
    "course content": "Productivity\n\n\n## UNIT- I\n\nConcept and definition, Difference between production and productivity, Reasons for low productivity, factors influencing productivity, productivity measures, measurement models, methods/techniques to improve productivity, work-study and productivity, Work content. (5 hrs)\n\n\n## UNIT- II\n\nIntroduction to Work-Study\nImportance, Human considerations in work-study Relationship of work-study man with management, supervisor & workers, qualities of a work-study man. (8 hrs)\n\n\n## UNIT- III\n\nMethod-Study\nDefinition, objectives, step-by-step procedure, questioning techniques, charts and diagrams for recording data. outline process charts, flow process charts, multiple activity charts, two handed process chart, string diagram, travel chart, cycle graph, Chrono-cycle graph, Therbligs, Micro motion study and film analysis, SIMO chart, Principles of motion economy, development and installation of new methods.\n(10 hrs)\n\n\n## UNIT- IV\n\nWork–Measurement:\nDefinition, various techniques of work-measurement work-sampling, stop-watch time study & its procedure, Job selection, Equipment and forms used for time study, rating, methods of rating, allowances and their types, work sampling, normal time, standard time, numerical problems, Predetermined Motion Time\nSystem and its types, Work Factor System, Method Time Measurement and Basic Motion Time. (10 hrs)\n\n\n## UNIT- V\n\nErgonomics\nIntroduction, history of development, objectives, man-machine system and its components, design of Man Machine Systems, introduction to structure of the body- features of the human body, stress and strain, metabolism, measure of physiological functions- workload and energy consumption, biomechanics, types of movements of body members, strength and endurance, speed of movements, Applied Anthropometry - types, use, principles and applications, design of work place and seat design, visual displays for static information, visual displays of dynamic information, auditory, tactual and olfactory displays and controls, effect of vibration, noise, temperature and illumination on performance. (12 hrs)",
    "course outcomes": "At the end of the course, student will be able to\n- Understand the production and productivity concepts.\n- Understand the Work Study concepts and their applications.\n- Understand and apply the method study procedure tools and techniques.\n- Analyse the Predetermined Motion Time System, Work Factor System, Method Time Measurement and Basic Motion Time.\n- Understand the prime concepts of Ergonomics and its significance in relation to the design of work place and controls etc.",
    "reference books": "- Barnes Ralph M., Motion & Time study: Design and Measurement of Work, Wiley Text Books, ed. 7th, 2001.\n- Marvin E, Mundel & David L, Motion & Time Study: Improving Productivity, Pearson Education, 2000.\n- Benjamin E Niebel and Freivalds Andris, Methods Standards & Work Design, McGraw Hill, 2013.\n- International Labour organization, Work-study, Oxford and IBH publishing company Pvt. Ltd., New Delhi, 2001.\n- Sanders Mark S and McCormick Ernert J, Human Factors in Engineering and Design, McGraw-Hill Inc., 1993.\n- Sharma S K and Sharma Savita, “Work Study and Ergonomics”, S K Kataria & Sons., Delhi, 2014.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-33",
    "course title": "Total Quality Management",
    "number of credits": "3.0",
    "prerequisites": "",
    "course type": "PE/OE",
    "branch": "me",
    "course content": "COURSE LEARNING OBJECTIVE\nTo understand concept of quality management and apply this knowledge to understand the working of corporate word.\nConcept of Quality\n\n\n## UNIT-I\n\nProducts and services, quality of products and services, definition of quality, dimensions of quality and their measure. (4hrs) Quality Management Practices\nVarious approaches to control and management of quality,: inspection oriented, statistical process control oriented, assurance oriented and TQM oriented approaches. (8hrs)\n\n\n## UNIT-II\n\nCost of Quality\nProductivity and quality relationship, concept of cost of quality, cost of conformance, prevention, appraisal and failure cost, internal and external failures, quality cost estimation in engineering and service industries. (4hrs) Organizing for Quality\nCompany wide organization for quality management, prevention, control and improvement, continuous improvement process. (4hrs)\n\n\n## UNIT-III\n\nHuman Aspects in Management of Quality\nCommitment, motivation, and involvement for quality, top management, management and worker participation, zero defects, quality circle, small group activity. (4hrs)\nQuality Systems\nIntroduction, ISO 9000 Series of standards, Other quality systems, ISO 14000 series standards, concepts of ISO 14001, requirements of ISO 14001, EMS benefits. (6 hrs)\nSome Case Studies TQM\nMinimum four Case Studies to be explained. (4 hrs)",
    "course outcomes": "Upon completion of this course, the students will be able to\n- Develop an understanding of quality management philosophies and framework.\n- Discuss the need of customer expectations, employee involvement and supplier partnership.\n- Analyze the TQM tools and techniques to improve the product and process quality.\n- Apply modern tools to improve quality of the product.\n- Describe ISO 9001, Environmental Management Standards and ISO 14001 Certification process.",
    "reference books": "- Besterfield, D.H, Michna, C.B, Besterfield, G. H and Sacre, M.B, “Total Quality Management” Pearson Education Asia.\n- Mukherjee, P. N., “Total Quality Management” Prentice Hall of India.\n- Rajaram, S., “Total Quality Management” Biztantra.\n- Ramasamy, S. “Total Quality Management” Mc Graw Hill Education.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-37",
    "course title": "Design of Heat Exchangers",
    "number of credits": "3.0",
    "prerequisites": "",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "- To understand the different configurations of heat exchangers.\n- To solve different rating and sizing problems of heat exchangers.\n- To be able to design heat exchangers that are used in numerous heat transfer applications.\n- To develop ways of heat transfer enhancement in heat exchangers.",
    "course content": "## UNIT-I\n\nClassification and basic design methodologies for heat exchanger Classification of heat exchanger, selection of heat exchanger, overall heat transfer coefficient, LMTD method for heat exchanger analysis for parallel, counter, multi- pass and cross flow heat exchanger, effectiveness-NTU method for heat exchanger analysis, fouling, cleanliness factor, techniques to control fouling, additives, rating and sizing problems, heat exchanger design methodology.(8 hrs)\n\n\n## UNIT-II\n\nDesign of double pipe heat exchangers\nThermal and hydraulic design of inner tube and annulus, hairpin heat exchanger with bare and finned inner tube, total pressure drop, design calculation of double pipe heat exchanger, double pipe exchangers in series-parallel arrangements.\n(7 hrs)\n\n\n## UNIT-III\n\nShell and tube heat exchangers\nTube layouts, baffle spacing, classification of shell and tube exchangers, design calculation of shell and tube heat exchangers, shell-side film coefficients, shell- side equivalent diameter, true temperature difference in a 1-2 heat exchanger, influence of approach temperature on correction factor, shell and tube sides pressure drop; performance analysis of 1-2 heat exchangers, design calculation of shell and tube heat exchangers; flow arrangements for increased heat recovery.\n(9 hrs)\n\n\n## UNIT-IV\n\nDirect contact type heat exchangers\nClassification of cooling towers, wet-bulb and dew point temperatures, Lewis number, cooling-tower internals, heat balance, heat transfer by simultaneous diffusion and convection; Design and analysis of cooling towers, determination of the number of diffusion units, performance evaluation of cooling towers, influence of process conditions and operating variables on their design. (7 hrs)\n\n\n## UNIT-V\n\nHeat Transfer Enhancement and Performance Evaluation\nHeat transfer enhancement, heat transfer and pressure drop, plate fin heat exchanger, tube fin heat exchanger, Performance evaluation of Heat Transfer Enhancement technique. (6 hrs)",
    "course outcomes": "- The students will be able to design heat exchangers employing all the three modes of heat transfer.\n- The students will be able to identify different types of heat exchangers and use them for appropriate applications.\nReference/Text Books:\n- Incropera, Dewitt, Bergmann and Levine, “Fundamentals of Heat and Mass Transfer”, Wiley India, 2006.\n- D.S. Kumar, “Heat and Mass Transfer”, Katson Publication, 2013.\n- Kern, D. Q., Process Heat Transfer, Tata McGraw-Hill, 2000.\n- Fraas, A. P., Heat Exchanger Design, Second Edition, John Wiley & Sons, 1989\n- N.H. Afgan and Schliinder, “Heat Exchangers Design and Theory”, McGraw Hill.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE- 38",
    "course title": "Production Planning and Control",
    "number of credits": "3.0",
    "prerequisites": "",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "- To understand the basic fundamentals of Production Planning and Control, Production Planning functions and apply this knowledge to the working of Production Systems.\n- To understand the basic concepts of Product Development and Design.\n- To impart the knowledge of Inventory Control, V.E.D. analysis, S-D-E analysis, F-S-N analysis H-M-L analysis and ABC analysis, Safety stocks and service levels.\n- To impart the knowledge of Evaluation of Material Processes and Value Analysis Tests.\n- To understand the significance of various Production Control functions viz. Dispatching, Expediting, Inspection and Evaluation.",
    "course content": "Introduction\n\n\n## UNIT-I\n\nBasic concepts of Production Planning and Control, Preplanning Planning, Production Planning and Control Functions: Estimating, Routing, Scheduling, Loading and Sequencing. (4 hrs)\n\n\n## UNIT-II\n\nProduct Development and Design\nEffect of competition on design, Long-range Planning, Company policy, product analysis, marketing aspects, the product characteristics, functional aspect, operational aspect, durability and dependability, Aesthetic aspect; Economic analysis, Profit and competitiveness, The Three S Concept- Standardization, Simplification and Specialization, Break Even Analysis. (9 hrs)\n\n\n## UNIT-III\n\nInventory Control\nDefinition, classification, objectives of inventory control, functions, economic order quantity various inventory models. Numericals on inventory control. Inventory carrying costs, factors affecting inventory costs.V.E.D. analysis, S-D-E analysis, F-S-N analysis H-M-L analysis and ABC analysis. Safety stocks, their objectives safety stocks and service levels. (9 hrs)\n\n\n## UNIT-IV\n\nEvaluation of Material and Processes\nIntroduction, value analysis, consideration of new techniques and materials, value analysis tests, material utilization of a product or assembly. Numerical problems on material utilization of a product. Value engineering job plan and various phases of job plan in systematic value engineering approach. (10 hrs)\n\n\n## UNIT-V\n\nDispatching, Expediting, Inspection and Evaluation\nIntroduction, Dispatch Procedure, Expediting, Inspection, Evaluation and Corrective Action. (8 hrs)",
    "course outcomes": "Upon completion of this course, student would be able to\n- Develop the understanding of Production Systems and their important features.\n- Understand the major concepts of Product Development and Design and their applications.\n- Understand the importance of various Product Characteristics.\n- Develop an understanding of various Inventory Control Concepts, Inventory models, Inventory Costs and ABC Analysis.\n- Understand the significance of various Production Planning and Control functions viz. Dispatching, Expediting, Inspection and Evaluation.",
    "reference books": "- Production Planning and control: Samuel Eilon The Macmillan Company, 1962.\n- The Fundamental of Production Planning And Control, Stephen N Chapman, Pearson Education, 2009.\n- Production Planning and Control: K.C. Aggarwal & K.C. Jain, Khaana publishers, 2014\n- Production Planning and Control: Text and Cases, S.K. Mukhopadhyay, PHI,2015.\n- Industrial Engg. & Operation Management by S.K. Sharma & Savita Sharma,\nS.K. Kataria and Sons, 2010.\n- Production Planning and Control: King J.R, Pergoan-1975.\n- Production Planning and Control: Sharma, Hari Raghu Rama Sharma, Everest Publishing House, 2010.\n- Production Planning and Control Seethrarama L. Narasimhan, Prentice Hall, 2ed-1994.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE-39",
    "course title": "Computer Integrated Manufacturing",
    "number of credits": "3.0",
    "prerequisites": "Computer Aided Design",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "To introduce the importance, concepts and components of computer integrated manufacturing.",
    "course content": "Introduction\n\n\n## UNIT-I\n\nIntroduction to manufacturing enterprise, External and internal changes, World- class winning criteria, Introduction to CIM concepts, Three step process for CIM implementation. (5hrs)\nManufacturing Systems\nManufacturing classifications, Product development cycle, Enterprise organization. (5hrs)\n\n\n## UNIT-II\n\nDesign Automation: Computer-Aided Design and Engineering\nIntroduction, General system operation, CAD classification: Hardware and software platforms, Application of CAD to manufacturing systems, Design for manufacturing and assembly, Computer-aided engineering analysis and evaluation. (5hrs)\nManufacturing Planning and Control\nIntroduction, planning the manufacturing planning and control system, master production schedule, inventory management, product data management. (5hrs)\n\n\n## UNIT-III\n\nMaterial Planning, Production Scheduling and Operating Systems\nMaterial requirement planning, Capacity requirement planning, MRP II, Just-in- time manufacturing. (5hrs)\nEnterprise Resoruce Planning\nMRP II – a driver of effective ERP systems, information technology, the decision to implement ERP system, Features of modern manufacturing planning and control systems. (5hrs)\n\n\n## UNIT-IV\n\nProduction Support Machines and Systems\nIndustrial robots, automated material handling systems, automated guided vehicles, automated storage and retrieval systems. (5hrs)\nMachine and System Control\nSystem overview, Cell control, Proprietary versus Open system interconnect software, Device control, programmable logic controllers, Computer numerical control, Automatic tracking, Network communications. (5hrs)",
    "course outcomes": "The student is able to understand various aspects of computer integrated manufacturing from hardware and software viewpoints.",
    "reference books": "- Computer-integrated manufacturing, James A. Rehg and Henry W. Kraebber, Pearson Education.\n- Computer Integrated Manufacturing Technology and Systems, U. Rembolt,\nC. Blume, R. Dillmann, Dekker, 1985.\n- Computer Integrated Design and Manufacturing, D.D. Bedworth, M.R. Henderson, P.M. Wolfe, McGraw Hill.\n- Systems Approach to Computer Integrated Design and Manufacturing, N. Singh, John Wiley & Sons.\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MEPE- 40",
    "course title": "Facilities Planning",
    "number of credits": "3.0",
    "prerequisites": "",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "- To understand the main concepts of Facility Planning and apply them to know about the practical aspects of Industrial World.\n- To inculcate the skills among the students for analyzing and improving the analysis of material handling problem.\n- To impart thorough knowledge to the students with respect to Industrial Acts and Safety and Engineering economics.\n- To impart thorough knowledge to the students about the optimum allocation of material handling equipment Facilities Planning.",
    "course content": "Plant location\n\n\n## Unit-I\n\nNature of Location Decision, Need for facility location planning, General procedures and actors influencing location decisions, Facility Location Models, economics and cost analysis, Rural and urban location pattern in India. (4 hrs) Unit-II\nFacility Planning\nDefinition, Significance and objectives of facility planning, Facility planning process, Strategic Facilities Planning, Developing Facilities Planning Strategies, Flow system patterns like RAFT, CORELAP, ALDEP & PLANET, Material flow system, Activity Relationships, Space requirements, Basic Lay out types, Lay out procedures, Algorithmic Approaches, Department Shapes and mail Aisles, The impact of changes, developing Layout Alternatives. (10 hrs)\n\n\n## Unit-III\n\nFacility design for manufacturing system\nIntroduction, fixed automation system, Flexible manufacturing system, Reduction in work in process, Just-in-time manufacturing, Facilities planning trends. (3 hrs) Unit-IV\nEvaluating, Preparing and Maintaining the Facilities Plan\nIntroduction, Evaluating, selecting, preparing, presenting, implementing and maintaining the Facilities Plan. (3 hrs)\n\n\n## Unit- V\n\nIndustrial Acts and Safety\nNecessity of Industrial acts, The Indian Factories Act 1948, The industrial Dispute act1947, The minimum Wage Act 1948. Introduction to Industrial safety, Causes and sources of accidents, Accident control, safety program investigation and\nanalysis of accidents, Safety devices in Machines, Welfare and safety, safety and productivity. (6 hrs)\n\n\n## Unit- VI\n\nEngineering economics\nConcept of Engineering economics, Risk and uncertainty, discounted cash flow techniques in changing economics, Purpose, type and requirements of depreciation methods and obsolesce, Reasons for replacement and it’s models, Present worth method of comparison and future worth method.es, Welfare and safety, safety and productivity. (6 hrs)\n\n\n## Unit- VII\n\nMaterial Handling Equipments\nScope and functions of material handling, Manual mechanical handling ratio, Principles of material handling, Analysis of material handling problem, Classification of material handling system, Salient features and applications of general purpose material handling Equipments, Material handling in stores and warehouses , Optimum allocation of material handling equipment Facilities Planning. (8 hrs)",
    "course outcomes": "- The students will be able to Rural and Urban location pattern in India.\n- The students will be able to understand Developing Facilities Planning Strategies.\n- The students will be able to understand the various Necessity of Industrial acts.\n- The students will be able to Basic Lay out types.\n- The students will be able to understand the various material handling equipment Facilities Planning.",
    "reference books": "- JamesA.Tompkins.,“Facilities Planning”.Edition 3, publisher J.Wiley 2003.\n- S.N.Chary., “Production And Operations Management” Publisher Tata McGraw-Hill Education 2004.\n- S.N.Chary., “Theory and Problems in Production and Operations Management” Tata McGraw-Hill Education, 1995."
  },
  {
    "course code": "MEPE-41",
    "course title": "Air Breathing Engines",
    "number of credits": "3.0",
    "prerequisites": "Thermodynamics",
    "course type": "PE/OE",
    "branch": "me",
    "course learning objectives": "- To understand the Basic fundamentals of Gas dynamics\n- To understand the basic of propulsion system of air breathing engine.\n- To understand the basic principle of Ramjet Engine working\n- To understand the thermodynamics of Jet engines.",
    "course content": "Introduction\n\n\n## UNIT-I\n\nIntroduction, Fundamental Ideas, Normal shocks, Flow with heat addition, Rayleigh flow, Flow with friction Fanno flow, Quasi 1D flows, Oblique shocks, Prandtl -Meyer waves. Mech number. (10 hrs) UNIT-II\nBasic ideas in aircraft propulsion Thrust\nModes of Propulsion, Turbojet engine Operation of a turbojet and afterburning turbojet engine, Turbojet engine - Component analysis – intake and compressor, Turbojet engine- Component analysis – combustor, turbine and nozzle. (7 hrs) Turbofan engine\nTurbofan engine- Component analysis – Fan, Turbofan engine emerging trends.\n(6 hrs)\n\n\n## UNIT-III\n\nRamjet and turbo ramjet engines\nOperation of a Ramjet Engine and a Turboramjet Engine, Ramjet and turbo ramjet engines Component analysis – Supersonic Intake Ramjet and turbo ramjet engines Component analysis – Supersonic Intake, Combustor. (5 hrs)\n\n\n## UNIT-IV\n\nScramjet, Thermodynamics of jet engines\nThrust Equation for a Turbojet and Turbofan Engine; T-s diagram of a Turbojet Engine, Thermodynamics of jet engines Component efficiencies; T-s diagram of a Turbofan Engine, Thrust calculations Turbojet and Turbofan engine, Afterburning Turbojet and Ramjet Engine Thrust calculations, Worked example. (8 hrs)",
    "course outcomes": "By the end of this education program, the students will be able to:\n- Understand the Gas dynamics laws and its concepts.\n- Understand the components of air breathing analysis and its operation.\n- Understand of working of Ramjet and turbo ramjet and its combustion phenomenon.\n- Understand the thermodynamics analysis inside the engine and it’s numerical.\nReference:\n- Prof. V. Babu, Air breathing Engines NPTEL Video course, Department of Mechanical Engineering IIT Madras.\n- Fundamentals of Propulsion by V. Babu ANE Student Edition, 2009\n- P. G. Hill and C. R. Peterson, Mechanics and Thermodynamics of Propulsion, Addison Wesley, Third Edition, 1991.\n- J. D. Mattingly, Elements of Gas Turbine Propulsion, Aeronautical and Aerospace Engineering, McGraw-Hill Series in 1996.\n- G. C. Oates, Aerothermodynamics of Gas Turbine and Rocket Propulsion, AIAA Education Series, Third edition, 1997.\n- G. C. Oates, Aerothermodynamics of Aircraft Engine Components, AIAA Education Series, 1985.\n- H. I. H. Saravanamuttoo, G. F. C. Rogers and H. Cohen, Gas Turbine Theory, Pearson Education, Fifth edition, 2004.\n- Introduction to Aeronautical Engineering online course edx by TuDelft university. (https://courses.edx.org/courses/course-v1:DelftX+AE1110x+2T 2018/course/)\n- Gas Dynamics and Propulsion - Video course by Prof. V. Babu Department of Mechanical Engineering IIT Madras (https://nptel.ac.in/courses/ 112106166/).\n- Jet Aircraft Propulsion (Video) by Prof. Bhaskar Roy IIT Bombay (https://nptel.ac.in/courses/ 101101002/37).\n- Aerospace Propulsion by Dr. P.A. Ramakrishna IIT Madras (https:// nptel.ac.in/courses/101106033/4).\nHyperlinks:\n- http://www.grc.nasa.gov/WWW/K-12/airplane/\n- http://www.rolls-royce.com/\n…..………………….……………………………………………………………………….."
  },
  {
    "course code": "MELR-14",
    "course title": "Measurement and Instrumentation (Practical)",
    "number of credits": "1.0",
    "prerequisites": "",
    "course type": "ELR",
    "branch": "me",
    "course learning objectives": "The objective of this Lab is to help students understand the use of sensors, transducers and measuring instruments. The lab also focuses on how measuring devices work and provides an insight of construction of these devices. The lab also gives hands on experience to the students of different measuring devices.",
    "course content": "- Study of a strain gage based cantilever beam and measurement of strain on the beam\n- Study of a LVDT and measurement of linear displacement\n- Study of an inductive pick up and measurement of linear displacement\n- Study of a LDR and measurement of linear displacement\n- Study of capacitive pick up and measurement of angular displacement\n- Study of temperature transducers and measurement of temperature of fluid\n- Study of a LVDT (strain gage based) and measurement of linear displacement\n- Study of a torque pick up and measurement of torque\n- Study of a pressure pick up and measurement of pressure of fluid\n- Study of load cell and measurement of load with load cell\n- Study of non-contact type speed pick up and measurement of rotational speed\n- Comparison of sensitivity of thermocouple, thermister and RTD",
    "course outcomes": "After completion of this course, the student\n- Understand different types of measuring instruments, their construction, operation and their characteristics.\n- Identify the instruments suitable for typical measurement.\n- Apply the knowledge about transducers to use them effectively.\n…..………………….……………………………………………………………………….."
  }
]
