[
  {
    "course code": "PRIR11",
    "course title": "Introduction to Production and Industrial Engineering",
    "number of credits": "2.0",
    "prerequisites": "Nil",
    "course type": "EPR",
    "branch": "pie",
    "course learning objectives": "- To introduce the basic concepts and principles of Production and Industrial Engineering.\n- To demonstrate importance of Production & Industrial Engineering in present day scenario.\n- To highlight the latest developments in Production and Industrial Engineering.",
    "course content": "## UNIT I\n\nHistory and evolution of production and industrial engineering and its applications, developments in production and industrial engineering: timeline; case studies. [3 hrs]\n\n\n## UNIT II\n\nEngineering materials: metals, alloys, ceramics, composites, polymers; their properties and applications, selection criteria of materials for engineering applications, introduction to manufacturing, selection criteria of manufacturing processes, classification of manufacturing processes: additive, subtractive, formative and assembly. [8 hrs]\n\n\n## UNIT III\n\nIntroduction to industrial engineering: objectives, functions, concepts of productivity, manufacturing systems, plant layout and material handling, fundamentals of NC, CNC & DNC, product development cycle, production planning and control, quality control and reliability, work study and ergonomics. [8 hrs]\n\n\n## UNIT IV\n\nLatest developments in production and Industrial engineering: advanced manufacturing processes, Rapid prototyping, Micro and nano fabrication, Green manufacturing, Lean manufacturing, SMED, usability engineering and human computer interaction [9 hrs]",
    "course outcomes": "The students will learn about the\n- Basic concepts of materials and manufacturing processes\n- Principles of selection of materials and manufacturing processes for engineering applications\n- Basic concepts of industrial engineering and its applications.\n- Recent development in the field of Production & Industrial Engineering.",
    "reference books": "- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.\n- M P Groover, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.\n- Amitabha Ghosh & Ashok Kumar Malik, Manufacturing Science, East-West Press.\n- Avraham Shtub & Yuval Cohen, Introduction to Industrial Engineering, CRC Press.\n- Richard C. Vaughn, Introduction to Industrial Engineering, Lowa state University Press.\n- Everett E. Adam and Ronald J. Ebert, Production and Operations Management: Concepts, Models, and Behavior, Prentice-Hall.\n- Chary, Production and Operations Management, Tata McGraw-Hill Education."
  },
  {
    "course code": "MEIR-11",
    "course title": "Engineering Practice",
    "number of credits": "2.0",
    "prerequisites": "NIL",
    "course type": "EPR",
    "branch": "pie",
    "course learning objectives": "- To introduce the basic concepts and fundamental Knowledge of engineering practices such as fitting, wood working, foundry, machining, welding, etc. for manufacturing a product.\n- The other objective of this course is to prepare the students to understand the various tools and equipment’s used in these processes and their working principle.",
    "course content": "## UNIT I\n\nIntroduction\nIntroduction to engineering practices, safety measures.\nFitting shop\nIntroduction, classification of metals: ferrous and nonferrous, fitting tools: measuring and marking tools, marking schemes for a fitting jobs, cutting tools: files specifications and uses, hacksaw, chisels, clamping tools: Vice, U-clamp, striking tools: hammers, taps and tapering process.\n[4 hrs]\n\n\n## UNIT II\n\nCarpentry shop\nIntroduction of carpentry/Joinery, wood working: types of woods, advantage of wood, seasoning of wood, carpentry tolls: measuring tools, marking tolls, cutting tools: saws, chisels, planning tools, drilling tools, striking tools, drilling tools, wood working joints, wood working lathe,\nFoundry Shop\nIntroduction, foundry hand tools, measuring boxes, ladle, moulding, machines, furnaces.\n\n\n## UNIT III\n\nMachining Shop\n[6 hrs]\nLathe, description of lathe: headstock, tailstock, gearbox, carriage, apron, cutting speed, feed &depth of cut, cutting tools, Chucks: 3 jaw, 4 jaw. [2 hrs]\n\n\n## UNIT IV\n\nIntroduction, classification of welding processes, advantages, disadvantage and applications of welding, arc welding & gas welding equipment’s, soldering & brazing [2 hrs]",
    "course outcomes": "At the end of the course student will be able to:\n- Understand the fundamental concept of various basic engineering practices namely fitting, carpentry, foundry, machining welding, etc.\n- Decide and recommended appropriate tools and equipment for different manufacturing techniques.\n- Develop their communication skills in oral, written and developed modes.\n- Function effectively in teams and within a diverse environment.\n- Understanding professionalism, ethics and the associated responsibilities.",
    "reference books": "- S K Hajra Choudhury, Nirjhar Roy, A K Hajra Choudhury, Elements of workshop Technology (vol. 1&2 ), media promoters.\n- B S Raghuwanshi, A Course in Workshop Technology (manufacturing Process vol 1 Dhanpat Rai & CO.\n- W A J Chapman, Workshop technology in SI unit (part – 1 &2), Mc Graw Hill Education.\n- MP Groover, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Process for Engineering Materials, Pearson Education India.\nSCHEME OF EXAMINATION"
  },
  {
    "course code": "PRPC-10",
    "course title": "Thermodynamics",
    "number of credits": "04",
    "prerequisites": "Nil",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- Students will understand the basic terminologies related to thermodynamics\n- Students will be able to use energy conservation law in different energy systems.\n- Students will be able to make exergy analysis of different thermodynamic systems\n- Students will be able to relate different thermodynamic properties and will use them for analysis of different systems involving energy transformation",
    "course content": "## Unit-I\n\nConcepts of Thermodynamics\nIntroduction to basic concepts of thermodynamics, thermodynamic properties, thermodynamic equilibrium, Quasi-static process, zeroth law of thermodynamics, Temperature scales, work and heat transfer. [04hrs]\nProperties of Fluids\nProperties of liquids and vapours; P-V, P-T, T-S and H-S diagrams for a pure substance (water), Tables of properties, Expansion of steam, Hyperbolic , Isentropic and throttling processes; determination of dryness fraction, Properties of a perfect gas; Equation of state; Property relation for internal energy, enthalpy & heat capacities of an ideal gas, P-V-T surface, Triple point , Real gases, properties of real gases, Vander Waals equations, Properties of ideal gas mixtures.\n[06hrs]\n\n\n## Unit-II\n\nThe First Law of Thermodynamics\nThe First Law of Thermodynamics, PMM-I, First law for a closed system; Application of the First Law to non-flow processes viz constant volume, constant pressure, constant internal energy processes; Reversible adiabatic and reversible polytropic processes; Enthalpy, First Law as a Rate Equation, First Law Applied to a Control Volume – The SSSF AND USUF Processes, Limitations of the First Law. [10hrs]\n\n\n## Unit-III\n\nThe Second Law of Thermodynamics\nHeat source & sink, Heat engine, Refrigerator & Heat Pump, Kelvin Planck and Clausius statements of second law of thermodynamics; Reversible & Irreversible processes; The efficiency of a Carnot Cycle and introduction to absolute Temperature Scale, Clausius Inequality, Entropy, characteristics of Entropy, Entropy change for open & closed systems, Third Law of Thermodynamics, Validity & limitations of the Laws of Thermodynamics. [10hrs]\n\n\n## Unit-IV\n\nAvailability\nAvailability and the Gibbs function, Availability of a closed system, Availability of steady flow system, The Gibbs function and the steady flow system. [05hrs]\nGeneral Thermodynamic Relations\nMaxwell Relations, specific heat relations, energy equations; relations involving internal energy and entropy, Joule Thomson Coefficient, Clausius Clapeyron’s equation using thermodynamic relations. [05hrs]",
    "course outcomes": "- Students will be able to understand the different thermodynamics systems, properties of thermodynamic systems, properties of steam and thermodynamic processes.\n- Students will be able to understand laws of thermodynamics and application of the laws for the analysis of different thermodynamics systems.\n- Students will be able to make exergy analysis of different thermodynamic processes and cycles.\n- Students will be able to derive thermodynamics relations expressing non measurable properties in terms of measurable properties.",
    "reference books": "- Engg. Thermodynamics: Roger, GFC & Mayhew, Y.R, ELBS\n- Engg. Thermodynamics: Nag, P.K., TMH\n- Fundamentals of classical thermodynamics by Gordon J. Van Wylen\n- Engg. Thermodynamics: Achuthan, M., TMH.\n- Thermodynamics An Engineering Approach: Cengel, McGraw Hill Education; Eighth edition\n- An Introduction to Thermodynamics: Rao, Y.V.C., Universities Press"
  },
  {
    "course code": "PRPC-11",
    "course title": "Manufacturing Processes",
    "number of credits": "03",
    "prerequisites": "NIL",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- Students will understand the basic terminologies related to manufacturing processes.\n- To introduce the basic concepts and fundamental knowledge of engineering materials and various processes such as casting, forming, machining, & welding etc. for manufacturing a product.\n- The other objective of this course is to prepare the students to understand the advance concepts and processes based on these basic manufacturing processes.",
    "course content": "## Unit I\n\nIntroduction to manufacturing, classification of manufacturing, fundamental properties of materials including metals and alloys, polymers, ceramics and composites, plastic processing techniques: compression moulding and injection moulding. [6 hrs]\n\n\n## Unit II Casting\n\nPattern materials, types of allowances, type of patterns, type of mould, desirable properties of\nmoulding materials, core, core print, type of cores, CO2 casting, expandable and permanent mould casting, sand casting, shell casting, plaster casting, investment casting, die casting, centrifugal castings, casting defects & remedies advantages, disadvantages and application of casting.\nMachining\nDefinition, classification, Lathe: parts and accessories, specifications, various operations on lathe.\n[14 hrs]\n\n\n## Unit III\n\nForming\nDeformation of metals, elastic and plastic deformation, metal working processes: cold and hot working, forging, rolling, extrusion, wire and tube drawing.\nSheet metal operations\nIntroduction to shearing, blanking and punching, notching, trimming, lancing, nibbling, bending, stretching, embossing and coining. [10 hrs]\n\n\n## Unit IV\n\nDefinition and classification, thermit welding, electric arc welding: MMAW, SAW, TIG, MIG, gas welding, resistance welding, brazing and soldering, welding defects and remedies. [10 hrs]",
    "course outcomes": "At the end of the course student will be able to\n- Decide and recommend cost effective and reliable engineering materials for the development of an existing and innovative product.\n- Decide and recommend appropriate manufacturing processes for a product under given conditions and constraints.\n- Develop their communication skills in oral, written and visual modes.\n- Function effectively in teams and within a diverse environment.",
    "reference books": "- P N Rao, Manufacturing Technology (Vol. 1 & 2), McGraw Hill Education.\n- M P Groover, Principles of Modern Manufacturing, Wiley.\n- Kalpakjian, Manufacturing Processes for Engineering Materials, Pearson Education India.\n- Amitabha Ghosh & A K Mallik, Manufacturing Science, Affiliated East-West Press Pvt. Ltd."
  },
  {
    "course code": "PRPC-12",
    "course title": "Engineering Mechanics",
    "number of credits": "4",
    "prerequisites": "NIL",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- Comprehensive, theory based understanding of the underpinning natural and physical sciences and the engineering fundamentals applicable to the engineering discipline.\n- In-depth understanding of specialist bodies of knowledge within the engineering discipline\n- Application of established engineering methods to complex engineering problem solving\n- Application of systematic engineering synthesis and design processes.",
    "course content": "## Unit-I\n\nComposition and Resolution of Forces\nIntroduction, Resultant of two forces which are not parallel, resolution of a single force into components, a graphical method of determining the resultant of a system of coplanar forces, principle of triangular of forces, Lami’s theorem.\nFrictional resistance, angle of friction, angle of repose, laws of friction, cone of friction, equilibrium of a body on a rough inclined plane. [8 hrs]\n\n\n## Unit-II\n\nCentre of Gravity and Moment of Inertia\nCentre of gravity, moment of an area, centroid of a uniform lamina, centroid of laminae of various shapes (triangle, circle, semi-circle, trapezium, built up section), moment of inertia of a laminae of different shapes (rectangular, circular, triangular and composite sections) [7 hrs]\n\n\n## Unit-III\n\nLifting Machines\nMachine, ideal Machine, Practical Machine, Law of a Machine, Lifting Machine, Reversibility of a machine, Simple pulley, First order, Second Order and Third order system of pulleys, wheel and axle, wheel and differential axle, Weston pulley block, screw thread, screw jack, purchase crab winches\nVirtual Work\nPrinciple of virtual work, positive and negative work, application of principle of virtual work to practical problems. [12 hrs]\n\n\n## Unit-IV\n\nCouple & Motion of Rotation\nCouples, a couple and its effect on a body, angular momentum or moment of momentum.\nMomentum, Work & Energy\nImpulse, principle of conservation of momentum, work done by a force of varying magnitudes, transformation of energy, conservation of energy, Pile and Pile hammer. [9 hrs]",
    "course outcomes": "Upon successful completion of the course, the student should be able to:\n- Use scalar and vector analytical techniques for analyzing forces in statically determinate structures\n- Apply fundamental concepts of kinematics and kinetics of particles to the analysis of simple, practical problems\n- Apply basic knowledge of mathematics and physics to solve real-world problems",
    "reference books": "- Engineering Mechanics (Dynamics), Hibbeler, Pearson Education (Singapore), Pvt. Ltd.\n- Engineering Mechanics (Statics).- Hibbeler\n- Engineering Mechanics: Statics and Dynamics – Shames, Prentice-Hall (India).\n- Engineering Mechanics, Bhavikantti, S.S. and Raja Shekharappa New Age Intn.(P) Ltd.\n- Vector Mechanics for Engineers (Statics)- Bear & Johnston.\n- Applied Mechanics: S. Ramamurtham, Dhanpat Rai & Sons.\nSCHEME OF EXAMINATION\nB. TECH. (3rd SEMESTER) PRODUCTION AND INDUSTRIAL ENGINEERING"
  },
  {
    "course code": "PRPC-13",
    "course title": "Fluid Mechanics & Machines",
    "number of credits": "4",
    "prerequisites": "Engineering Mechanics (PRPC12)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To familiarize with the properties of fluids and the applications of fluid mechanics.\n- To familiarize with the conservation principles of mass, momentum and energy\n- To understand basic principles of fluid flow applicable to fluid machines.",
    "course content": "## UNIT I\n\nIntroduction\nFluid, properties of fluid, Metacentric height, Buoyancy, Stability. Fluid Statics: Fluid pressure, Pascal’s law, general equation of fluid statics, pressure head of a fluid, simple and differential manometers, mechanical gauges. [10 hrs]\n\n\n## UNIT II\n\nFluid Kinematics\nLagrangian and Eulerian methods, types of flow, velocity and acceleration, continuity equation (cartesian co-ordinates), stream function, velocity potential function, flow nets, types of motion: linear translation, linear deformation, angular deformation and rotation. Fluid Dynamics: Euler’s equation, Bernoulli’s equation, energy equation, practical applications of Bernoulli’s equation in venturimeter, orifice meter and pitot tube. Reynold’s experiments. [10 hrs]\n\n\n## UNIT III\n\nPrinciples of Hydraulic Machines\nImpact of jet on stationary and moving flat and curved plates, forces on series of vanes, radial vanes. Hydraulic Turbines: Introduction, development of hydraulic turbines, classification of turbines. Turbines: Pelton, Francis, Propeller, Kaplan; working and essential components of these turbines. [10 hrs]\n\n\n## UNIT IV\n\nHydraulic Pumps\nCentrifugal pumps: working and its various components, classification, losses and efficiencies. Reciprocating pumps: working and its various components, classification, comparison with centrifugal pumps, air-vessels. Hydraulic Systems: Hydraulic accumulator, hydraulic intensifier, hydraulic lift, hydraulic crane, hydraulic coupling, torque converter, hydraulic ram. [10 hrs]",
    "course outcomes": "At the end of the course student will be able to\n- Identify and obtain the values of fluid properties and relationship between them and understand the principles of continuity, momentum, and energy as applied to fluid motions\n- Apply the conservation principles of mass, momentum, and energy to fluid flow systems\n- Apply the basic principles, the laws, and the pertinent equations to engineering design of the fluid machines for required applications.",
    "reference books": "- Fox, McDonald and Pritchard, Fluid Mechanics, Wiley, 8th Edition, 2013\n- Yunus A. Cengel and John M. Cimbala, Fluid Mechanics: Fundamentals and Applications, McGraw Hill-Education, 3rd Edition, 2014\n- S. K. Som, G. Biswas and S. Chakraborty, Introduction to Fluid Mechanics and Fluid Machines, McGraw Hill-Education, 3rd Edition."
  },
  {
    "course code": "PRPC-14",
    "course title": "Theory of Machines",
    "number of credits": "04",
    "prerequisites": "Engineering Mechanics (PRPC12)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To understand the basic concepts of machines and mechanisms.\n- To analyze the motions of various mechanisms.\n- To prepare the students for dynamic analysis of machines.",
    "course content": "## Unit-I\n\nMechanisms and Machines\nKinematics, Dynamics: Introduction to analysis and synthesis of Mechanisms, Links, pairs, Degree of freedom in Machines and Mechanisms [5 hrs.]\nVelocity and Accelerations Analysis\nVelocity determination: Relative velocity method, Instantaneous centre method Kennedy theorem. Acceleration determination by graphical method, coriole’s components of acceleration [6 hrs.]\n\n\n## Unit- II\n\nClutches & Brakes\nType of Clutches: Plate and Cone Clutches. Type of Brakes: external shoe brakes, band & block brakes, internal expending shoe brakes [5 hrs.]\nGears and Gear Trains\nTypes of gears, gear terminology, condition for correct gearing, cycloidal and involute profiles of gear teeth, pressure angle, path of contact, arc of contact, interference, minimum number of teeth to avoid interference. Simple, compound, reverted and epicycle gear trains and their solutions\n[6 hrs.]\n\n\n## Unit- III\n\nDynamic Forces in Mechanisms\nDynamics of reciprocating parts, piston efforts, Crank effort, Turning moment diagram for single cylinder and multi-cylinder engines, coefficient of fluctuation of energy, coefficient of fluctuation of speed flywheel and its function. [6 hrs.]\nGovernors\nType of Governor: Watt, porter, proell, spring, loaded centrifugal, inertia. Sensitiveness, stability, isochronisms, hunting, effort and power of governor [6 hrs.]\n\n\n## Unit-IV Balancing\n\nStatic and dynamic balancing of rotating parts, balancing of I.C. Engines, balancing of multi- cylinder engine: V-engines and radial engines. [5 hrs.]\nBelts, Ropes and Chains\nOpen and crossed belt drives, velocity ratio, slip, material for belts, length of belt tensions, centrifugal tension, power transmitted by belts and ropes, initial tension, chain drive, chain length, classification of chains. [4 hrs.]",
    "course outcomes": "At the end of the course students will be able to:-\n- Understand the common mechanisms and machines\n- Perform velocity and acceleration analysis of mechanisms\n- Perform dynamic analysis of machines\n- Describe the working of different types of clutches, brakes\n- Understand important gear trains and their practical applications.",
    "reference books": "- Theory of Machines by S.S Rattan, Tata McGraw Hill\n- Theory of Mechanisms and Machines by Jagdish Lal, Metropolitgan Book Co.\n- Theory of Machines by Sadhu Singh, Pearson Publisher\n- Theory of machines by P.L. Ballaney, Khanna Publisher"
  },
  {
    "course code": "PRPC-15",
    "course title": "Material Science",
    "number of credits": "04",
    "prerequisites": "Nil",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To develop an understanding of the mechanisms of plastic deformation, work hardening along with various other strengthening mechanisms and also to understand the correlation between crystal structure and the macroscopic mechanical properties of engineering materials.\n- To understand the various failure mechanisms (fracture, fatigue and creep) and the factors affecting failure.\n- To learn how to interpret a phase diagram and gain knowledge regarding the various heat treatment processes.\n- To understand the properties of ceramics and the various steps involved in powder metallurgy technique.",
    "course content": "## Unit I\n\nPlastic Deformation\nTypes of defects in crystals- point, line and surface defects, deformation by slip, slip planes, twinning, mechanical and annealing twins, dislocation- edge and screw dislocation, critical resolved shear stress, dislocation loop, energy of dislocation, force on dislocation, stress field around dislocation, dislocation motion, perfect, extended and sessile dislocation, jogs, dislocation density, Frank Read source, dislocation pile-up, interaction between dislocation and vacancies.\nWork Hardening\nWork hardening of single crystal and polycrystalline materials, mechanism of work hardening, work softening, Bauschinger’s effect, grain boundaries, its effect on crystal and on strength, grain size, low angle grain boundaries, polygonization, solid solution hardening, yield point phenomenon, strain aging, dispersion of second phase particles, preferred orientation, recovery and its mechanisms, recrystallization - mechanisms and laws, grain growth, hot working and cold working and their effects on mechanical properties. [10 hrs]\n\n\n## Unit II Failure\n\nIntroduction, theories of failure, stress concentration\nFracture\nIntroduction, types fracture, theoretical cohesive strength of metals, Griffith's theory of brittle fracture and its modification, stages in development of ductile fracture, methods of fracture protection.\nCreep\nCreep test, creep curve, creep curve equations, creep curve at constant temperature, stress- rupture test, effects of metallurgical variables on creep, creep mechanisms.\nFatigue\nIntroduction, factors to cause fatigue failure, stress cycles, S-N curve, fatigue test, theories of fatigue-Orowan theory, fatigue limit theory, Wood's theory and dislocation movement theory, effect of stress concentration on fatigue, size effects, corrosion fatigue, fretting, low temperature and high temperature fatigue.\nElastic Wave Propagation\nOne-Dimensional Wave Equation and Motions of an Elastic Material, Compression waves, Shear waves, Reflection and transmission at an interface. [16 Hrs]\n\n\n## Unit III\n\nPhase Diagrams\nIntroduction, plotting of binary diagram, equilibrium cooling of an alloy, solid solutions, eutectic, eutectoid and peritectic systems, Iron-Iron carbide (Iron carbon) equilibrium diagram- various phases present, various reactions involved, critical points, explanation of Iron carbon diagram; phase rule.\nHeat Treatment\nTTT diagram, pearlite transformation and bainite transformation, continuous cooling and TTT diagram- transformation of austenite, factors affecting critical cooling rate, heat treatment processes- annealing, normalizing, spheroidizing, hardening and tempering, austempering, martempering, precipitation hardening, case hardening- carburising, nitriding, cyaniding, flame hardening, induction hardening. [10 hrs]\n\n\n## Unit IV\n\nCeramics and Powder Metallurgy\nClassification of ceramic materials, ceramic and non- ceramic materials, mechanical and magnetic properties of ceramics, classification and properties of composite materials, whiskers and whisker composites, various methods of preparations of raw powders, blending, compacting, sintering, finishing operations-sizing, impregnation, infiltration, advantages and disadvantages, typical applications of powder metallurgy. [10 hrs]",
    "course outcomes": "The students will learn about:\n- The mechanisms of plastic deformation, work hardening and the basic principles pertaining to various other strengthening mechanisms.\n- Failure analysis.\n- Information given by a phase diagram and various heat treatment techniques.\n- Advancements in ceramic technology and powder metallurgy.",
    "reference books": "- Material Science and Engineering - V. Raghavan, Prentice Hall\n- Materials Science and Engineering An Introduction - W.D. Callister, John Wiley\n- Mechanical Behaviour of Materials - McClontock & Argon, Addison-Wesley\n- Mechanical Behaviour of Materials - Courtney, McGraw-Hill\n- Mechanical Metallurgy-Dieter\n- 'Introduction to Elastic Wave Propagation' by A. Bedford & D. S. Drumheller"
  },
  {
    "course code": "PRPC-16",
    "course title": "Production Technology- I",
    "number of credits": "04",
    "prerequisites": "Manufacturing Processes (PRPC11), Engineering Practice (MEIR11)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- The objective of this course is to impart fundamental knowledge and basic concept of various conventional machining operations such as turning, milling, drilling, slotting, etc. and salient features of various machine tools namely lathe, radial drilling machine, slotting machine, shaper, etc.\n- The other objective of this course is to prepare the students to understand the selection criteria of conventional machining techniques.\n- To learn how to interpret a tool geometry and gain knowledge regarding the various tools.",
    "course content": "## Unit I\n\nMetal Cutting\nConcept of generatrix and directrix; Classification of machining processes: Orthogonal and oblique, machining, single point and multi-point machining; Tool geometry: Single point cutting tool geometry, specifications in different standards, selection of tool angles; Cutting tool materials, different types of cutting tools, Chip formation: Mechanism, chip types, chip control; Mechanics of single point orthogonal machining: Merchant’s circle, force, velocity, shear angle, and power consumption relations.\nCutting Tool Wear and Life:\nWear Mechanism, wear criterion, Taylor’s tool life equation, flank wear, crater wear, variable affecting tool life, machinability and its measures.\nThermal Aspects of Machining:\nCutting temperature and factors affecting it, measurement, cutting fluids and its types, selection of cutting fluids.\nAnalysis of Machining Processes\nMechanics of machining of turning, boring, shaping and planning, milling (Slab and face milling), drilling, machining time calculations of above operations.\nEconomics of metal machining:\nElements of machining cost, machining economics and optimization for single pass turning operation. [28 hrs]\n\n\n## Unit II\n\nHole Making Operations\nIntroduction, drilling, reaming, boring, tapping, other hole making operations. [3 hrs]\n\n\n## Unit III Milling\n\nIntroduction, milling machines types, milling cutters, milling operations, dividing head and indexing types, Up milling down milling, milling operations, special set-ups. [6 hrs]\n\n\n## Unit IV\n\nReciprocating Machine Tools\nConstruction and working of shaper, planer, and slotter, quick-return mechanism, job holding devices. [3 hrs]",
    "course outcomes": "After learning this course, the students will be able to:\n- Develop their communication skills in oral, written and visual modes.\n- Function effectively in teams and within a diverse environment.\n- Understand professionalism, ethics and the associated responsibilities.\n- Decide and recommend appropriate conventional machining processes for a product under given conditions and constraints.",
    "reference books": "- Manufacturing Technology by P N Rao Vol. 2\n- Principles of Modern Manufacturing by M P Groover\n- Manufacturing Processes for Engineering Materials by Kalpakjian\n- Manufacturing Science by Ghosh & Mallik\n- DeGarmo's Materials and Processes in Manufacturing by DeGarmo, Black & Kohser\n- Fundamentals of Metal Cutting and Machine Tools by G. Boothroyed."
  },
  {
    "course code": "PRPC-17",
    "course title": "Thermal Engineering",
    "number of credits": "4",
    "prerequisites": "Thermodynamics (PRPC10)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To integrate the concepts, laws and methodologies from the first course in thermodynamics into the analysis of cyclic processes.\n- To apply the concepts of thermodynamics to various thermal applications such as IC engines, steam nozzles and turbines.\n- To understand the working of SI and CI engines.\n- To apply the concepts of thermodynamics to refrigeration and air-conditioning systems.",
    "course content": "## Unit I\n\nOverview of thermodynamics\nThermodynamic system, thermodynamic properties, thermodynamic equilibrium, quasi-static state, Zeroth law of thermodynamics, work and heat, First law of thermodynamics for a closed system, non-flow process, steady flow energy equation, Second law of thermodynamics, Concept of entropy. [3 hrs]\n\n\n## Unit II\n\nSteam Generation and Power\nBoilers: Introduction, Classification of boilers, Fire tube and water tube boilers, boiler mountings and accessories, Natural draught and artificial draught.\nSteam Nozzle: Function, Steady flow energy equation, Nozzle efficiency, Critical pressure ratio. Steam Turbine: Introduction, Classification of steam turbines, Impulse and Reaction turbines, working principle, velocity diagrams. [13 hrs]\n\n\n## Unit III\n\nInternal Combustion Engines\nIntroduction, Classification, cycle of operation in four stroke and two stroke I.C. engine, Valve timings, Otto cycle, Diesel cycle, Brayton cycle, Dual cycle, Comparison between these cycles, Air standard efficiency, specific work output, work ratio and mean effective pressure (with simple numerical problems).\nCombustion in SI Engines, stages of combustion, abnormal combustion, Octane rating Combustion in CI engines, stages of combustion, delay period, knock, Cetane rating\nFuel injection and Ignition systems, Lubrication and cooling, Engine Performance [14 hrs] Unit IV\nRefrigeration & Air –conditioning\nIntroduction, Carnot refrigeration and heat pump, COP of refrigerator and heat pump, vapour refrigeration system.\nAir Refrigeration: Basic principle of operation of air refrigeration, Bell Coleman Air refrigerator. Simple Vapour Compression Refrigeration System.\nIntroduction to air conditioning systems, Difference in air conditioning and refrigeration, Psychrometric properties of moist air (wet bulb, dry bulb, dew point temperature, relative and specific humidity), winter and summer air-conditioning systems, Room sensible heat factor.\n[10 hrs]",
    "course outcomes": "Upon the completion of this course the students will be able to\n- Apply thermodynamic concepts to boilers and steam turbines.\n- Solve problems related to different air standard cycles.\n- Explain the functioning and features of IC engines, components and auxiliaries.\n- Calculate performance parameters of Refrigeration and Air-conditioning systems.",
    "reference books": "- Thermal Engineering by Ballaney, Khanna Publisher\n- Steam and gas Turbine by R. Yadav, CPH\n- Internal Combustion Engines by Mathur & Sharma, Dhanpat Rai& Sons\n- Internal Combustion Engine by Ganesan, TMH\n- Refrigeration and Air Conditioning by C.P.Arora, TMH\n- Refrigeration & Air Conditioning by Arora & Domkundwar, Dhanpat Rai & Sons"
  },
  {
    "course code": "PRPC-19",
    "course title": "Machine Drawing",
    "number of credits": "04",
    "prerequisites": "ENGINEERING GRAPHICS (CEIR11)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "The student will acquire knowledge of fastening arrangements such as welding, riveting, and the different styles of attachment for shaft. The student also is enabled to prepare the assembly of various machine or engine components and miscellaneous machine components.\n- Study the conventions and rules to be followed by engineers for making accurate drawings.\n- Understand the basic dimensioning practices that have to be followed in the preparation of drawings.\n- Help the student in the visualization of assembly and sub assembly of various machine elements.\n- Train the students in the preparation of assembly drawings",
    "course content": "## Unit-I\n\nFasteners\nConventional representation of materials, common machine elements and parts such as Screw Threads screws, nuts, bolts, keys, cotters,. Rivets and riveted joints. Welds and welded joints\n. [7 hrs]\nMachine Drawing\nFree hand drawing of simple machine parts i.e. cotter joint, knuckle joint and shaft couplings, pipe fittings and pipe joints. [7 hrs]\nBearing\nSimple solid, bushed, pedestal, footstep bearings, I.S. conventional representation of ball and roller bearings, bracket and hangers of different types and bracket bearings, Plumber block etc\n[14 hrs]\n\n\n## Unit-II\n\nIntroduction\nIntroduction of unit assembly drawing, Practice in drawing details and assembly of simple units.\n[7 hrs]\n\n\n## Unit-III Valves\n\nFeed Check Valve, Blow off Cock, Stop Valve, Safety Valves [21 hrs]\n\n\n## Unit-IV\n\nSimple Steam and I.C. Engine Parts\nPistons, piston rod, cross head, stuffing box and glands, connecting rods, piston and connecting rod for I.C. engine. [10 hrs]\n.\nNote: Drawings should be in first angle method of projection.",
    "course outcomes": "At the end of the course students are able to:\n- Drafting their technical ideas\n- Creating knowledge about the various practices with regard to the dimensioning, sectioning and development of views.\n- Understanding the importance of the linking functional and visualization aspects in the preparation of the part drawings\n- Preparation of the part or assembly drawings as per the conventions.\n- Interpretation of machine drawings that in turn help the students in the preparation of the production drawings and to enhance the ability to work as practicing mechanical engineers in manufacturing Industries and consulting firms.",
    "reference books": "- Machine Drawing - N.D. Bhatt, Charotar Pubs.\n- Machine Drawing - Sidheshwar, Tata McGraw-Hill\n- A text book of Machine drawing - R.B. Gupta, Satya Prakasham Tech. Pub.\n- Machine Drawing –K.L.Narayana, P.Kannaiah& K. Venkata Reddy / New Age/ Publishers\n- Machine Drawing – P.S.Gill.\n- Machine Drawing – Luzzader\n- Machine Drawing – Rajput"
  },
  {
    "course code": "PRPL-10",
    "course title": "Fluid Mechanics and Machines (Practical)",
    "number of credits": "01",
    "prerequisites": "Fluid Mechanics and Machines (PRPC13)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "The objectives of the course are\n- To provide practical understanding of principles of fluid flow.\n- To compare the results of analytical models introduced in lecture to the actual behavior of real fluid flows\n- To discuss and practice standard measurement techniques of fluid mechanics and their applications\nList of Experiments:\n- To determine metacentric height of the ship model.\n- To verify the Bernoulli’s theorem.\n- To determine coefficient of discharge for an Orifice meter.\n- To determine coefficient of discharge of a venturimeter.\n- To determine the various hydraulic coefficients of an Orifice ( Cd ,Cc ,Cv).\n- To determine coefficient of discharge for an Orifice under variable head.\n- To calibrate a given notch.\n- To determine coefficient of discharge for a mouth piece.\n- To determine the Darcy Weisbach Coefficient of friction for flow through commercial pipes.\n- To determine critical Reynolds’ numbers for flow through commercial pipes.\n- To study development of boundary layer over a flat plate.\n- To measure the pressure distribution around a cylinder placed in the air stream and to calculate the coefficient of drag therefrom.\n- To study the momentum characteristics of a given jet.",
    "course outcomes": "At the end of the course, the students would be able to\n- Understand the principles of fluid flow using experiments\n- Measure the flow properties in a fluid flow such as: velocity, discharge, pressure, frictional losses etc.\n- Apply the principles of fluid mechanics in design.\n- Demonstrate the ability to prepare lab repo"
  },
  {
    "course code": "PRPL11",
    "course title": "Theory of Machines (Practical )",
    "number of credits": "1",
    "prerequisites": "Theory of Machines (PRPC14)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "To prepare students for kinematic and dynamic of various machines and mechanisms.\nList of Experiments:\n- To determine experimentally the ratio of cutting to idle time to the crank & slotted lever (QRM) & Compare the result with theoretical values. Plot the following:\n- θ v/s displacement of slider\n- θ v/s velocity\n- θ v/s acceleration\n\n\n\nTo determine velocity & acceleration of slider in Slider Crank mechanism and plot the following:\n- To determine velocity & acceleration of slider in Slider Crank mechanism and plot the following:\n- θ v/s displacement of slider\n- θ v/s velocity\n- θ v/s acceleration Compare the values of velocities and acceleration with those obtained theoretically. Assume W= 1 rad/sec\n\n\n\nTo determine the values of coefficient of friction between the screw & nut of jack while:\n- To determine the values of coefficient of friction between the screw & nut of jack while:\n- Raising the load\n- Lowering the load\n\n\n\nTo draw experimentally a curve of the follower displacement v/s cam angle. Differentiate the above curve to get velocity & acceleration plot & compare the values with those obtained analytically.\n\n\nTo determine the value of coefficient of friction between belt & pulley and plot a graph between log T1/T2, & θ and measure the slip and creep in belt drive.\n\n\nTo determine the value displacement, velocity and acceleration of driven shaft of Hook’s joint for a constant speed of the driven shaft.\n\n\nTo find experimentally the gyroscopic couple on motorized Gyroscope and compare with applied couple.\n\n\nTo find critical speed experimentally and to compare whirling speed of shaft with theoretical values\n\n\nTo perform the experiment of balancing of rotating parts and find unbalanced couples and force.\n\n\nTo find experimentally the Coriolli's component of acceleration and compare with theoretical values.\n\n\nTo study different types of Centrifugal governor\n\n\nTo measure Epicyclic Gear ratio between input shaft and output shaft\n- To draw experimentally a curve of the follower displacement v/s cam angle. Differentiate the above curve to get velocity & acceleration plot & compare the values with those obtained analytically.\n- To determine the value of coefficient of friction between belt & pulley and plot a graph between log T1/T2, & θ and measure the slip and creep in belt drive.\n- To determine the value displacement, velocity and acceleration of driven shaft of Hook’s joint for a constant speed of the driven shaft.\n- To find experimentally the gyroscopic couple on motorized Gyroscope and compare with applied couple.\n- To find critical speed experimentally and to compare whirling speed of shaft with theoretical values\n- To perform the experiment of balancing of rotating parts and find unbalanced couples and force.\n- To find experimentally the Coriolli's component of acceleration and compare with theoretical values.\n- To study different types of Centrifugal governor\n- To measure Epicyclic Gear ratio between input shaft and output shaft",
    "course outcomes": "Students are able to perform the static and dynamic analysis of mechanisms.\n- Should be able to perform the experiment on balancing of masses.\n- Able to perform the experiment on various mechanisms.\n- Able to perform the experiment of Coriolli’s component of acceleration.\n- Knowledge of Gyroscopic Motion ,Governors and Gear Trains."
  },
  {
    "course code": "PRPL-12",
    "course title": "Production Technology –I (Practical)",
    "number of credits": "1.0",
    "prerequisites": "Production Technology-I (PRPC16)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "To have hands on training by preparing various jobs in machine shop, foundry shop, welding shop\nList of Experiments:\n- To measure various angles of a single point cutting tool in ASA system\n- To measure various angles of Plain milling cutter\n- To Prepare a job on a lathe having various operations viz. drilling, boring, taper turning, thread cutting, knurling, etc.\n- To prepare a given job on milling machine\n- Prepare a wooden pattern of the given item considering allowances etc.\n- Prepare a mould and do casting of the pattern (Sl. No.3) prepared above.\n- Study of linear, angular measuring devices and to measure the linear and angular dimensions using various equipments.\n- To carry out welding by electric arc welding in flat, horizontal and vertical position of given jobs\n- Introduction to various grinding wheels and demonstration on the cylindrical and surface grinder.\n- Introduction to tool and cutter grinder and dynamometer.",
    "course outcomes": "The students will be able to measure various tool angles, carry out various operations on lathes, milling machine tools, precision measurements in metrology lab as well as welding of jobs"
  },
  {
    "course code": "PRPL-13",
    "course title": "Thermal Engineering (Practical)",
    "number of credits": "1.0",
    "prerequisites": "Thermal Engineering (PRPC17)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "- The objective of the thermal engineering laboratory is to introduce the student the fundamental theories and the industrial applications of thermodynamics.\n- This laboratory supports the courses for the undergraduate studies. Moreover, this laboratory also supports the advanced research in the area of thermal engineering.\nList of Experiments:\n- Study of 2 stroke petrol and diesel engine models.\n- Study of 4-stroke petrol/diesel engine model.\n- Study of boilers.\n- Study of Babcock- Wilcox boiler.\n- Study of Locomotive boiler.\n- Study of Lancashire boiler.\n- To study the Red wood viscometer and measure the viscosity of fluid.\n- To measure the flash point of the given fuel.\n- To study the Nestler boiler.\n- To study various parts of the vertical steam engine.\n- To study the Ruston Diesel engine and make a trial on it.",
    "course outcomes": "The students will learn about:\n- Performance study of I.C Engines and numerical analysis\n- Constitutive theory and Experimental study",
    "reference books": "- Thermal Engineering. Author, R. K. Rajput. Edition, reprint. Publisher, Laxmi Publications, 2010.\n- Internal Combustion Engines (S.I. Units) by V.M. Domkundwar.\n- A Course in thermal Engineering Domkundwar, s.; Kothandaraman, C. P..\n- R. K. Rajput; Title of the Book: Internal Combustion Engines; Publisher: Laxmi Publications, New Delhi; Year: 2007; Edition: 2\nSCHEME OF EXAMINATION\nB.Tech (Production & Industrial Engineering) 4th Semester\nB.Tech (Production & Industrial Engineering) 4th Semester Programme Elective (PE)"
  },
  {
    "course code": "PRPC-18",
    "course title": "Production Technology-II",
    "number of credits": "4.0",
    "prerequisites": "Production Technology-I (PRPC16)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- The objective of this course is to impart an in-depth knowledge of different manufacturing processes such as grinding, super-finishing, sheet metal working, metal forming and threading to the undergraduates.\n- The other objective of this course is to prepare the students to understand the selection criteria of conventional machining techniques.\n- To learn how to interpret a tool geometry and gain knowledge regarding the various tools.",
    "course content": "## Unit 1\n\nOperations and applications of surface, cylindrical, centre less and internal grinding processes, dressing, truing and balancing of grinding wheels, grading and selection of grinding wheels, Mechanics of grinding, machining time calculation. Principles and applications of honing, super finishing, lapping, polishing, buffing, peening, and burnishing. [11 hrs]\n\n\n## Unit 2\n\nIntroduction, classification of presses, shearing action, cutting forces, clearance and its effect, shear, angular clearance, stripper, center line of pressure and its mathematical calculation. Die materials, Die types, construction details of die set, auxiliary equipment, safety devices. Lathes: Centre, Capston and Turret. Universal Bar equipment, tool layout for simple parts. Automatic lathe: Introduction, classification, tooling layout. [12 hrs]\n\n\n## Unit 3\n\nPlastic deformation and yield criteria, relationship between tensile and shear yield stresses, Friction conditions in metal working, Analysis of forming processes: Rolling, forging, wire drawing, extrusion, temperature and lubrication aspect in metal forming, forming defects. [12 hrs]\n\n\n## Unit 4\n\nIntroduction; applications of screw threads, threads terminology, classification, methods of thread manufacturing: casting, thread cutting: single point & multi point tools, thread rolling, die threading, thread milling, thread grinding and tapping, calculation of blank size. [8 hrs]",
    "course outcomes": "By the end of this course, the student will have the:\n- Knowledge of various types of grinding and super-finishing operations. The students will be able to select proper grinding wheels and processes for particular material.\n- Knowledge of sheet metal operations, die-design and proper selection of dies for required product.\n- Knowledge of detailed analysis of metal forming processes, temperature and lubrication aspects in metal forming to minimize the energy losses and wear of equipments used for metal forming.\n- Knowledge of different methods for thread production as per the requirements.",
    "reference books": "- DeGarmo, E. P., Black, J.T., and Kohser, R.A., “Materials and Processes in Manufacturing”, Prentice-Hall of India.\n- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.\n- Groover, M.P., “Fundamentals of Modern Manufacturing”, John Wiley & Sons.\n- Lindberg, R.A., “Processes and Materials of Manufacture”, Prentice-Hall of India.\n- Boothroyed, G. et al., Fundamentals of Metal Cutting and Machine Tools, McGraw Hill.\n- Rao,P.N., “Manufacturing Technology”, Vol 1 & 2, Tata McGraw-Hill.\n- Ghosh and Mallik, “Manufacturing Science”, E.W. Press.\n- Pandey and Singh,“Production Engineering Science”.\n- Avitzur, B., “Metal Forming: Processes and Analysis”, Mc-Graw Hill."
  },
  {
    "course code": "PRPC-20",
    "course title": "Strength of Materials",
    "number of credits": "4",
    "prerequisites": "-",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To learn about the simple and compound stresses at a point in a material and its evaluation.\n- To understand the concept of strain energies that forms the basis of analysis in many cases.\n- To know about the shear forces, bending moments, bending stresses and shear stresses in a beam.\n- To study various methods to find the deflection of beams under various load conditions.\n- To study the various theories of failure of materials.\n- To study torsion of shafts and to know the stresses and deflections of various types of springs.\n- To learn about various types of stresses in thin cylinders\n- To study Euler theory and other formulae to find the stresses in long columns and struts.",
    "course content": "## UNIT- I\n\nSimple Stress and Strain\nConcept of stress and strain, normal and shear stresses, Hooke’s law, principle of St. Venant, Modulus of elasticity, Modulus of rigidity, stress-strain diagram, composite sections, statically indeterminate systems, temperature stresses, strain analysis, Poisson’s ratio, volumetric strain, factor of safety, tensile test diagram, elastic constants, relation between elastic constants. (5hrs)\nCompound Stress and Strain\nStresses on an inclined plane, principal stresses and principal planes, Mohr’s stress circle, three coplanar stresses, ellipse of stress, strain analysis, principal strains. (5hrs)\n\n\n## UNIT- II\n\nShear Force and Bending Moment Diagrams\nTypes of supports and beams, shear force, bending moment, relation between load, shear force and bending moment, shear force and bending moment diagrams for various types of loading and supports, maximum bending moment and point of contra flexure.\n(5hrs)\nStrain Energies and Theories of Failure\nStrain energy, resilience, strain energy in 3-D system, shear strain energy, shear strain energy in 3-D system, stresses due to various types of loading, Different theories of failure, significance, graphical representation. (4hrs)\n\n\n## UNIT- III\n\nBending Stress in Beams\nStresses due to simple bending, moment of inertia, beams with uniform bending strength, composite or flitched beams, Shear stress distribution, Variation of shear stress in beams of various sections. (5hrs)\nSlope and Deflection\nBeam differential equation, slope and deflection at a point, double integration method, Macaulay’s method, moment-area method, Castigliano’s theorem. (4hrs)\n\n\n## UNIT- IV\n\nTorsion\nDerivation of torsion equation and its assumptions, applications of the equation to the hollow and solid circular shafts, torsional rigidity, combined torsion and bending of circular shafts, close coiled helical springs. (4hrs) Thin Cylinders and Spheres\nThin cylinders subjected to internal pressure, Circumferential and longitudinal stresses and strains, Maximum shear stress, thin spherical shells subjected to internal pressure, wire winding of thin cylinders. (4hrs)\nColumns and Struts\nColumns under axial load, concept of instability and buckling, slenderness ratio, various end conditions, Euler's theory for initially straight columns, assumptions and limitations, empirical formulae. (4hrs)",
    "course outcomes": "After studying this course, students should be able to\n- Determine the values of stresses in materials under simple and compound loading\n- Draw shear force and bending moment diagrams for beams under different load conditions\n- Evaluate strain energies in materials under gradual, sudden and impact loading\n- Find shear and bending stresses in beams\n- Find slope and deflection of beams using different methods\n- Explain different theories of failure\n- Find the stresses in shafts under torsion\n- Find stresses in the thin cylinders\n- Deduce expressions for crippling load for columns with various types of end conditions",
    "reference books": "- G H Ryder, “Strength of Materials”, ELBS, 3rd edition, 1969\n- S S Rattan, “Strength of Materials”, Tata McGraw Hill, India, 3rd Edition, 2017\n- Beer P F and Johnston (Jr) E R, “Mechanics of Materials”, McGraw Hill Education, 7th edition, 2015.\n- Sadhu Singh “Strength of Materials”, Khanna Publishers, 3rd edition, 2001.\n- D K Singh, “Strength of Materials”, Ane Books India, 1stEdition, 2007.\n- Popov E P, “Engineering Mechanics of Solids”Prentice Hall of India, New Delhi, 2nd edition, 1999."
  },
  {
    "course code": "PRPC-21",
    "course title": "Operations Research",
    "number of credits": "4",
    "prerequisites": "NIL",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "Operations research has many applications in science, engineering, economics, and industry and thus the ability to solve OR problems are crucial for both researchers and practitioners. Being able to solve the real life problems and obtaining the right solution requires understanding and modeling the problem correctly and applying appropriate optimization tools and skills to solve the mathematical model.\nThe goal of this course is to-\n- Give a glimpse of the need of Operations research, its objectives, methodology and different OR models\n- Teach the students to formulate, analyze, and solve mathematical models that represent real-world industrial problems.\n- Make students enable to understand real world optimization problems and the basics of OR techniques such as linear programming, specific applications of LP such as transportation model, assignment model etc\n- Make students understand the decision making under conditions of uncertainly and risk",
    "course content": "## Unit-I\n\nIntroduction\nDevelopment of operations Research, characteristics and scope of operations research in management, Models in operations research, Model formulation, Types of mathematical models, limitations of operations Research. [4 hrs]\nLinear programming\nL.P. models, simplex method, the algebra of simplex method. (Minimization and Minimization problems). The big M method, post optimality analysis, essence of duality theory, application of sensitivity analysis. [8hrs]\n\n\n## Unit-II\n\nTransportation and Assignment\nIntroduction to Model, matrix terminology, formulation and solution of Transportation model (least cost method, Vogel’s Approximation method), least time transportation problem, assignment problems. [6 hrs]\nDecision Analysis\nSteps in decision theory approach, Decision making environment, Decision making under certainty and uncertainty, Decision making under conditions of risk, Decision trees, Advantages and limitations of decision tree solutions, post-optimality analysis. [8 hrs]\n\n\n## Unit-III Simulation\n\nIntroduction, applications of simulation, advantages and limitations of simulation technique. generation of random numbers, Time-flow mechanism, simulation languages. [4 hrs]\nQueuing Theory\nIntroduction, Applications of queuing theory, Waiting time and idle time costs, single channel queuing theory and multi channel queuing theory with Poisson arrivals and exponential services, Numerical on single channel and multi channel queuing theory. [6 hrs]\n\n\n## Unit-IV\n\nGame Theory\nTheory of games, competitive games, Rules and Terminology in game Theory, Rules for game theory- saddle point, dominance , mixed strategy (2 x 2 games), mixed strategy ( 2x n games or m x 2 games), mixed strategy (3 x 3 games), two person zero sum games, n –person zero sum games. [4 hrs]",
    "course outcomes": "Upon completion of this course, students will be able to:\n- Formulate a real-world industrial problem such as product mix problem, blending problem or portfolio management problem as a mathematical programming model.\n- Apply the theoretical workings of the simplex method for linear programming and perform iterations of it by hand.\n- Make decisions under conditions of risk and certainty and construct the multistage decision problem in the form of a decision tree\n- Solve specialized linear programming problems like the transportation and assignment problems, network models like the shortest path, minimum spanning tree, and maximum flow problems",
    "reference books": "- Introduction to Operation Research by Hiller and Lieberman, McGraw-Hill.\n- Operations Research by P.K. Gupta and D.S. Hira, S. Chand Publishers.\n- Operations Research: An Introduction by Hamady A. Taha, Pearson."
  },
  {
    "course code": "PRPL14",
    "course title": "Strength of Materials (Practical)",
    "number of credits": "1.0",
    "prerequisites": "Strength of Materials (PRPC20)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "The objectives of the course are:\n- To understand the behavior of materials under different tests like hardness, impact, tensile, etc\n- To understand the basic principles of strength of materials and structural analysis.\n- To understand the concept of stress and strain under different loading conditions.\n- To impart knowledge about the testing of springs and beams and behavior of materials.\n- To understand the mechanics of different testing machines like Servo hydraulic UTM, Servo electric UTM, etc.\nList of Experiments:\n- To study the Impact testing machine and to perform the impact tests (Izod and Charpy).\n- To study the Rockwell Hardness testing machine and find the Rockwell Hardness of the given specimen.\n- To study the Vickers Hardness testing machine and find the Vickers Hardness of the given specimen. 4. To study the Brinell Hardness Testing machine and find the Brinell Hardness of the given specimen.\n- To study the Erichsen Cupping machine and find out the Erichsen value of the given specimen of Sheet Metal.\n- To study the Strut-Testing Structure and to determine i) The Buckling Load of a Pinned-End Strut ii) The effect of End Conditions on the Buckling Load.\n- To study the Bending stress in a Beam Structure and to find the Bending Stress in a Beam.\n- To study the Torsion testing machine and to perform the Torsion test on a given specimen.\n- To study the Universal Testing Machine(UTM) and to perform the Tensile test.\n- To perform the Compression test on Universal Testing Machine (UTM).\n- To perform the Bending Test on Universal Testing Machine (UTM).\n- To find the Stiffness of a given Spring on Universal Testing Machine (UTM).\n- To perform the Fracture Mechanics Test on a Servo Hydraulic Universal Testing Machine of 100kN capacity.\n- To perform Low Cycle Fatigue Test on a Servo Hydraulic Universal Testing Machine of 100kN capacity.\n- To study the constant load creep behaviour of metals on a Servo Electric Universal Testing Machine of 100kN capacity.",
    "course outcomes": "At the end of the course, the students would be able to\n- Understand the procedure of doing different tests like hardness, compression, torsion, tension, impact, etc in various materials.\n- Understand the effect of stress and strain in different types of machines/structures under different loading conditions.\n- Describe the behavior of materials upon normal external loads.\n- Predict the behavior of the material under impact conditions.\n- Recognize the mechanical behavior of materials.\n- Measure the properties of the materials such as impact strength, tensile strength, compressive strength, hardness, ductility, etc."
  },
  {
    "course code": "PRPL-15",
    "course title": "Production Technology – II (Practical)",
    "number of credits": "1.0",
    "prerequisites": "Production Technology – II (PRPC18)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "To have hands on training by preparing various jobs in machine shop and welding shop, carry out foundry sand tests, non destructive testing of weldments and to introduce non-conventional manufacturing machine tools\nList of Experiments:\n- Practices of slab milling on milling machine.\n- To cut gear teeth on milling machine using dividing head.\n- Introduction to gear hobbing and practice on it.\n- Introduction and demonstration on Die-sinking EDM.\n- Introduction and demonstration of Wire-EDM.\n- To carryout welding using submerged arc welding.\n- To carryout welding using MIG welding set.\n- Introduction to weldments testing/inspection techniques and carry out its inspection/ testing.\n- Introduction to sand, mould testing equipments, moisture testing etc.\n- Introduction, demonstration and practice on CIM system",
    "course outcomes": "The students will be able to prepare gears on milling by simple indexing as well as on gear hobbing, welding by MIG and able to carry out various NDT tests on weldments as well as foundry sand."
  },
  {
    "course code": "PRPL-16",
    "course title": "Numerical Methods and Computer Programming (Practical)",
    "number of credits": "01",
    "prerequisites": "NIL",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "The purpose of this practical course is to provide students with the skills, knowledge and attitudes required to determine approximate numerical solutions by writing the computer program to mathematical problems which cannot always be solved by conventional analytical techniques, and to demonstrate the importance of selecting the right numerical technique for a particular application, and carefully analyzing and interpreting the results obtained.\nList of Experiments:\nThe source codes for the following problems are to be developed by the students and results should be verified.\n- Solution to Non-linear equation in single variable using the method of successive Bisection,\n- Solution to Non-Linear Equation in single variable using the Newton-Raphson method\n- Solution to Non-Linear Equation in single variable using the recant method.\n- Solution to a system of simultaneous algebraic equations using the Gaussian elimination procedure.\n- Solution to a system of simultaneous algebraic equations using the Gauss-Seidel iterative method.\n- Solution to a system of simultaneous algebraic equations using the Gauss-Seidel iterative method employing the technique of successive relaxation.\n- Numerical solution to an ordinary differential equation using the Euler’s method\n- Numerical solution to an ordinary differential equation using the Range-Kutta method\n- Numerical solution to an ordinary differential equation using the Predictor-corrector method\n- Numerical solution to an ordinary differential equation using the Euler’s method\n- Numerical solution to the Laplace equation using the method of Finite Differences.",
    "course outcomes": "On completion of this practical course , the students should be able to:\n- Apply appropriate algorithms to solve selected problems by writing computer programs.\n- Compare different algorithms with respect to accuracy and efficiency of solution.\n- Analyze the errors obtained in the numerical solution of problems.\n- Using appropriate numerical methods, determine the solutions to given non-linear equations.\n- Using appropriate numerical methods, determine approximate solutions to systems of linear equations.\n- Using appropriate numerical methods, determine approximate solutions to ordinary differential equations.\n2. Using appropriate numerical methods, determine approximate solutions to algebric equations"
  },
  {
    "course code": "PRPE-10",
    "course title": "Plant Layout & Material Handling",
    "number of credits": "3.0",
    "prerequisites": "Production Technology-I (PRPC16)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "The main objectives of this course are\n- To enable the students to be acquainted with basic concepts of plant layout including the objectives of good layout, principles and MH systems\n- To study about selection of material handling equipments and site location.\n- To explore the layout planning by following different algorithms, especially for designing of assembly line layout.\n- To make the students understand the different production layouts, their applications, features and limitations",
    "course content": "## Unit-I\n\nBasic Concepts of Plant Layout\nIntroduction of plant layout, Principles and objectives of effective layout, Advantages of good layout, Factors influencing plant layout- Material, Machinery, Man, Movement, Waiting, Service etc. Types of plant layout, their features, applications and comparison. Selection of appropriate layout and breakeven analysis [06 hrs]\nPlanning the Layout\nBasic steps in layout planning, computation of equipment requirements, plan general flow pattern, determination of space requirements, Tools and techniques of layout planning:- Operation process chart, Flow process chart, Flow diagram, String diagram, Travel Chart etc. [06 hrs]\n\n\n## Unit-II\n\nQuantitative layout analysis\nLoad distance analysis, Travel Chart, Operation Sequence analysis, Activity relationship chart, Systematic layout planning, Objectives of Line Balancing, Constraints in Line Balancing problems, Preventive measures to achieve a balanced production line, Types of Line Balancing; (a) Assembly Line Balancing (b) Fabrication Line Balancing, heuristic and other methods of Line Balancing. Numerical problems on Line Balancing. [06 hrs]\nPlant Location\nObjectives of location decision, factors influencing location, General procedure of site selection, evaluation of location- breakeven analysis, Median model, gravity model, Factor rating methods, multi-attribute models and dimensional analysis model [06 hrs]\n\n\n## Unit-III\n\nMaterial Handling\nObjectives of material handling, Functions and principles of material handling, Methods of material handling, Types of material handling systems, Basic features of material handling, Various material handling considerations including combined handling, Space for movements.\n[06 hrs]\nMaterial Handling Equipment\nIntroduction, Types of material handling equipment, Selection and maintenance of material handling equipment, characteristics of material handling equipment such as Conveyers, Cranes, Hoist, Mobile equipment etc., Economical and Technical considerations of handling equipment.\n[06 hrs]",
    "course outcomes": "- The students will be able to select appropriate location for establishing industrial plants by applying the concepts of location selection.\n- The students will be able to plan and design plant and production layouts through basic strategies.\n- The students will be able to identify and analyze the problems in the existing layout/ material handling system and shall be able to modify the layout/ material handling system\n- The students will be able to apply basic concepts for planning layouts for typical applications in the industries and Suggesting appropriate material handling strategies in the industries.",
    "reference books": "- Plant Layout and Materials Handling by G.K. Aggarwal, M/S Jain Brothers, New Delhi\n- Plant Layout and Design by James Moore, The Macmillan Co, New York.\n- Practical Plant Layout by Richard Muther\n- Manufacturing Plant Layout: Fundamentals and Fine Points of Optimum Facility Design by Edward J. Phillips, Society of Manufacturing Engineers"
  },
  {
    "course code": "PRPE-11",
    "course title": "Engineering Economy",
    "number of credits": "03",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "This course emphasizes the strong correlation between engineering design and manufacturing of products/systems and the economic issues they involve. The following learning objectives are to be achieved-\n- The basic concepts of the time value of money and economic equivalence\n- To incorporate different cash flows, the cost of funds, capital, operational and maintenance costs, salvage value, depreciation, amortization, and taxation in the economic analysis of engineering projects\n- To apply different economic analysis methods – like present worth, annual-equivalent worth, rate-of-return, life-cycle cost etc in evaluation of the economic viability of a project\n- To enable the students to make replacement decisions, capital-budgeting decisions, and evaluate project risk and uncertainty.",
    "course content": "## Unit-I Introduction\n\nNature and purpose of engineering economy studies, functions of engineering economy, physical and economic laws, consumer and producer goods. [4 hrs]\nInterest and Annuity Relationships\nProductivity of capital, nominal and effective interest, interest factors, CAF, PWF, SPWF, SCAF, SFF, and CRF, deferred annuities, perpetuities and capitalized cost, equivalence, gradient factors, GPWF and GUSF. [6 hrs]\n\n\n## Unit-II Depreciation\n\nClassification of depreciation, methods of computing depreciation, economic life and mortality data, capital recovery and return. [6 hrs]\nIndustrial Costing\nClassification of costs: Direct material, direct labour and overheads, fixed and variable cost, semi- fixed cost, increment, differential and marginal cost, sunk cost and its reasons, direct and indirect cost, prime cost, factory cost, production cost and total cost. [6 hrs]\n\n\n## Unit-III\n\nCost Analysis\nBreak-even analysis, two and three alternatives, graphical solution, break-even charts, effects of changes in fixed and variable cost, minimum cost analysis, economic order quantity, effect of risk and uncertainty on lot size. [4 hrs]\nReplacement Studies\nReason of replacement, evaluation of proposals, replacement because of inadequacy, excessive maintenance, declining efficiency, obsolescence, MAPI formula. [6 hrs]\n\n\n## Unit-IV\n\nCost Estimation\nDifference between cost estimation and cost accounting, qualifications of an estimator, estimating procedure, estimate of material cost and labour cost, estimate of cost in machining, forging, welding and foundry operations. [6 hrs]\nEconomy Study Patterns\nBasic economy study patterns and their comparison, effect of taxation on economic studies.\n[4 hrs]",
    "course outcomes": "The course is targeted at enabling the students to-\n- Apply the appropriate engineering economics analysis method(s) for problem solving: present worth, annual cost, rate-of-return, payback, break-even, benefit-cost ratio.\n- Evaluate the cost effectiveness of individual engineering projects using the methods learned and draw inferences for the investment decisions.\n- Compare the life cycle cost of multiple projects using the methods learned, and make a quantitative decision between alternate facilities and/or systems.\n- Compute the depreciation of an asset using standard depreciation techniques to assess its impact on present worth.",
    "reference books": "- Leland Blank, Anthony Tarquin; Engineering Economy, McGrawhill Education (India), New Delhi, 2017.ISBN13: 978-1-25-902740-6\n- William G. Sullivan, C. Patrick Koelling; Engineering Economy, Pearson Education (Asia), 2017.\n- Grant, E.L., Grant, W., and Leavenworth, R.S., Principles of Engineering Economy, John Wiley & Sons, 2015.\n- Eschenbach , T.G., Engineering Economy by Applying Theory to Practice, Oxford University Press, 3rd edition, ISBN-13: 978-0199772766"
  },
  {
    "course code": "PRPE-12",
    "course title": "MECHATRONICS",
    "number of credits": "03",
    "prerequisites": "Fluid Mechanics and Machines (PRPC13), Theory of Machines (PRPC14)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand the basic concepts of mechatronics, digital technology and their applications.\n- To understand the functioning of various types of sensors, transducers and their applications.\n- To understand the concept of pneumatic, hydraulic and mechanical actuation systems.\n- To perceive the functioning of microprocessors, Programmable logic controllers, their architecture, structure and applications.\n- To understand the basics of robotics, robot types, their drive systems and applications.",
    "course content": "## Unit-I\n\nIntroduction to Mechatronics and its Systems\nEvolution, Scope, Measurement Systems, Control Systems, open and close loop systems, sequential controllers, microprocessor based controllers, mechatronics approach. [5 hrs]\n\n\n## Unit-II\n\nBasics of Digital Technology\nNumber System, Boolean algebra, Logic Functions, Karnaugh Maps, Timing Diagrams, Flip- Flops, Applications. [5 hrs]\n\n\n## Unit-III\n\nSensors and transducers\nIntroduction, performance terminology-Displacement, Position and Proximity, Velocity and motion, force, Fluid Pressure-Temperature Sensors-Light Sensors-Selection of Sensors-Signal Processing. [6 hrs]\n\n\n## Unit-IV\n\nPneumatic and Hydraulic actuation systems:\nActuation systems, Pneumatic and hydraulic systems, directional control valves, pressure control valves, cylinders, process control valves, rotary actuators. [5 hrs]\n\n\n## Unit-V\n\nMechanical actuation systems\nMechanical systems, types of motion, kinematics chains, cams, gear trains, ratchet and pawl, belt and chain drives, bearings, mechanical aspects of motor selection. [5 hrs]\n\n\n## Unit-VI Microprocessor\n\nIntroduction, Architecture, Pin Configuration, Instruction set, Programming of Microprocessors using 8085 instructions-Interfacing input and output devices-Interfacing D/A converters and A/D converters, Applications, Temperature control, Stepper motor control, Traffic light controller.\n[6 hrs]\n\n\n## Unit-VII\n\nProgrammable Logic Controller\nIntroduction, Basic structure, Input/Output Processing, Programming, Mnemonics, Timers, Internal relays and counters, Data handling, Analog Input/Output, Selection of a PLC. [4 hrs]\n\n\n## Unit- VIII Robotics\n\nIntroduction, types of robots, Robotic control, Robot drive systems Robot end effectors, selection parameters of a robot, applications. [4 hrs]",
    "course outcomes": "At the end of the course student will be able to\n- Understand the basic concepts of mechatronics, digital technology and their applications.\n- Understand the functioning of various types of sensors, transducers and their applications.\n- Understand the concept of pneumatic, hydraulic and mechanical actuation systems.\n- Perceive the functioning of microprocessors, Programmable logic controllers, their architecture, structure and applications.\n- Understand the basics of robotics, robot types, their drive systems and applications.",
    "reference books": "- Bolton W., “Mechatronics”, Longman, Second Edition, 2004.\n- Histand Michael B. and Alciatore David G., “Introduction to Mechatronics and Measurement Systems”, McGraw Hill International Editions, 2003.\n- Kamm, M.L.J., Mechatronics, Prentice Hall of India, New Delhi (2007).\n- HMT Ltd., “Mechatronics”, Tata McGraw Hill Publishing Co. Ltd., 1998.\n- Nitaigour Premchand Mahalik, “Mechatronics Principles, Concepts and Applications”, Tata McGraw-Hill publishing company Ltd, 2003.\n- Auslander, D. M. and Kempf, C. J., Mechatronics: Mechanical System Interfacing, Prentice Hall, New Jersy (1996)."
  },
  {
    "course code": "PRPE-13",
    "course title": "Introduction to MATLAB Programming",
    "number of credits": "3",
    "prerequisites": "Basics of Programming (CSIR 11)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- Become familiar with the main features of the MATLAB integrated design environment and its user interfaces .\n- Understand the MATLAB Desktop, Command window and the Graph Window .\n- Able to do simple and complex calculation using MATLAB.\n- Able to understand how to automate commands with scripts ,\n- To Increase automation by encapsulating modular tasks as user-defined functions.\n- Understand the tools that are essential in solving engineering problems",
    "course content": "## UNIT-I\n\nIntroduction to MATLAB, MATLAB Windows, Variables, Keywords, Special variables, Managing the workspace, Complex Numbers, Number display formats, Mathematical functions, MATLAB search path, Script M-File use, Use of Special functions-disp, input, pause, waitfor buttonpress, Comments, Block comments, punctuation and aborting execution, Simple arrays, Array addressing, Array construction, array orientation,, scalar-array mathematics, array-array mathematics, standard arrays, array manipulation, array sorting, subarray searching, array manipulation functions, array size, multidimensional arrays [6 hrs]\n\n\n## UNIT-II\n\nNumeric Data types- integer data types, floating point data types, cell array creation, cell array manipulation, retrieving cell array content, cell functions, structure creation, structure manipulation, retrieving structure content, structure functions, Relational operators, logical operators, operator precedence, relational and logical functions [6 hrs]\n\n\n## UNIT-III\n\nControl flow-for loops, While loops, if-Else-End, Switch-Case, Try-Catch block [6 hrs] UNIT -IV\nM-FILE function construction rules, input and output arguments, nested functions, Function handles and anonymous functions [5 hrs]\nTwo dimensional graphics- The plot function, Line style, Markers, Colors, plot grids, axes box and labels, Customizing plot axes, Multiple plots, Multiple figures, Subplots, Interactive plotting tools, Specialized 2D plots, Three- Dimensional graphics- Line plots, Scalar functions of two variables, Mesh plots, Surface plots, Contour plots, How to do Debugging in MATLAB, Native data files, directory management [5 hrs]\n\n\n## UNIT - V\n\nBasic statistical analysis, basic data analysis, data analysis and statistical functions, one dimensional interpolation, two dimensional interpolation, polynomials (roots, multiplication, division, addition, derivative and integral),curve fitting [6 hrs]\nString Construction, Numbers to strings to numbers, string evaluation, string functions, cell arrays of strings [6 hrs]",
    "course outcomes": "- Student will be able to generate matrix and manipulate matrix\n- Student will be able to use cell , structures and manipulate strings\n- Student will be able to use control flow statements\n- Student will be able to write script file\n- Students will be able to use functions\n- Students will be able to plot 2-D and 3-D graphs\n- Students should be able to perform statistical analyses on data, data interpolation and manipulation of polynomials\nText and Reference Books:\n- Mastering MATLAB 7 BY Duane Hanselman, Bruce Lttle field\n- MATLAB Programming for Engineers by Stephen J. Chapman\n- Introduction to MATLAB for Engineers by William J. Palm III\n- A Guide to MATLAB: For Beginners and Experienced Users by Brian R. Hunt"
  },
  {
    "course code": "PRPE-14",
    "course title": "Nuclear Engineering",
    "number of credits": "03",
    "prerequisites": "Thermal Engineering (PRPC17)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To be able to understand the concepts of neutron physics and various nuclear Processes involved in Nuclear Power Plants.\n- To be able to calculate heat generation from nuclear reaction.\n- To be able to design and analyze the performance of nuclear power plants.\n- To get acquainted with applications of radioactivity.\n- To be able to appreciate the hazards associated with radioactivity and the necessity of waste disposal.",
    "course content": "## UNIT -I\n\nConcepts of Nuclear Physics\nThe atom, structure, the nucleus, nuclear structure, atomic transmutation of elements, detection of radio-activity, particle accelerator, decay, natural of elements, nucleus interactions, decay rates, half-life, transuranic elements. [6 hrs]\n\n\n## UNIT -II\n\nNeutorn Interaction\nAdvantages of using neutron, neutron moderation, fission chain reaction, thermalisation of neutrons, fast neutrons, prompt and delayed neutrons, fission products. [4 hrs]\n\n\n## UNIT -III\n\nEnergy Release\nMass energy equivalence, mass defect, binding energy, energy release in fission & fusion, thermonuclear reaction, fusion bomb. [4 hrs]\n\n\n## UNIT -IV\n\nReactor Materials\nFissile & fertile materials, cladding & shielding materials, moderators, coolants. [4 hrs]\n\n\n## UNIT -V\n\nReactor Technology\nBasic principles, fuel assembly, neutron balance, reactor kinetics, reactor coefficients, reactor stability, excess reactivity, Xenon poisoning, burnable absorbers, reactivity control, heat balance, production& transfer of heat to the coolant, structural considerations. [10 hrs]\n\n\n## UNIT -VI\n\nNuclear Reactors\nTypes of nuclear reactors, pressurized water reactors, boiling water reactors, CANDU type reactors, gas cooled & liquid metal cooled reactors, fast breeder reactors. [6 hrs]\n\n\n## UNIT -VII\n\nSafety Considerations & Waste Disposal\nHazards, plant site selection, safety measures incorporated in; plant design, accident control, disposal of nuclear waste. [4 hrs]\n\n\n## UNIT -VIII\n\nHealth Physics & Radio-isotopes\nRadiation: units, hazards, prevention, preparation of radio-isotopes & their use in medicine, agriculture & industry. [2 hrs]",
    "course outcomes": "At the end of the course student will be able to\n- understand the concepts of neutron physics and various nuclear Processes involved in Nuclear Power Plants.\n- calculate heat generation from nuclear reaction.\n- design and analyze the performance of nuclear power plants.\n- get acquainted with applications of radioactivity.\n- appreciate the hazards associated with radioactivity and the necessity of waste disposal.",
    "reference books": "- M. M. El-Wakel, Nuclear Power Engineering, McGraw Hill\n- Shultis and Faw, Fundamentals of Nuclear Science and Engineering, CRC Press\n- Stephenson, Introduction to Nuclear Engineering, McGraw Hill\n- Murray, Nuclear Energy, Butterworth-Heinemann"
  },
  {
    "course code": "PRPE-15",
    "course title": "Composite Materials",
    "number of credits": "03 Credits, 03 Lectures/week",
    "prerequisites": "Material Science (PRPC15), Production Technology- I (PRPC16)",
    "course type": "PE",
    "branch": "pie",
    "course content": "Course Learning Objective:\nThe objective of this course is to impart the knowledge of various types of composites, their uses, properties, manufacturing, designing, testing and selecting a composite for particular requirement.\n\n\n## Unit -I\n\nIntroduction of Composite materials; concept of composite, application areas of composite materials, classification of composites, advantages of composites and their limitations, reinforcements; types of fibres and particles, matrix; types of matrix materials. [8 hrs]\n\n\n## Unit -II\n\nFibres; glass fibres, carbon fibre, aramid fibre, boron fibre, ceramic & metallic fibres, properties and their manufacturing techniques, Matrices; metal matrix, polymer matrix, ceramic matrices, selection criteria, properties and manufacturing, [8 hrs]\n\n\n## Unit -III\n\nManufacturing of metal matrix composites; liquid infiltration, squeeze casting, ultrasonic stir casting, spray forming/thermal spraying, powder metallurgy, etc,, Manufacturing of polymer matrix composites; hand layup, spray-up, filament winding, pultrusion, etc, Ceramic matrix composites; slurry impregnation, sol-gel, chemical vapour deposition. Laminated composites; centrifugal casting, adhesive bonding, vacuum bagging, explosive bonding, etc. [10 hrs]\n\n\n## Unit -VI\n\nMechanics of composites; mass, volume fraction, density, mechanical properties; prediction of elastic constants, mechanics of load transfer from matrix to reinforcement, fatigue and fracture behaviour of composites, testing and failure analysis of the composites [8 hrs]\nCourse outcome:\n- The students will have the understanding of various types of composite materials, their properties and application area.\n- The students will have the knowledge of manufacturing of different types of composites.\n- The students will be able to select the existing or design the new composite materials for a particular requirement.\n- The students will be able to evaluate the performance and cause of failure of composite materials in-service.",
    "reference books": "- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.\n- Groover, M.P., “Fundamentals of Modern Manufacturing”, John Wiley & Sons.\n- Chawla, K.K., “Composite Material: Science & Technology”, Springer.\n- Berbero, E.J., “Introduction to Composite Materials Design”, CRC Press.\n- ASM Handbook, Volume 21: Composites, ASM International\nB.Tech (Production & Industrial Engineering) 5th Semester\nB.Tech 5th (Production & Industrial Engineering) Semester Programme Elective (PE)"
  },
  {
    "course code": "PRPC-22",
    "course title": "Production Technology-III",
    "number of credits": "4.0",
    "prerequisites": "Production Technology-II (PRPC18)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To understand the basic concepts of powder metallurgy.\n- To understand the gear manufacturing and their finishing processes.\n- To understand the basic concepts of composite materials.\n- To understand the fundamental concepts of welding and design considerations in casting.",
    "course content": "## Unit-I\n\nPowder Metallurgy\nTheory of powder metallurgy, manufacture of metal powders, sintering, secondary operations, properties of finished parts, design considerations and applications. [5 hrs]\n\n\n## Unit-II\n\nGear Manufacturing and Broaching\nClassification of gear production methods, gear forming, gear generation: gear hobbing, gear shaping, production of helical, spur, and bevel gears, gear finishing methods: shaving, burnishing, grinding, lapping, honing, Broaching: Broach, cutting action of broach, broaching operations, broaching machines, mechanics of broaching and machining time calculation. [5 hrs]\n\n\n## Unit-III\n\nComposite Materials and Their Processing:\nIntroduction, Types of Composites materials, Agglomerated Materials, Reinforced materials, Laminates, Surface Coated Materials, Production of Composite Structures, Fabrication of particulate composite Structures, Fabrication of reinforced Composite, Fabrication of Laminates, Machining, Cutting and Joining of Composites. [5 hrs]\n\n\n## Unit-IV\n\nTheory of Welding\nThermal effects in welding, structure in weld and heat affected zone, distortion and residual stresses, weldability or joinability, weld quality, welding of Cast Iron, Stainless Steel, Aluminium, non-destructive examiniation of weldments/materials/castings: Magnetic particle test, Liquid penetrant test, Electromagnetic methods, Radiography, Holography, Ultrasonic methods; gas and arc cutting. [12 hrs]\n\n\n## Unit-V\n\nFoundry and casting\nSand testing, solidification phenomenon, melting furnaces; Cooling and solidification of castings, cooling curves, nucleation and dendrite formation, gating system : Pouring time, choke area, sprue, pouring basin, sprue base well, Gating ratios, in-gate design, Slag trap systems : runner extension, whirl gate, Riser Design: Caine’s method, Modulus method, Naval research laboratory method, feeding distances, chills, grouping castings, feeding aids. [13 hrs]",
    "course outcomes": "At the end of the course, student will be able to\n- Explain the applications of powder metallurgy in manufacturing sector\n- Classify the various gear manufacturing process along with their finishing processes\n- Fabricate the composite materials\n- Test the weld quality and design the various elements of casting.",
    "reference books": "- Sharma P C, “ Production Engineering”, S Chand & Company,1997.\n- Heine, R.W., Loper, C.R. and Rosenhal, P.C., “Principles of Metal Casting”, TMH.\n- Flinn, R.A.,” Fundamentals of Metal Casting”, Addison-Wesley.\n- P.N. Rao, “Manufacturing Technology”, TMH\n- Pandey and Singh, “Production Engineering Sciences”\n- Ghosh & Mallik, Manufacturing Science, Affiliated East West Press.\n- DeGarmo, E. P., Black, J.T., and Kohser, R.A., “Materials and Processes in Manufacturing”, Prentice-Hall of India.\n- Kalpakjian, S., and Schmid, S.R., “Manufacturing Engineering and Technology”, Pearson Education.\n- Groover, M.P., “Fundamentals of Modern Manufacturing”, JohnWiley & Sons.\n- Malhotra, “Handbook on Non-destructive Testing of Concrete”, Publisher: CRC Press, 2002.\n- Mix, Paul E, “Introduction to Nondestructive Testing: A Training Guide”, John Wiley and Sons Ltd, 1999.\n- Blitz and Jack, “Electrical and Magnetic Methods of Nondestructive Testing”, Institute of Physics Publishing, 2001.\n- Henrique L M, “Non Destructive Testing and Evaluation for Manufacturing and Construction”, Hemisphere Publishers, New York, 2001.\n- Kuo, S., “Welding Metallurgy”, John Wiley & Sons 2003\n- Dieter, G.E., “Mechanical Metallurgy”, McGraw-Hill 1988."
  },
  {
    "course code": "PRPC-23",
    "course title": "Production Planning and Control",
    "number of credits": "4.0",
    "prerequisites": "Production Technology-II (PRPC18)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "This subject provides students with:-\n- An understanding of the concepts of production and service systems.\n- The ability to apply principles and techniques in the design, planning and control of these systems to optimise/make best use of resources in achieving their objectives.\n- The ability to identify different strategies employed in manufacturing and service industries to plan production and control inventory.\n- To measure the effectiveness, identify likely areas for improvement, develop and implement improved planning and control methods for production systems.",
    "course content": "## Unit-I\n\nIntroduction, functions of production planning and control, objectives of PPC, importance of PPC, preplanning, production planning, production control, other components of PPC, simplification and standardization, time and motion study. [4 hrs]\nManufacturing System\nProduction system, Job production, Batch production, continuous production, size of plants, type of industry. [3 hrs]\n\n\n## Unit-II\n\nIntroduction to MRP and JIT\nIntroduction, MRP concept , inputs to MRP , working of MRP, MRP outputs, MRP calculations, lot sizing in MRP, MRP-II, concept of JIT manufacturing system, characteristics, goal and elements of JIT, push and pull production system. [4 hrs]\nSupply chain management\nIntroduction and overview of SCM, concept of supply chain, value creation in supply chain, value chain models, supply chain activities, SCM business process integration, strategic consideration for supply chain, distribution, logistics engineering, inbound and out bound logistics. [4 hrs]\n\n\n## Unit-III\n\nSales forecasting\nIntroduction, definition, objectives and importance of forecasting, need for forecasting, types of forecasting, process of sales forecasting, factors affecting forecasting, criteria for a good sale, forecasting techniques: casual and time series analysis, moving average, exponential smoothing. Trend and seasonality. [6 hrs]\nInventory Control\nDefinition, classification, objectives of inventory control, functions, economic order quantity, deterministic and probabilistic inventory models. Numerical on inventory control. Inventory carrying costs, factors affecting inventory costs. V.E.D. analysis, S-D-E analysis, F-S-N analysis H-M-L analysis and ABC analysis. Safety stocks, their objectives safety stocks and service levels. [8 hrs]\n\n\n## Unit-IV\n\nProject scheduling with CPM and PERT\nIntroduction, objectives and applications of network analysis, basic concept in networks, difference between CPM and PERT, network conventions, numbering of events (Fulkerson’s rule), determination of critical path, optimizing through CPM, PERT, resources allocation.\n[8 hrs]\nLoading and Scheduling\nIntroduction, Scheduling Procedure, Master Schedule, its objectives, Order scheduling, Loading by scheduled period, Dispatching, Job card, Job order. Commercial Loading & Scheduling Devices. [5 hrs]",
    "course outcomes": "Upon completion of the subject, students will be able to-\n- Apply the systems concept for the design of production and service systems.\n- Make forecasts in the manufacturing and service sectors using selected quantitative and qualitative techniques.\n- Apply the principles and techniques for planning and control of the production and service systems to optimize/make best use of resources.\n- Understand the importance and function of inventory and to be able to apply selected techniques for its control and management under dependent and independent demand scenerios.",
    "reference books": "- Production Planning and control: Samuel Eilon\n- Production Planning and Control: K.C. Aggarwal & K.C. Jain\n- Industrial Engg. & Operation Management by S.K. Sharma & Savita Sharma.\n- Production Planning and Control: King J.R.\n- Production Planning and Control: Sharma, Hari Rraghu Rama."
  },
  {
    "course code": "PRPC-24",
    "course title": "Metrology",
    "number of credits": "4.0",
    "prerequisites": "Production Technology- II (PRPC18)",
    "course type": "PC",
    "branch": "pie",
    "course objectives": "- To educate students on different measurement systems and different types of errors identified.\n- To introduce measuring equipment for linear and angular measurements.\n- To familiarize students with roundness, surface roughness, screw, threads and gear elements on inspection machines.",
    "course content": "## Unit -I\n\nMeaning of Metrology, Objectives of Metrology, Necessity and Importance of Metrology, Precision Measurement –Its need. Limits, Fits and Tolerance, Classification of Measuring Instruments, Classification of Methods of Measurements.\nDefinitions, Classification of Measuring Equipments, Principles of Mechanical Measuring Instruments, Principles of Optical Instruments -Reflection, Refraction, Lenses, Interference, Optical prisms & Optical projectors, Principles of Electrical Measuring Instruments, Principles of Pneumatic Measuring Instruments. [10 hrs]\n\n\n## Unit -II\n\nCalipers, Vernier Calipers, Vernier Height Gauge, Vernier Depth Gauge, Micrometers - Description of micrometer, types of micrometers, Advantages and Limitations of commonly used Precision Instruments.\nAngular Measurements, Introduction, Instruments for Angular Measurement -Protractors, Sine bars, Sine table, Sine center, Angle gauges, Spirit level & Clinometers, Taper Measurement - Gauges for Tapers, Taper Measuring Instruments. [10 hrs]\n\n\n## Unit-III\n\nIntroduction, Classification of Threads, Elements of Screw Threads, Specifications of screw Thread, Measuring Elements of a Screw thread, External Screw Thread Measurements, Internal Screw Thread Measurements, Screw Thread Gauges.\nIntroduction, Types of Gears, Methods of making Gears, Forms of Gear Teeth, Involutes curve, Gear Tooth Terminology, Measurement of Tooth thickness, Measurement of Tooth Profile, Measurement of pitch.\nCircularity, Roundness and Circularity, Measurement of Circularity-Devices Used, V-block and dial indicator, Precision measuring instruments, Measurement of Roundness of Machined Shafts.\n[10 hrs]\n\n\n## Unit- IV\n\nThe Comparator, Desirable Features of a Comparator, Use of Comparators, Types of Comparators, Mechanical Comparators -Dial Indicator, Optical Comparators, Electrical and Electronic Comparators, Pneumatic Comparators, Limit Gauges, Toolmaker’s Microscope. Methods of Measuring Surface Finish, Profile Projector, Combination set, Surface Plate, and Miscellaneous Gauges. [10 hrs]",
    "course outcomes": "- Students will have the knowledge of various equipments needed for precise measurement in the industries.\n- Students will be able to work in quality control and quality assurances divisions in industries.\n- Students will be able to maintain quality in engineering products.",
    "reference books": "- A.K. Bewoor & V.A. Kulkarni, “Metrology and Measurements”, McGraw Hill Education.\n- N.V. Raghvendra & L. Krishnamurthy, “Engineering Metrology and Measurements”, Oxford Higher Education.\n- O.P.Khanna, “Metrology and Instrumentation”, Dhanpat Rai Publications.\n- M. Mahajan, “A Text Book of Metrology”, Dhanpat Rai Publications.\n- R.K. Jain, “Engineering Metrology”, Khanna Publications."
  },
  {
    "course code": "PRPC-25",
    "course title": "MACHINE DESIGN",
    "number of credits": "04",
    "prerequisites": "Strength of Materials (PRPC20), Theory of Machines (PRPC14),",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To understand the behavior of a machine component subjected to different loads and recognizing the failure criterion.\n- To identify the stresses induced in a machine component and design it to avoid failure using theories of failure.\n- Apply design methods for mechanical components such as gears, springs to meet the required criteria, along with strength requirements.\n- Apply engineering principles to open ended design problems.",
    "course content": "## Unit-I\n\nBasics Concepts & Design for Strength\nDesign methodology, Design criterion based on fracture, deformation and elastic stability, design stress, factor of safety Selection of Engineering Materials, Theories of Failure [4 hrs]\nStress concentration, causes and mitigation, Endurance limit, Notch sensitivity, Factors affecting endurance limit, Design for finite and infinite life. Soderberg and Goodman diagram. [4hrs]\n\n\n## Unit-II\n\nDesign of Joints:\nRiveted joints for boiler shell according to I.B.R., riveted structural joint and riveted joint with eccentric loading. Types of welded joints, strength of welds under axial load, welds under eccentric loading. Designation of various types of bolts and nuts. Design of bolted joints, bolts of uniform strength. Bolted joints with eccentric loads. [5 hrs]\n\n\n## Unit-III\n\nDesign of Shaft, Keys and Couplings:\nDesign of shafts subjected to pure torsion, pure bending load. Combined bending and torsion, combined torsion, bending and axial loads. Design of keys, Types of shaft couplings. Design of sleeve or muff coupling, flange coupling and bush type flexible couplings. [5 hrs]\n\n\n## Unit-IV\n\nDesign of Mechanical Springs:\nIntroduction, Helical springs: stress analysis, deflection analysis, spring materials, styles of ends. Design against static and fluctuating loads: Design of leaf springs [6 hrs]\n\n\n## Unit-V\n\nDesign of Gears:\nIntroduction: spur gear, helical gear. Calculation of load carrying capacity, design of spur and helical gears for dynamic and wear loads, bearings reactions [6 hrs]\n\n\n## Unit-VI\n\nDesign of Bearings:\nIntroduction, Classification of bearings, selection of bearings, sliding contact bearings. types, materials, lubricants, properties of lubricants, hydrodynamic lubrication and design of hydrodynamic journal bearing: Rolling contact bearings: types, selection of rolling contact bearings and comparison of rolling and sliding contact bearing. [6 hrs]",
    "course outcomes": "At the end of the course student will be able to\n- Apply and implement design concepts\n- Design a machine component to meet strength requirements\n- Identify the failure modes and design the components like gears, springs etc.",
    "reference books": "- Shigley, J.E., and Mischke, C.R., Mechanical Engineering Design, McGrawHill International Editions, New York, Edition VI, 2003\n- V B Bhandari, Design of Machine Elements, 2nd Ed., Tata Mcgraw Hill, 2007.\n- Design Data Book of Engineers, Compiled by Faculty of Mechanical Engineering, PSG College of Technology, Publisher KalaikathirAchchagam, Coimbataore, 2009.\n- M.F Spotts, T.E Shoup, L.E. Hornberger, S.R Jayram, and C. V. Venkatesh, Design of Machine Elements, 8th Ed., Person Education, 2006\n- Paul H Black and O. E. Adams, P., Machine Design, 3/e, Mc Graw Hill Book Company, Inc., New York, USA., 2007.\n- R. C Juvinall and K. M Marshek, Fundamentals of Machine Component Design, 3rd Ed., Wiley Student Edition, 2007.\n- Robert L. Norton,Machine Design – An Integrated Approach, Prentice-Hall Inc.\n- V B Bhandari, Machine Design Data Book"
  },
  {
    "course code": "PRPL-17",
    "course title": "Metrology (Practical)",
    "number of credits": "01",
    "prerequisites": "Metrology (PRPC24)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "The objectives of this course are to enable the student:\n- to use precise linear and angular measuring devices.\n- to learn the correct usage and handling of different types of gauges and comparators.\n- to conduct, analyse, interpret, and present measurement data from measurements experiments.\n- to demonstrate excellent laboratory skills and techniques including the proper use of relevant instruments and related technology .\nList of Experiments:\n- Introduction to metrology lab, its significance and various measuring instruments.\n- To measuring the angle of taper rod using sine bar and slip gauges.\n- To measure the angle and width of V-groove using optical bevel protractor.\n- To measure the gear tooth thickness by using gear tooth vernier calliper.\n- To measure the element of screw thread using digital tool maker microscope.\n- To understand the construction and working principle of standard basic instruments, straight edge radius gauge, screw pitch gauge, feeler gauge.\n- To find unknown angle of component using sine bar and verify it by using bevel protractor.\n- To compare the flatness of a given surface using optical flats.\n- To measure screw thread elements by using optical profile projector.\n- To measure the surface roughness of a machined surface using surface profilometer.\n- To measure grain size and microstructure of a given material using metallurgical microscope.",
    "course outcomes": "By the end of this course:\n- The student shall be measuring the various parameters like length, height, angle, displacement, flatness etc., by using various instruments like Vernier calipers, micrometer, dial indicator, etc.\n- The student shall be able to measure the threads, gear tooth profiles and surface roughness using appropriate instruments and analyze the data.\n- The student shall be able to check alignment of various components in various mechanisms using advanced scientific tools.\n- The students will be able to work in quality control and quality assurances divisions in industries."
  },
  {
    "course code": "PRPL-18",
    "course title": "Computer Aided Design (Practical)",
    "number of credits": "01",
    "prerequisites": "Machine Design (PRPC-25)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "- To get the knowledge of modelling softwares\n- To understand the 2D, 3D and assembly drawing features of different CAD softwares.\n- To understand and generate 2D entities using programming techniques\nList of Experiments:\n- To perform 2D scaling, reflection, rotation and translation transformations of a geometric entity.\n- To perform 3D scaling, reflection, rotation and translation transformations of a geometric entity and show its application for a unit cube.\n- To generate the top, front and side views of a truncated cube.\n- To generate isometric projection and apply it to view a given object.\n- To generate dimetric projection and apply it to view a given object in different orientations.\n- To perform single point perspective projection and use it to view a truncated cube.\n- To perform joining a set of points in space by Hermite curve segments and demonstrate the manipulation of curve shape by varying the geometric conditions.\n- To generate a Bezier curve for a given set of control points and demonstrate the manipulation of curve shape by varying the geometric conditions.\n- To generate a B-Spline curve for a given set of control points and demonstrate the manipulation of curve shape.\n- To generate and view a ruled surface between two given rails.\n- To generate and view a Bezier surface for a given mesh of control points.",
    "course outcomes": "At the end of the course student will be able to\n- Draw the 2D, 3D drawing of complex machine components\n- Design contours and surfaces using modelling softwares.\n- Generate 2D entities using MATLAB"
  },
  {
    "course code": "PRPE-16",
    "course title": "I.C. Engines and Gas Turbine",
    "number of credits": "03",
    "prerequisites": "Thermal Engineering (PRPC17)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To make students familiar with the design and operating characteristics of modern internal combustion engines.\n- To apply analytical techniques to the engineering problems and performance analysis of internal combustion engines.\n- To study the thermodynamics, combustion, heat transfer, friction and other factors affecting engine power, efficiency and emissions.\n- To introduce students to the environmental and fuel economy challenges facing the internal combustion engine.\n- To introduce students to future internal combustion engine technology and market trends.",
    "course content": "## Unit-I Introduction\n\nInternal & external combusion engines; classification, cycle of operation in four stroke and two stroke I.C. Engines, Valve timings, Wankel Engine. [3 hrs]\n\n\n## Unit-II\n\nAir Standard Cycles\nAssumptions made in air standard cycles, Otto cycle, Diesel cycle, Dual cycle; comparison of these cycles; Sterling and Ericsson cycles; Air standard efficiency; specific work output, work ratio & mean effective pressure, Deviation of actual cycle from ideal cycle. [3 hrs]\n\n\n## Unit-III\n\nCombustion in I.C. Engines\nSI engines: Ignition Limits, stages of combustion, Effect of engine variables on Ignition Lag and flame-propagation, Abnormal combustion, Detonation, Effect of Engine variables on detonation, Pre-ignition, Octane rating of fuels, SI engine combustion chambers. CI engine: stages of combustion, Delay period, variables affecting delay period, Diesel knock, Cetane rating, CI engine combustion chambers. [5 hrs]\n\n\n## Unit-IV\n\nCarburetion, Fuel Injection & Ignition systems\nMixture requirements for various operating conditions in SI engines: Elementary carburettor, Calculation of A/F ratio, The complete carburettor. Diesel injection systems: requirements, types, petrol, injection. Requirements of ignition systems, types of ignition systems, ignition timing, spark plug. [5 hrs]\n\n\n## Unit-V\n\nLubrication and Cooling\nTotal engine friction, Function of the lubrication systems, properties of lubricating oil, rating of oils, Lubrication systems, engine performance & lubrication. Necessity of engine cooling, Cooling systems, Water cooling, air cooling, Radiators. [5 hrs]\n\n\n## Unit-VI\n\nEngine Testing & Performance\nPerformance parameters, BHP, IHP, Mechanical efficiency, B M E P, I M E P, torque, volumetric efficiency B S F C And I S F C , thermal efficiency, Heat balance, Basic engine measurements: fuel and air consumption, brake power, indicated power and friction power, performance curves.\n[5 hrs]\n\n\n## Unit-VII\n\nAir Pollution and its Control\nSources and classification of air pollution, Effect on human health, pollutants from IC engines, methods of emission control, Alternative fuels, current scenario on the pollution front. [5 hrs]\n\n\n## Unit-VIII\n\nAir compressors\nSingle stage reciprocating air compressors, work input, volumetric efficiency, isothermal efficiency, Advantages of multi stage compression, Two stage compressor with inter cooling, optimum pressure ratio. Rotary air compressors and their applications. [5 hrs]\n\n\n## Unit-X\n\nGas Turbines\nBrayton cycle, components of a gas turbine plant, open and closed type, optimum pressure ratio, Improvements upon the basic cycle, multi stage compression with inter cooling, multi stage expansion with reheating, Regeneration, Applications of gas turbines. [4 hrs]",
    "course outcomes": "- Students will be able to differentiate among different internal combustion engine designs.\n- Students will be able to recognize and understand reasons for differences among operating characteristics of different engine types and designs.\n- Students will be able to given an engine design specification, predict performance and fuel economy trends with good accuracy.\n- Students will be able to base on an in-depth analysis of the combustion process, predict concentrations of primary exhaust pollutants.\n- Students will be able to exposure to the engineering systems needed to set-up and run engines in controlled laboratory environments.\n- Students will be able to develop skills to run engine dynamometer experiments.\n- Students will be able to learn to compare and contrast experimental results with theoretical trends, and to attribute observed discrepancies to either measurement error or modeling limitations.",
    "reference books": "- Internal Combustion Engines by Obert E.F.\n- Internal Combustion Engines by Mathur & Sharma, Dhanpat Rai.\n- Internal Combustion Engines by Gill, Smith & Zuriys, IBH\n- Internal Combustion Engines by Ganesan, TMH"
  },
  {
    "course code": "PRPE-17",
    "course title": "Industrial Robotics",
    "number of credits": "03",
    "prerequisites": "Strength of Materials (PRPC20), Theory of Machines (PRPC14)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand the basic concepts of robotics, their classification and applications, direct and inverse kinematics of standard industrial robots.\n- To understand the workspace analysis, workspace fixtures, trajectory planning with different types of tool motions and motion rate controls of redundant robots.\n- To understand the direct and inverse dynamics of different industrial robots and robot controls.\n- To understand the concepts of template machining, shape analysis, perspective transformations and task planning using robots.",
    "course content": "## Unit-I\n\nRobotic Manipulation\nAutomation and robots, Robot classification, Applications, Robot specifications. (3 hrs)\n\n\n## Unit-II\n\nDirect Kinematics (The Arm Equation)\nDot and Cross products, Coordinate frames, Homogeneous coordinates, Link Coordinates, The arm equation, Five-axis articulated robot (Rhino XR-3), Four-axis SCARA robot (Adept One), Six- axis articulated robot (Intelledex 660). (4 hrs)\n\n\n## Unit-III\n\nInverse Kinematics (Solving the Arm Equation)\nThe Inverse kinematics problem, General properties of solutions, Tool Configuration, Inverse kinematics of Five-axis articulated robot (Rhino XR-3), Inverse Kinematics of Four-axis SCARA robot (Adept One), inverse kinematics of Six-axis articulated robot (Intelledex 660), and Inverse kinematics of a three-axis planar articulated robot, a robotic work cell. (6 hrs)\n\n\n## Unit- IV\n\nWorkspace Analysis and Trajectory Planning\nWorkspace analysis, Work envelope of a five-axis articulated robot (Rhino XR-3), Work envelope of a four-axis SCARA robot (Adept One), Workspace fixtures, The pick and place operations, Continuous path motion, Interpolated motion, Straight line motion. (4 hrs)\n\n\n## Unit-V\n\nDifferential Motion and Static\nThe tool configuration and Jacobean matrix, Joint space singularities, Generalized inverses, Resolved motion rate controls, rate control of redundant robots, rate control using {1}-inverses, The manipulator Jacobean, Induced joint torque and forces. (5 hrs)\n\n\n## Unit-VI\n\nManipulator Dynamics\nLagrange’s equation, Kinetic and potential energy, Generalized force, Lagrange-Euler dynamic model, Dynamic model of a two-axis planar articulated robot, Dynamic model of a three-axis SCARA robot, Direct and inverse dynamics, Recursive Newton-Euler formulation, Dynamic model of a one-axis robot (inverted pendulum). (6 hrs)\n\n\n## Unit-VII\n\nRobot Control\nThe control problem, State equations, Constant solutions, Linear feedback systems, Single axis PID control, PD gravity control, Computed torque control, Variable structure control. (5 hrs)\n\n\n## Unit-VIII Robot Vision\n\nImage representation, Template matching, Polyhedral objects, Shape analysis, Segmentation, Iterative processing, Perspective transformations, Structured Illumination, Camera Calibration.\n(4 hrs)\n\n\n## Unit-X\n\nTask Planning\nTask level programming, Uncertainty, Configuration space, Gross motion planning, Grasp Planning, Fine motion planning, Simulation of planar motion. (3 hrs)",
    "course outcomes": "At the end of the course student will be able to\n- Understand the basic concepts of robotics, their classification and applications, direct and inverse kinematics of standard industrial robots.\n- Understand the workspace analysis, workspace fixtures, trajectory planning with different types of tool motions and motion rate controls of redundant robots.\n- Understand the direct and inverse dynamics of different industrial robots and robot controls.\n- Understand the concepts of template machining, shape analysis, perspective transformations and task planning using robots.",
    "reference books": "- Industrial Robotics by M.P. Groover, McGraw Hill\n- Industrial Robotics and Automation by S.R.Deb Tata McGraw Hill"
  },
  {
    "course code": "PRPE-18",
    "course title": "Refrigeration and Air Conditioning",
    "number of credits": "03",
    "prerequisites": "Thermal Engineering (PRPC17)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To analyze the refrigeration cycles and method of improving of performance.\n- To familiarize the components of basic refrigeration systems.\n- To understand vapor compression system and vapor absorption system.\n- To design air condition systems using cooling load calculations.\n- To know the applications of refrigeration and air conditioning systems.",
    "course content": "## UNIT-I\n\nIntroduction\nBasics of heat pump & refrigerator, Carnot refrigeration and heat pump, units of refrigeration, COP of refrigerator and heat pump, Carnot COP, Ice refrigeration, evaporative refrigeration, refrigeration by expansion of air, refrigeration by throttling of gas, vapour refrigeration system, steam jet refrigeration, thermo- electric cooling, adiabatic demagnetization. [4 hrs]\nAir Refrigeration\nBasic Principle of operation of air refrigeration system, Bell Coleman air refrigerator, advantages of using air refrigeration in air craft, disadvantage of air refrigeration in comparison to other cold producing methods, simple air refrigeration in air craft, simple evaporative type, air refrigeration in air craft, necessity of cooling the air craft. [4 hrs]\n\n\n## UNIT-II\n\nSimple Vapour Compression réfrigération System\nSimple vapour compression refrigeration system, different compression processes (wet, dry and saturated Compression, superheated compression), Limitations of vapour compression refrigeration system if used on reverse Carnot cycle, representation of theoretical and actual cycle on T-S and P H charts, effects of operating conditions on the performance of the system, advantages of vapour compression system over air refrigeration system. [4 hrs]\nAdvanced Vapour Compression refrigeration system\nMethods of improving COP, flash chamber, flash inter cooler, optimum inter stage pressure for two stage refrigeration system, single expansion and multi expansion cases, basic introduction of single load and multi load systems, cascade systems. [5 hrs]\nVapour absorption refrigeration system and special topics\nBasic absorption system, COP and maximum COP of the absorption system. Actual NH3 absorption system, function of various components, Li-Br absorption system, Selection of refrigerant and absorbent pair in vapour absorption system, Electro-Lux refrigerator, comparison of compression and absorption refrigeration system, Nomenclature of refrigerants, desirable properties of refrigerants, cold storage and Ice Plants. [4 hrs]\n\n\n## UNIT-III\n\nAir Conditioning\nDifference between refrigeration and Air Conditioning, Psychrometric properties of moist air (web bulb, dry bulb, dew point temperature, relative and specific humidity temperature of adiabatic saturation), empirical relation to calculate PV of moist air. [3 hrs]\nPsyschrometry\nPsychrometry chart, construction and use, mixing of two air streams, sensible heating and cooling, latent heating and cooling, humidification and dehumidification, cooling with dehumidification, cooling with adiabatic humidification, heating and humidification, By- pass factor of coil, sensible heat factor, ADP of cooling coil, Air washer. [4 hrs]\n\n\n## UNIT-IV\n\nAir Conditioning system\nClassification, factors affecting air conditioning systems, comfort air conditioning system, winter air conditioning system, summer Air Conditioning system, year round air conditioning system, unitary air conditioning system, central air conditioning system, Room sensible heat factor, Grand sensible heat factor, effective room sensible heat factor. [5 hrs]\nCooling Load calculation\nInside design conditions, comfort conditions, components of cooling load, internal heat gains from (occupancy, lighting, appliances, product and processes), system heat gain (supply air duct, A.C. fan, return air duct), External heat gain (heat gain through building, solar heat gain through outside walls and roofs), sol-air temperature, solar heat gain through glass windows, heat gain due to ventilation and infiltration. [5 hrs]\nIndustrial and commercial application\nTransport air conditioning, evaporative condensers, cooling towers, heat pumps. [2 hrs]",
    "course outcomes": "- Students should be able to understand the need and importance of various refrigeration and air conditioning cycles, the typical and some advanced and innovative schematic designs, and the goals of R&AC systems.\n- Students should be able to design the VCRS and VARS with improving performance parameters.\n- Students should be able to describe the working of different types of air conditioning systems.\n- Student should be able to understand the actual applications of R&AC.",
    "reference books": "- Refrigeration and Air Conditioning - C.P. Arora, Tata McGraw-Hill\n- Basic Refrigeration and Air Conditioning- Ananthana and Rayanan, McGraw-Hill\n- Refrigeration and Air Conditioning- Arora and Domkundwar, Dhanpat Rai."
  },
  {
    "course code": "PRPE-19",
    "course title": "Computer Aided Design",
    "number of credits": "03",
    "prerequisites": "Strength of Materials (PRPC20), Theory of Machines (PRPC14)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand 2D & 3D geometric transformation techniques in CAD.\n- Develop mathematical models to represent curves and surfaces.\n- To develop skills for programming for designing different types of curves, surfaces etc\n- To understand and generate solid geometries.",
    "course content": "## UNIT-I\n\nIntroduction\nIntroduction to CAD/CAM, Historical developments, Industrial look at CAD/CAM, Introduction to CIM, Basics of geometric and solid modeling, explicit, implicit, intrinsic Polar envelope and parametric equations coordinate systems. Torsion, Frenet-Serret formulae. [6 hrs]\n\n\n## UNIT-II\n\nTransformations\nIntroduction, transformation of points and line, 2-D rotation, reflection, scaling and combined transformation, homogeneous coordinates, 3-D scaling, shearing, rotation, reflection and translation, combined transformations orthographic, Axonometric, Oblique and perspective projections. [8 hrs]\n\n\n## UNIT-III\n\nCurves\nAlgebraic and geometric forms, Analytical & Synthetic Curves, tangents and normal, blending functions, re-parametrization, straight lines, conics, cubic splines, bezier curves and B-spline curves; Rational curves, Non-uniform Rational curves, NURBS; Curve manipulation. [10hrs]\n\n\n## UNIT- IV\n\nSurfaces\nAlgebraic and geometric forms, Analytical and Synthetic Surfaces, tangents and twist vectors, normal, blending functions, re-parametrization, sixteen-point form, four curve form, plane surface, ruled surface, surface of revolution, tabulated cylinder, bi-cubic surface, Bezier surface, B-spline surfaces, Coons surface, Blending surface, Offset surface, Triangular patches, Sculptured surfaces, Rational parametric surfaces; surface manipulation. [10 hrs]\n\n\n## UNIT- IV\n\nSolids\nSolid models and representation scheme, Fundamentals of Solid Modeling, boundary representation, constructive solid geometry, sweep representation, cell decomposition, spatial occupancy enumeration, Half spaces, Octree Encoding, Pure Primitive Instancing. [6 hrs]",
    "course outcomes": "At the end of the course student will be able to\n- Perform transformations of 2D & 3D objects (such as lines, surfaces and solids)\n- Generate curves and surfaces by developing mathematical models\n- Model components using solid modeling techniques\n- Apply computer aided design techniques in industry.",
    "reference books": "- CAD/CAM by Groover and Zimmer, Prentice Hall\n- CAD/CAM: Theory and Practice by I. Zeid, Tata McGraw Hill\n- Mathematical Elements for Computer Graphics by Rogers & Adams, McGraw Hill.\n- Computer Aided Engineering Design by AnupamSaxena and Birendra Sahay, Springer"
  },
  {
    "course code": "PRPE-20",
    "course title": "Renewable Energy Systems",
    "number of credits": "03",
    "prerequisites": "Thermal Engineering (PRPC17),\nFluid Mechanics and Machines (PRPC13)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To provide knowledge of solar energy concept and applications.\n- To impart knowledge of geothermal, ocean and tidal energy and their applications.\n- To understand the design of wind mills and applications.\n- To understand the turbines and generators for small scale hydroelectric generation.\n- To understand the important parts of a biogas plant, design and principle of bio-diesel.",
    "course content": "## Unit-I\n\nEnergy Related Environmental Problems and Renewable Energy Technologies\nAcid rain, ozone layer depletion, global climate change, history of solar energy, introduction and scope of solar energy, solar collectors and its applications, introduction and scope of bio energy, biogas, bio fuels and its applications, introduction to wind energy, wind energy potential in India and world, wind farms and mills & their applications, small scale hydroelectric, classification of small hydro power stations, advantages and limitations of small scale hydro-electric.\n\n\n## Unit-II\n\nGeothermal and Oceans Energy\nPotential sites, estimations of geothermal power, nature of geothermal sites, hot-dry rocks resources, magma resources, systems for energy generation, applications of geothermal energy, environmental issues, basic theory of ocean thermal energy conversion, potential and application of technologies, basic theory of wave energy, potential and technologies, basic theory of tidal energy, potential and technologies, methods of ocean thermal electric power generation.\n\n\n## Unit-III\n\nM.H.D. Generator and Thermoelectric Generators\nIntroduction, Principle of working, different types of M.H.D. generators, M.H.D. materials, M.H.D. power generation systems, economic aspects of M.H.D. generation.\nIntroduction, thermoelectric effects, thermoelectric generator, types of thermoelectric generators, economic aspects of thermoelectric generation.\n\n\n## Unit-IV\n\nFuel Cells and Hydrogen Energy\nIntroduction, principle of fuel cells, thermodynamic analysis of fuel cells, types of fuel cells, fuel cell batteries, applications of fuel cells.\nHydrogen as a renewable energy source, sources of hydrogen, fuel for vehicles, hydrogen production- direct electrolysis of water, thermal decomposition of water, biological and biochemical methods of hydrogen production.",
    "course outcomes": "- Get the knowledge of solar concepts, solar collector and solar desalination.\n- Get the knowledge of geothermal applications, energy generation, power generation by tidal energy.\n- Get the knowledge of design of wind mills and energy estimations and also wind energy applications.\n- Get the knowledge the turbines and generators for small scale hydroelectric generation and advantages and limitations of small scale hydro-electric.\n- Get the knowledge of design of bio gas plant and bio diesel applications.",
    "reference books": "- Twidell & A. W. Wier, Renewable energy resources, English Language book, Society I E & F N Spon (1986).\n- N. K. Bansal, M. Kleeman & M. Mielee, Renewable Conversion Technology, Tata Mc Graw Hill, New Delhi.\n- T. John and W. Tony, Renewable Energy Resources, Taylor & Francis."
  },
  {
    "course code": "PRPE-21",
    "course title": "Heat Transfer",
    "number of credits": "03",
    "prerequisites": "Thermal Engineering (PRPC17)",
    "course type": "PE",
    "branch": "pie",
    "course objectives": "- To understand the fundamentals of heat transfer mechanisms in fluids and solids and their applications in various heat transfer equipment in process industries\n- To apply scientific and engineering principles to analyze and design aspects of engineering systems that relate to conduction, convection and radiation heat transfer; use appropriate analytical and computational tools to investigate conduction, convection and radiation heat transfer; are both competent\n- confident in interpreting results of investigations related to heat transfer and thermal design; recognize the broad technological and historical context of where heat transfer is important.",
    "course content": "## Unit-I Introduction\n\nDefinition of heat; Modes of Heat Transfer; Basic Laws of heat transfer; Electrical Analogy of heat conduction; Conduction through composite walls; Overall heat transfer coefficient. [5 hrs]\n\n\n## Unit-II Conduction\n\nThe General heat Conduction equation in Cartesian, cylindrical and spherical coordinates; steady one dimensional heat conduction without internal heat generation: the plane slab; the cylindrical shell; the spherical shell; Critical thickness of insulation; Variable thermal conductivity, Steady one dimensional heat conduction with uniform internal heat generation: the plane slab; cylindrical and spherical systems. Fins of uniform cross-section: Governing equation; Temperature distribution and heat dissipation rate; Efficiency and effectiveness of fins. [12 hrs]\n\n\n## Unit-III Convection\n\nFree and forced convection; Newton’s law of cooling; convective heat transfer Coefficient; Nusselt number; Dimensional analysis of free and forced convection; Analytical solution to forced convection problems: the concept of boundary layer; hydrodynamic and thermal boundary layer; Momentum and Energy equations for boundary layer. Exact solution for laminar flow over an isothermal plate using similarity transformation. The integral approach; integral momentum and energy equations; solution of forced convection over a flat plate using the integral method. Analysis of free convection; governing equations for velocity and temperature fields. Relation between fluid friction and heat transfer, Reynolds analogy. Dimensionless numbers: Reynolds, Prandtl, Nusselt, Grash off and Stanton Numbers and their significance, Heat transfer with change of phase; Nusselt theory of laminar film Condensation. [13 hrs]\n\n\n## Unit-IV Radiation\n\nTheories of thermal radiation; Absorption, reflection and transmission; Monochromatic and total emissive power; Black body concept; Planck’s distribution law; Stefan Boltzman law; Wien’s\ndisplacement law; Lambert’s cosine law; Kirchoff’s law; Shape factor; Heat Transfer between black surfaces. [5 hrs]\n\n\n## Unit-V\n\nHeat Exchangers\nIntroduction; classification of heat exchangers; Logarithmic mean temperature difference; Area calculation for parallel and counter flow heat exchangers; Effectiveness of heat exchangers; NTU method of heat exchanger design. Applications of heat exchangers. [5 hrs]\nCourse Outcome:\n- The students will be able to understand about the different modes of heat transfer.\n- The students will be able to apply related heat transfer laws\n- The students will be able to calculate the heat flow rate in different engineering applications and its implications on temperature.\n- The students will be able to design Fins and heat exchangers for industrial applications",
    "reference books": "- A Text Book on Heat transfer - S.P. Sukhatme, University Press\n- Heat Transfer Holman, McGraw-Hill\n- Heat & Mass Transfer. D.S. Kumar, S.K. Katariya\n- A Text Book on Heat transfer by S.P. Sukhatme, University Press\n- Heat and Mass Transfer by Cengel and Ghajar, McGraw-Hill\nOR\nProject Work\nB.Tech (Production & Industrial Engineering) 7th Semester\nB.Tech (Production & Industrial Engineering) 7th Semester Programme Electives (PE)"
  },
  {
    "course code": "PRPC-26",
    "course title": "Non-Conventional Manufacturing Processes",
    "number of credits": "4.0",
    "prerequisites": "Production Technology- II (PRPC18)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To understand the basic concepts of Non-conventional machining processes.\n- To understand the principle and material removal mechanism of various Non-conventional machining processes.\n- To study the effect of various process parameters on the process outcomes\n- To understand the application of Non-conventional machining methods in various fields\n- To understand the basic concepts of Rapid prototyping and rapid tooling processes.",
    "course content": "## Unit-I Introduction\n\nUnconventional machining processes, Rapid prototyping processes, their classification, considerations in process selection. [3 hrs]\n\n\n## Unit-II\n\nUltrasonic Machining\nElements of process, design of cutting tool, metal removal mechanism, effect of parameters, economic considerations, limitations and applications, surface finish. [3 hrs]\n\n\n## Unit-III\n\nElectrochemical Machining\nElements of process, process chemistry, metal removal mechanism, tool design, accuracy, surface finish and work material characteristics, economics advantages, limitations and applications, Electrochemical grinding, deburring and honing, Chemical machining. [6 hrs]\n\n\n## Unit-IV\n\nElectric Discharge Machining\nPrinciple and mechanism of metal removal, generators, electrode feed control, electrode material, tool electrode design, EDM wire cutting, surface finish, accuracy and applications. [6 hrs]\n\n\n## Unit-V\n\nJet Machining\nPrincipal and metal removal mechanism of abrasive and water jet machining, process variables, design of nozzle, advantages, limitations and applications. [4 hrs]\n\n\n## Unit-VI\n\nOther Machining Processes\nPlasma arc machining, Electron beam machining, laser beam machining, their principles and metal removal mechanism, process parameters, advantages and limitations, applications. [4 hrs]\n\n\n## Unit-VII\n\nRapid Prototyping Processes\nFundamentals, process chain, physics of processes, principles and process mechanism of SLA, SGC, LOM, FDM and SLS processes, their advantages and limitations, applications of RP processes, RP data formats, STL file format, STL file problems, STL file repair, other translators and formats. [7 hrs]\n\n\n## Unit-VIII\n\nRapid Tooling Processes\nIntroduction, fundamentals, classification, indirect RT processes, Principles of Silicone Rubber Molding, Epoxy Tooling, Spray Metal Tooling, Pattern for Investment Casting, Vacuum Casting, and Vacuum forming processes, direct RT processes, Shape Deposition manufacturing, their advantages, limitations and applications. [7 hrs]",
    "course outcomes": "At the end of the course, student will be able to\n- Explain the principle of working and mechanism of material removal of the various Non- conventional machining processes\n- Classify and compare the various non-conventional machining processes\n- Select suitable Non-conventional machining process for processing a particular material\n- Decide optimum process parameters for the respective Non-conventional machining process\n- Explain the basic concepts of Rapid prototyping and rapid tooling processes.",
    "reference books": "- Modern machining processes by P.C. Pandey and H.S. Shan, TMH.\n- Machining Science by Ghosh and Mallik, Affiliated East West\n- Nontraditional Manufacturing processes by G.F. Benedict, Marcel Dekker.\n- Non-Conventional Machining, P. K. Mishra, Narosa Publication\n- Manufacturing Processes and Systems, P. F. Ostwald, J. Munoz, John Wiley Sons.\n- Advanced Machining Processes, H El-Hofy, McGraw Hill Publication\n- Advanced Methods of Machining by J.A. McGeongh, Chapman and Hall.\n- Electrochemical Machining of Metals by Rumyantsev and Davydov, Mir Publis.\n- Rapid prototyping: Principles and applications in Manufacturing, Chee Kai Chua, Kah Fai Leong, World Scintific Publishing"
  },
  {
    "course code": "PRPC-27",
    "course title": "Tool Engineering",
    "number of credits": "4",
    "prerequisites": "NIL",
    "course type": "PC",
    "branch": "pie",
    "course content": "Course Learning Objective:\n- To impart knowledge of engineering tool such as single & multi point cutting tools, jigs & fixture, dies etc. for manufacturing a product.\n- To understand the various designs and planning aspect for controlling quality.\n\n\n## UNIT-I\n\nCutting Tool Design\nBasic concepts of single and multi-point tool geometry and tool angles, design of single point cutting tools, design of multi-point cutting tools for milling, drilling, reaming, and broaching operations, design of form tools. (9hrs)\n\n\n## UNIT-II\n\nJigs and Fixtures\nIntroduction, difference between jig and fixture, principles of location and clamping, locating methods and devices, clamping methods and clamping devices, calculation of clamping force, Jig bushes, Types of jigs and Milling fixtures: Turning fixtures, Grinding fixtures, Boring and broaching fixtures,assembly and welding fixtures, hydraulic and pneumatic clamp actuation, indexing devices, Different Materials for jigs and fixtures, Economics of Jigs and Fixtures, drawing and design of jigs and fixtures for given components. (9hrs)\n\n\n## UNIT-III\n\nSheet metal die design\nTypes of dies: Progrssive, compound and combination, Die construction: screws and dowels, die block, Punch design: Plain punches, pedestal punches, punches mounted in punch plates, perforator type punches, Quill punches, back-up plate, slug ejection, Pilots, stripper and stock guide: channel and spring stripper, Die stops: solid stop, pin stop, latch stop, pivoted auto stop, stock strip layout, component design for blanking, strip development. (7hrs)\nForging die design\nParting plane, draft, fillet and corner radii, shrinkage allowance, die wear allowance, finish allowance, cavities, drop forging die design: flash, stock, fullering impression, edging impression, blocking impression, finishing impression, location of impressions, Die inserts, Upset forging die design. (7hrs)\n\n\n## UNIT-IV\n\nProcess Planning\nProduct cycle in manufacturing, product quality: accuracy of machining, accuracy of assembly, part print analysis: functional surfaces; tolerance stacking, errors in machining: location errors, elastic deformation of machining complex, effect of clamping force, cutting tool wear, thermal deformations; operation selection: classifying operations, eliminating operations, planning for cylindrical surfaces; Tolerance analysis.\n(8hrs)",
    "course outcomes": "- The students will be able to design different types of single and multipoint tool geometry.\n- The students will be able to understand jigs & fixtures and clamping devices.\n- The students will be able to understand the various operations and design of sheet metal dies.\n- The students will be able to design forging die.\n- The students will be able to understand the various process planning for controlling quality.\nRefrence Books:\n- Rodin, R., “Design and Production of Metal-Cutting Tools”,Mir Publishers, 1968\n- Arshinov, V., Alekseev, G., and Weinstein, N., “Metal Cutting Theory and Cutting Tool Design”, Mir Publishers, 1976\n- Bhattacharyya, A., and Ham, I., “Design of Cutting Tools”, ASTME 1969\n- Hoffman, E.G., “Jigs and Fixture Design”, Thomson Delmar Learning 2003 5..Grant Hiram E, “Jigs & Fixtures”, Tata McGraw Hill,1994.\n6..Curtis Mark A, “Tool Design for Manufacturing”, John Wiley & Sons,1996. 7..Donaldson Cyril, “Tool Design”, Tata McGraw Hill 1997.\n8..Sharma P C, “ Production Engineering”, S Chand & Company,1997.\n- Joshi, P.H., Jigs and Fixtures, TMH.\n- Hinman, Press Working of Metals, McGraw-Hill.\n- P.N. Rao, Manufacturing Technology, TMH\n- Pandey and Singh, Production Engineering Sciences 15.ASTME: Fundamentals of Tool Design, Prentice-Hall\n- S.A.J. Parsons, Production tooling equipments, Macmillan, London\n- Eary,D.P. and Johnson, G.E., Process Engineering, Prentice-Hall, 1962."
  },
  {
    "course code": "PRPC-28",
    "course title": "Work Study and Ergonomics",
    "number of credits": "4.0",
    "prerequisites": "Nil",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To understand the basic concepts of production and productivity and to study the methods of productivity improvement.\n- To understand the main concepts of Work Study and apply them to know about the practical aspects of Industrial World.\n- To inculcate the skills among the students for analysing and improving existing methods of working on the shop floor of an organisation.\n- To impart thorough knowledge to the students with respect to allowances, rating, determination of basic and standard time for various operations in an organisation.\n- To understand the basic concepts of Ergonomics and to apply them in real work environment.",
    "course content": "## UNIT I\n\nProductivity\nConcept and definition, Difference between production and productivity, Reasons for low productivity, factors influencing productivity, productivity measures, measurement models, methods/techniques to improve productivity, work-study and productivity, Work content [5 hrs]\n\n\n## UNIT II\n\nIntroduction to Work-Study\nImportance, Human considerations in work-study Relationship of work-study man with management, supervisor & workers, qualities of a work-study man. [8 hrs]\n\n\n## UNIT III\n\nMethod-Study\nDefinition, objectives, step-by-step procedure, questioning techniques, charts and diagrams for recording data. outline process charts, flow process charts, multiple activity charts, two handed process chart, string diagram, travel chart, cycle graph, Chrono-cycle graph, Therbligs, Micro motion study and film analysis, SIMO chart, Principles of motion economy, development and installation of new methods. [10 hrs]\n\n\n## UNIT IV\n\nWork–Measurement\nDefinition, various techniques of work-measurement work-sampling, stop-watch time study & its procedure, Job selection, Equipment and forms used for time study, rating, methods of rating, allowances and their types, work sampling, normal time, standard time, numerical problems,\nPredetermined Motion Time System and its types, Work Factor System, Method Time Measurement and Basic Motion Time. [10 hrs]\n\n\n## UNIT V\n\nErgonomics\nIntroduction, history of development, objectives, man-machine system and its components, design of Man Machine Systems, introduction to structure of the body- features of the human body, stress and strain, metabolism, measure of physiological functions- workload and energy consumption, biomechanics, types of movements of body members, strength and endurance, speed of movements, Applied Anthropometry - types, use, principles and applications, design of work place and seat design, visual displays for static information, visual displays of dynamic information, auditory, tactual and olfactory displays and controls, effect of vibration, noise, temperature and illumination on performance. [12 hrs]",
    "course outcomes": "At the end of the course, student will be able to\n- Understand the production and productivity concepts.\n- Understand the Work Study concepts and their applications.\n- Understand and apply the method study procedure tools and techniques.\n- Analyse the Predetermined Motion Time System, Work Factor System, Method Time Measurement and Basic Motion Time.\n- Understand the prime concepts of Ergonomics and its significance in relation to the design of work place and controls etc.",
    "reference books": "- Barnes Ralph M., Motion & Time study: Design and Measurement of Work, Wiley Text Books, ed. 7th, 2001.\n- Marvin E, Mundel & David L, Motion & Time Study: Improving Productivity, Pearson Education, 2000.\n- Benjamin E Niebel and Freivalds Andris, Methods Standards & Work Design, McGraw Hill, 2013.\n- International Labour organization, Work-study, Oxford and IBH publishing company Pvt. Ltd., New Delhi, 2001.\n- Sanders Mark S and McCormick Ernert J, Human Factors in Engineering and Design, McGraw-Hill Inc., 1993.\n- Sharma S K and Sharma Savita, “Work Study and Ergonomics”, S K Kataria & Sons., Delhi, 2014."
  },
  {
    "course code": "PRPL 19",
    "course title": "Work Study and Ergonomics (Practical)",
    "number of credits": "01",
    "prerequisites": "Work Study and Ergonomics (PRPC-28)",
    "course type": "ELR",
    "branch": "pie",
    "course learning objectives": "The objectives of the course are\n- To develop the understanding of the Nut-Bolt-Washer Assembly Method.\n- To develop the understanding of Work Sampling Exercise.\n- To develop the understanding of Stop Watch Time Study for Production of a Machine Component.\n- To develop the understanding of anthropometric measurement and its utility.\n- To develop the understanding of various rating factors and find standard time.\n- To develop the understanding of Flow Process Chart with time estimates for a simple welding process.\n- To develop the understanding of Two Handed Process Chart for a simple process of a job preparation on a Lathe Machine.\n- To develop the understanding of various Control Charts and their applications.\n- To develop the understanding of basic concepts of various plant layouts and suggest improvements in existing Machine Shop Layout.\n- To develop the basic understanding of Inventory Control Management through case study on ABC/VED analysis.\nList of Experiments:\n- To study and improve the Nut-Bolt-Washer Assembly Method.\n- To perform the Work Sampling Exercise.\n- To perform Stop Watch Time Study for Production of a Machine Component.\n- To study anthropometric measurement and its utility.\n- To study various rating factors and find standard time.\n- To draw a Flow Process Chart with time estimates for a simple welding process.\n- To draw a Two Handed Process Chart for a simple process of a job preparation on a Lathe Machine.\n- To draw p, 𝑋 and R charts for a given sample of product to check their acceptance.\n- To study various plant layouts and suggest improvements in existing Machine shop Layout.\n- A case study on ABC/VED analysis.",
    "course outcomes": "At the end of the course, the students will be able to\n- Develop the understanding of the Nut-Bolt-Washer Assembly Method.\n- Develop the understanding of Work Sampling Exercise.\n- Develop the understanding of Stop Watch Time Study for Production of a Machine Component.\n- Develop the understanding of anthropometric measurement and its utility.\n- Develop the understanding of various rating factors and find standard time.\n- Develop the understanding of Flow Process Chart with time estimates for a simple welding process.\n- Develop the understanding of Two Handed Process Chart for a simple process of a job preparation on a Lathe Machine.\n- Draw various Control Charts (p, 𝑋 and R chart) and understand their applications.\n- Develop the understanding of basic concepts of various plant layouts and suggest improvements in existing Machine Shop Layout.\n- Develop the basic understanding of Inventory Control Management through case study on ABC/VED analysis.\n- Draw a Flow Process Chart and understand its concept, importance and applications."
  },
  {
    "course code": "PRPL20",
    "course title": "Seminar",
    "number of credits": "1",
    "prerequisites": "NIL",
    "course type": "ELR",
    "branch": "pie"
  },
  {
    "course code": "PRPE-23",
    "course title": "Industrial Tribology",
    "number of credits": "3 (L T P : 2 0 2)",
    "prerequisites": "-",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "The students are required to deliver a seminar on some emerging areas of Industrial Engineering such as:\nThe student will deliver a power point presentation for about 30 minutes in the seminar on any of the above topics. This will be followed by question answer session for about 10 minutes. The questions/queries on the topic will be asked by the teacher and class students. The students will also prepare a detailed report in MS word and after proper binding (spiral form) will submit it to the teacher concerned. The report is to be submitted at least one week prior to the presentation. The awards will be given according to the student’s presentation, report submitted, topic of presentation and the discussion or question answering after the presentation.\nThe objective of this course is to impart the theoretical and practical knowledge of tribological phenomena, concepts of friction, modes of wear and lubrication which is required to design and develop the engineering surfaces in contact.",
    "course content": "## Unit 1: Introduction and Concept of Friction\n\nIntroduction to tribology, different scales of tribology, engineering surfaces, structural and topographical states of surface, contact of engineering surfaces, concept and classification of friction, laws of friction, theories of dry friction. (6hrs)\n\n\n## Unit 2: Lubrication and Wear\n\nIntroduction, lubricant viscosity, basic modes of lubrication, types of lubricants, lubricant additives,mechanism of pressure generation in lubricant. Introduction to wear, different modes and mechanisms of wear, wears resistance materials, corrosion and tribo-corrosion phenomenon. (7hrs)\n\n\n## Unit 3: Surface Engineering Techniques\n\nSurface hardening methods, diffusion coatings, hot dip coatings, galvanized coating, weld over-lay methods, introduction to thermal spraying and its applications, vapour deposition methods, friction surfacing, laser and microwave processing. (7hrs)\n\n\n## Unit 4: Bearings and Bearing Materials\n\nGeometry and pressure equation of journal bearing, hydrostatic bearings, thrust bearings, journal bearings with specialized applications, general requirements and different types of bearing. (7hrs)\nList of Practical:\n- To determine the co-efficient of friction and dry-sliding wear behaviour of a given material with the help of a pin-on-disc tribometer.\n- To determine the co-efficient of friction and sliding wear behaviour of a given material under lubricating condition with the help of a pin-on-disc tribometer.\n- To evaluate the wear scar properties and co-efficient of friction of a lubricant with the help of a four-ball tester.\n- To determine the load wear index and weld point of a lubricant on a four-ball tester.\n- To study the pressure distribution of a journal bearing using a journal bearing apparatus.\n- To evaluate the shear stability of a given lubricant with the help of a shear stability tester.\n- To determine abrasion index of a material with the help of a dry abrasion test rig.\n- To determine the reciprocating wear behaviour of a given material under dry and lubricating conditions.\n- To determine the reciprocating wear behaviour of a given material at high temperature.",
    "course outcomes": "By the end of this course, the student will have the:\n- Knowledge of different scales of tribology, surface topography, and emerging concepts.\n- Knowledge of the friction, wear, and lubrication mechanisms and will be able to apply them for practical engineering problems.\n- Knowledge to design and develop new engineered surfaces for the better life of mechanical components.\n- The students will be able operate the various types of tribometers to measure the wear of different materials under dry and lubricating conditions.\n- The students will be able to measure the wear performance of different types of lubricants and greases for tribological applications.",
    "reference books": "- Principles and Applications of Tribology, by B. Bhushan, John Wiley & Sons.\n- Microstructure and wear of materials, by K.H. Zumgahr, Tribology series, Elsevier, Amsterdam.\n- Coatings tribology: properties, mechanisms, techniques and applications in surface engineering, by K. Holmberg & A. Matthews, Tribology and interface engineering series, Ed. 2nd, Elsevier, Oxford.\n- Fluid Film Lubrication, By B. Hamrock, NASA Reference Publication.\n- Engineering Tribology, by G. Stachowiak and A.W. Batchelor, Tribology series 24, Elsevier, Amsterdam."
  },
  {
    "course code": "PRPE-24",
    "course title": "Supply Chain Management And Logistics",
    "number of credits": "3",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie",
    "course objectives": "To understand concept of Supply chain management and apply this knowledge to understand the working of corporate world.",
    "course content": "## Unit-I\n\nUnderstanding the Supply Chain, Performance, Drivers and Obstacles\nObjectives of supply chain, Stages of supply chain, Supply chain process cycles, Push/pull view of supply chain processes, Importance of supply chain flows, Examples of supply chain, Strategic decisions in supply chain management. Supply Chain Performance, Supply chain strategies, Achieving strategic fit, Product life cycle, Supply Chain drivers and Obstacles, Four drivers of supply chain – inventory, transportation, facilities, and information, Obstacles to achieve strategic fit. [10 hrs]\n\n\n## Unit-II\n\nPlanning Demand and Supply in a Supply Chain\nRole of forecasting in a supply chain, Forecasting methods in a supply chain, Basic approach to demand forecasting, Aggregate planning resources. Managing economies of scale in a supply chain, Role of cycle inventory in a supply chain. [4 hrs]\n\n\n## Unit-III\n\nTransportation and Coordination in a Supply Chain\nFacilities affecting transportation decisions, Transport selection, Modes of transportation and their performance characteristics, Trade-offs in transportation decision, Making transportation decisions in practice, Models for transportation and distribution, Third party logistics (3PL). Coordination in a Supply chain, Lack of supply chain coordination and the Bullwhip effect, Effect of lack of coordination on performance, Obstacles to coordination, Achieving coordination in practice. [6 hrs]\n\n\n## Unit-IV\n\nSource Management and IT in Supply Chain\nInventory management in supply chain, Information technology in supply chain, Typical IT solution, Reverse supply chain, Reverse supply chain Vs. Forward supply chain. [6 hrs]\n\n\n## Unit-V\n\nAdvanced topics in SCM\nGreen, Lean, Sustainable, Global and Agile supply chain Management, Quality in Supply Chain.\n[6 hrs]",
    "course outcomes": "Upon completion of this course, the students will be able to\n- Understand the decision phases and apply competitive & supply chain strategies.\n- Understand drivers of supply chain performance.\n- Analyze factors influencing network design.\n- Analyze the influence of forecasting in a supply chain.\n- Understand the role of aggregate planning, inventory, IT and coordination in a supply chain.",
    "reference books": "- Christopher Martin, “Logistics and Supply Chain Management”, Pearson Education Asia.\n- Chopra Sunil and Meindl Peter, “Supply Chain Management – Strategy, planning and operation’s”, Pearson Education, Asia.\n- Kapoor K K, KansalPurva, “Marketing logistics: A Supply Chain Approach”, Pearson Education Asia.\n- Mohanty, R.P and Deshmukh, S.G., “Supply Chain Management”, Pearson Education Asia.\n- Fawcett, S. E., Ellram, L. M and Ogden, J. A., “Supply Chain Management” Pearson Education Asia."
  },
  {
    "course code": "PRPE -25",
    "course title": "Finite Element Method",
    "number of credits": "3",
    "prerequisites": "Strength of Materials (PRPC20), Numerical Methods and Computer Programming (Practical (PRPL16)",
    "course type": "PE",
    "branch": "pie",
    "course objectives": "- To make students learn basic principles of finite element analysis procedure.\n- To make students learn the theory and characteristics of finite elements that represent engineering structures.\n- To make students use this method and commercial software package to solve problems in heat transfer, mechanics of materials and machine design.\n- Learn to model complex geometry problems and solution techniques.",
    "course content": "## Unit-I\n\nIntroduction to Finite Element Method\nBasic Concept, Historical background, Engineering applications, general description, Comparison with other methods. [4 hrs]\n\n\n## Unit-II\n\nIntegral Formulations And Variational Methods\nNeed for weighted-integral forms, relevant mathematical concepts and formulae, weak formulation of boundary value problems, variational methods, Rayleigh-Ritz method, and weighted residual approach. [6 hrs]\n\n\n## Unit-III\n\nFinite Element Techniques\nModel boundary value problem, finite element discretization, element shapes, sizes and node locations, interpolation functions, derivation of element equations, connectivity, boundary conditions, FEM solution, post-processing, compatibility and completeness requirements, convergence criteria, higher order and isoparametric elements, natural coordinates, Langrange and Hermite polynomials. [12 hrs]\n\n\n## Unit-IV\n\nApplications To Solid Mechanics Problems\nExternal and internal equilibrium equations, one-dimensional stress-strain relations, plane stress and strain problems, axis-symmetric and three dimensional stress-strain problems, strain displacement relations, boundary conditions, compatibility equations, computer programs. [8 hrs]\n\n\n## Unit-V\n\nApplications To Heat Transfer Problems\nVariational approach, Galerkin approach, one-dimensional and two-dimensional steady-state problems for conduction, convection and radiation, transient problems. [5 hrs]\n\n\n## Unit-VI\n\nApplications To Fluid Mechanics Problems\nInviscid incompressible flow, potential function and stream function formulation, incompressible viscous flow, stream function, velocity-pressure and stream function-vorticity formulation, Solution of incompressible and compressible fluid film lubrication problems. [5 hrs]",
    "course outcomes": "Upon successful completion of this course the student will be able to:\n- Understand the concepts behind variation methods and weighted residual methods in FEM.\n- Identify the application and characteristics of FEA elements such as bars, beams, plane and isoparametric elements, and 3-D element.\n- Develop element characteristic equation procedure and generation of global stiffness equation will be applied.\n- Able to apply Suitable boundary conditions to a global structural equation, and reduce it to a solvable form.\n- Able to identify how the finite element method expands beyond the structural domain, for problems involving dynamics, heat transfer, and fluid flow.",
    "reference books": "- The Finite Element Method by Zienkiewicz, Tata McGraw Hill\n- The Finite Element Method for Engineers by Huebner, John Wiley\n- An Introduction to the Finite Element Method by J.N.Reddy, McGraw Hill"
  },
  {
    "course code": "PRPE -26",
    "course title": "Project",
    "number of credits": "3",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie"
  },
  {
    "course code": "PRPE-27",
    "course title": "Computer Aided Manufacturing",
    "number of credits": "3",
    "prerequisites": "Production Technology II (PRPC18),\nProduction Planning and Control (PRPC23)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "The student is expected to take up a project under the guidance of teacher from the Institute. The project must be based on the Production and Industrial Engineering problems. The student may be asked to work individually or in-group with not more than four students. Viva-voce is based on the preliminary report submitted by student(s) related to project.\n- To understand the basic concepts of Computer –Aided Manufacturing and its scope\n- To understand the basic concepts of Group Technology and Cellular Manufacturing, clustering algorithm as well as methods to carry out arrangement of machines with in a cell\n- To understand Computer aided process planning and its types and associated aspects.\n- To understand Flexible manufacturing systems and related aspects\n- To understand CNC manual part programming and prepare part programs",
    "course content": "## Unit-I\n\nIntroduction to Manufacturing\nBasic definitions, design activities for manufacturing systems, Planning and control activates for manufacturing system, Manufacturing control, Types of production –low, Medium and high quantity production. [6 hrs]\nGroup Technology and Cellular Manufacturing\nPart families, parts classifications and coding, Production flow Analysis, cellular Manufacturing- composite part concept, machine cell design, applications of group technology, Grouping parts and machines by Rank order clustering technique, Arranging machines in a G.T. cell. [10 hrs]\n\n\n## Unit- II\n\nProcess Planning\nIntroduction, Manual process planning, Computer aided process planning – variount, generative, Decision logic- decision tables, decision trees, Introduction to Artificial intelligence. [6 hrs]\n\n\n## Unit-III\n\nFlexible Manufacturing\nIntroduction, FMS components, Flexibility in Manufacturing – machine, Product, Routing, Operation, types of FMS, FMS layouts, FMS planning and control issues, deadlock in FMS, FMS benefits and applications. [8 hrs]\n\n\n## Unit- IV\n\nCNC Basics and Part Programming\nIntroduction, Principle of CNC, Classification of CNC/NC – point to point and continuous path, positioning system- fixed zero and floating zero, Dimensioning- absolute and incremental, Coordinate system, Basic requirements of CNC machine control, CNC/NC words, Manual part programming, (G&M codes only) canned cycles, tool length and radius compensation. [10 hrs]",
    "course outcomes": "At the end of the course, the students will be able to:\n- Understand Scope of Computer aided manufacturing\n- Apply knowledge of Group Technology and Cellular Manufacturing for formation of cells as well as arrangement of machines within a cell\n- Understand CAPP and its general architecture as well as types and related concepts\n- Understand FMS, manufacturing flexibility, production planning and control in FMS and related issues such as deadlock\n- Prepare manual part programs of simple components",
    "reference books": "/ Journals:\n- Automation, Productions systems and Computer-Integrated Manufacturing by M.P. Groover, Prentice – Hall\n- Computer Aided Manufacturing by Chang, Wang & WysK\n- Computer Numerical Control by Peter Smid\n- International Journal of Production Research\n- International Journal of Flexible Manufacturing system"
  },
  {
    "course code": "PRPE-28",
    "course title": "Modeling And Simulation",
    "number of credits": "3",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- Define the basics of simulation modeling and replicating the practical situations in organizations\n- Generate random numbers and random variates using different techniques.\n- Develop simulation model and explain Verification and Validation of simulation model.\n- Analysis of Simulation models using input analyzer, and output analyzer",
    "course content": "## Unit – I\n\nIntroduction to Simulation: Simulation, Advantages, Disadvantages, Areas of application, System environment, components of a system, Model of a system, types of models, steps in a simulation study. Simulation Examples: Simulation of Queuing systems, Simulation of Inventory System, Other simulation examples [7 hrs]\n\n\n## Unit- II\n\nGeneral Principles: Concepts in discrete - event simulation, event scheduling/ Time advance algorithm, simulation using event scheduling.\nRandom Numbers: Properties, Generations methods, Tests for Random number- Frequency test, Runs test, Autocorrelation test. [ 06 hrs]\n\n\n## Unit-III\n\nAnalysis of Simulation Data Input Modelling: Data collection, Identification and distribution with data, parameter estimation, Goodness of fit tests, Selection of input models without data, Multivariate and time series analysis. Verification and Validation of Model – Model Building, Verification, Calibration and Validation of Models [7 hrs]\n\n\n## Unit-IV\n\nOutput Analysis – Types of Simulations with Respect to Output Analysis, Stochastic Nature of output data, Measures of Performance and their estimation, Output analysis of terminating simulation, Output analysis of steady state simulations.\nSimulation Softwares: Selection of Simulation Software, Simulation packages, Trend in Simulation Software. [6 hrs]\nList of Experiments:\n- Features of simulation Package and Input Modeling\n- Simulation of Manufacturing System I\n- Simulation of Manufacturing System II\n- Simulation of Service Operations I\n- Simulation of Service Operations II\n- Simulation of JIT Kanban Multi Product Assembly line System\n- Modelling Live Problems of manufacturing industries and service organizations",
    "course outcomes": "At the end of the course, the students will be able to\n- Describe the role of important elements of discrete event simulation and modeling paradigm.\n- Conceptualize real world situations related to systems development decisions, originating from source requirements and goals.\n- Develop skills to apply simulation software to construct and execute goal-driven system models.\n- Interpret the model and apply the results to resolve critical issues in a real world environment.\nRecommended Books:\n- Banks, J., Nelson, B.L., Carson, J. S., and Nicol, D., “Discrete Event System Simulation”, Pearson Education, 2000.\n- Law, A.M., and Kelton, W.D., “Simulation Modeling and Analysis”,McGraw-Hill,1999.\n- Schwarzenbach, J., and Gill, K.F., “System Modeling and Control”,Butterworth- Heinemann,1992.\n- Carrie, A., “Simulation of Manufacturing Systems”, John Wiley &Sons, 1988.\n- Viswanadham, N., and Narahari, Y., “Performance Modeling of Automated Manufacturing System”, Prentice-Hall of India, 1992.\n- B.P. Zeigler, Taqgon Kim and Herbert Praehofer, “Theory of Modeling & Simulation”, Academic Press.\n- Jerry Banks, “Handbook of Simulation: Principles, Methodology, Advances, Applications & Practice”.\n- Khoshnevis, “Discrete Systems Simulation”.\n- Charles Harrell and KerimTumay, “Simulation Made Easy”, Engineering and Management Press.\n- W. David Kelton, Randall P. Sadowski, and Deborah A. Sadowski, “Simulation with Arena”, McGraw-Hill.\n- “ProModel Software - Student Version”, Published by the Day Grp."
  },
  {
    "course code": "PRPE-29",
    "course title": "Mechanical Vibrations",
    "number of credits": "3",
    "prerequisites": "Strength of Materials (PRPC20), Theory of Machines (PRPC14)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To learn effects of periodic disturbance due to external excitation; due to rotating and reciprocating unbalance; due to excitation of the support on performance of a Machine.\n- To learn method of vibration analysis of Mechanical Systems.\n- To learn Mathematical Modelling of Mechanical Systems for vibration analysis.\n- To learn methods of Vibration isolation of Mechanical systems under periodic inputs.",
    "course content": "## UNIT - I\n\nFundamental of Vibrations\nIntroduction, Definitions, Kinematics of simple vibrating motions, Simple harmonic motions, Vector Method and Complex Method representation of a harmonic motion, Fourier series representation of periodic Inputs, Mathematical Model for Vibration Anaysis. [4 hrs]\nFree Vibrations of a Single Degree of Freedom Systems\nDegrees of freedom, equations of motions, general solution of equation of motions, Undamped and Damped free vibrations of Mechanical Systems. [4 hrs]\n\n\n## UNIT - II\n\nForced Vibrations of a Single Degree of Freedom Systems\nUndamped and damped forced vibrations, Transient and Steady state response, Viscous damping, Coulomb damping, Forced vibration – due to external excitation; due to rotating and reciprocating unbalance; due to excitation of the support, Transmissibility and isolation and Vibration measuring Instruments. [10 hrs]\n\n\n## UNIT - III\n\nTwo Degrees of Freedom Systems\nUndamped free vibration, principal modes, Damped Free Vibrations, Forced Vibration with Harmonic excitation and Vibration Absorber. [6 hrs]\nMulti-Degrees of Freedom Systems\nExact Analysis: Undamped Free Vibrations, Influence Numbers, Undamped Forced Vibration, Generalized Coordinates, Coordinate Coupling, Principal Coordinate. [4 hrs]\n\n\n## UNIT - IV\n\nMulti-Degrees of Freedom Systems\nNumerical Methods: Dunkerley’s Method, Method of Matrix iteration, Holzer’s method, Rayleigh’s method, Rayleigh–Ritz method. [6 hrs]\nContinuous Systems\nTransverse vibration of strings, longitudinal vibration of bars, lateral vibration of beams, torsional vibration of circular shafts. [4 hrs]\nCritical speeds of shafts\nCritical speed of Undamped and Damped light shaft having Single Disk. [2 hrs] Course Outcomes:\nAt the end of the course, student will be able to\n- Make mathematical model of a Mechanical system for vibration analysis.\n- Write differential equations of motion of the Mathematical model of the Mechanical system for vibration analysis.\n- Solve governing equation of motions of the Mechanical systems using Numerical Methods as well as exact analysis.\n- Predict response of the Mechanical Systems under periodic inputs.\n- Deal with mechanical systems involving vibration isolation and rotating and reciprocating unbalance.",
    "reference books": "- Mechanical vibration by G.K. Grover, Nemchand & Brothers\n- Mechanical vibration by S. S. Rao, Pearson Education\n- Mechanical Vibration by Thomson, Prentice Hall\n- Mechanical Vibration by Den Hartog, McGraw-Hill\n- Introductory course on Mechanical Vibrations by Rao and Gupta, Wiley Eastern"
  },
  {
    "course code": "PRPE-30",
    "course title": "Automobile Engineering",
    "number of credits": "3.0",
    "prerequisites": "Thermal Engineering (PRPC17)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand the various aspects of automobiles.\n- To gather knowledge about different components of an automobile\n- To study in details how an automobile works.\n- To know various developments regarding making efficient and safe automobiles.",
    "course content": "## UNIT – I\n\nIntroduction to Automobile Engineering\nBrief history of automobiles, Main components of an automobile, Brief description of each component.\nInternal combustion engine, Four stroke engine-their use in automobiles Brief description of constructional details and working of a four stroke I.C. Engine (S.I. Engines and C.I. Engines) including overhead cam shaft, Multi-cylinder engines, Direct injection systems, Multi-point fuel injection systems, Microprocessor based fuel supply systems, Multi valve engines, Mechanical balancing, Firing Order, Power balancing, Power overlap, Power flow charts.\n\n\n## UNIT – II\n\nTransmission System of Automobile\nBrief description of different components of Transmission System.\n- Clutch: Introduction to Clutch and its different types, Principle of Friction Clutch, Clutch Lining and friction materials used in Friction Clutches, Torque transmitted, Brief description of Cone Clutch, Single Plate and Multiplate Clutches, Dry and wet clutches, Automatic clutch action, Centrifugal clutches, Electromagnetic clutches, Fluid Flywheel.\n- Gear Box: Air resistance, gradient resistance and rolling resistance coming across a moving automobile, Tractive effort, Variation of tractive effort with speed, Performance curves (object and need of a gear box), Sliding mesh gear box, Control mechanism, Sliding type selector mechanism, Ball type selector mechanism, Constant mesh gear box, Synchromesh device, Clutch less Transmission, Dual-clutch Automatic transmission system , Automatic\ntransmission in general, AP automatic gear box, Torque converter, Torque converter with direct drive, Lubrication of Gear Box.\n- Propeller Shaft: Functions and requirements of a propeller shaft, Universal joints, Constructional forms of universal joints, Flexible-ring joints, Rubber-bushed flexible joints. Constant-velocity joints.\n- Differential: Principle of operation, Constructional details of a typical differential unit, Traction control differentials, Multi-plate clutch type traction control device,\n- The back axle: Live back axles, The final drive, Single reduction live axles, Torque reaction, Driving thrust, Torque and thrust member arrangements, Springs serving as torque and thrust members, Hotchkiss Drive with torque reaction member, Single combined torque-thrust reaction member, with springs taking only vertical and lateral loads, Transverse radius rods, Three radius rods, Axle construction, The double reduction axles (both steps at the center of the axle and one step at center of axle, the other at road wheels).\n\n\n## UNIT - III\n\nRunning System\n- Wheels and rims, Tyre-its function and constructional details.\n- Brakes: Functions and methods of operation, Brake efficiency, Elementary theory of shoe brake, Brake shoe adjustments, A modern rear-wheel brake, Disc brakes, Brake linkages, Leverage and adjustment of the brake linkage, Servo- and power-operated brakes, Vacuum brake operation, Hydraulic Brakes-constructional details and working, Bendix Hydrovac, Direct- acting vacuum servos, Power-operated brakes, A dual power air brake system, Compressed air systems, Actuating cylinders for air brakes.\nSuspension System\nSuspension principles, Road irregularities and human susceptibility, Suspension system, Damping, Double tube damper, Single tube damper, Lever arm type damper, Springs-Leaf springs, Coil and torsion springs, variable rate springs, Composite leaf springs, Rubber springs, Air springs, Adjustable and self-adjusting suspensions, Interconnected suspension system, Interconnected air and liquid suspensions, Independent suspension system, Different independent suspension layouts, McPherson strut type, Rear suspension-live axle, Torque reaction and axle guidance, Watt’s linkage, Rear suspension-dead axles, Rear suspension- independent, McPherson strut rear suspension.\n\n\n## UNIT - IV\n\nSteering Mechanism\nSteering geometry, Castor, Camber, Kingpin inclination, Combined angle, Toe-in, Steering system-basic aims, Ackerman linkage, Steering linkages for independent suspension, Center point steering, Costarring or trailing action, Cornering power, Self-righting torque, Steering characteristics-over steer and under steer, Axle beam, Stub-axle construction, Steering column, Reversible and irreversible steering, Rack-and-pinion steering mechanism, Effect of toe-in on steering, Power steering, Vickers System.\nRecent trends in Automobile Engineering\nMulti-fuel automobiles, Automobiles running on alternate sources of energy, Emission control through catalytic converter, Double catalytic converter, Aspects of pollution control in Automobiles.",
    "reference books": "- The Motor Vehicle by Newton, Steeds and Garrette Basic\n- Automobile Engineering by Kirpal Singh\n- Auto mechanics by Crouse\n- Automobile Engineering By Jain & Asthana, TMH.",
    "course outcomes": "At the end of the course student will be aware of all the engineering details of an automobile, it’s working and what are the requirements of an efficient, reliable and safe automobile.\nPRPE31 THEORY OF METAL FORMING PROCESSES"
  },
  {
    "course code": "PRPE -32",
    "course title": "Entrepreneurship",
    "number of credits": "3",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "This course is designed to help students to\n- Evaluate the business skills and commitment necessary to successfully operate an entrepreneurial venture and review the challenges and rewards of entrepreneurship.\n- Students will learn about themselves, their decisions, and their goals to determine how entrepreneurship can play a role in their lives.\n- Students will also be introduced to entrepreneurship from an economic perspective and the concepts of environmentally sustainable practices and social entrepreneurship and ability to recognize a business opportunity that fits the individual student\n- Demonstrate the understanding of how to launch the individual's entrepreneurial career and to recognize the innate entrepreneurial potential within themselves;\n- Recognize the critical importance of values and ethics when engaged in entrepreneurial activities.",
    "course content": "## Unit-I\n\nEngineering Economics\nDefinition and concept, Importance of economics for engineers, present value and future value, Wealth, Goods, Wants, Value and price, capital, money, utility of consumer and producer goods.\n[4 hrs]\nCosting\nIntroduction, Elements of cost, Prime cost, Overhead, Factory cost, Total cost, Selling price, Nature of cost, Types of cost. [6 hrs]\nDepreciation\nDefinition and concept, Causes of depreciation, Methods of calculating depreciation. [4 Hrs]\nEconomic analysis of investment and selection of alternatives\nIntroduction, Nature of selection problem, Nature of replacement problem, Replacement of items which deteriorate, Replacement of machines whose operating cost in crease with time and the value of money also changes with time, methods used in selection of investment and replacement alternatives. [8 Hrs]\n\n\n## Unit-II Entrepreneurship\n\nEntrepreneurship, Characteristics of an entrepreneur, some myths and realities about entrepreneurship. [4 hrs]\nProduct Planning and Development\nIntroduction, Requirement of a good product design, Various controlling agencies involved -their role and formalities for getting clearance before starting individual venture. [4 hrs]\n\n\n## Unit-III\n\nFinancial Management\nFinancial concept for small-scale industries, financial requirements Financial support programmer of banks, government financial agencies, Hire-purchase facilities alternate sources of finance.\n[4 hr\nMarketing\nThe modern concept of marketing, Definitions, functions and principle of marketing,STPD , 4Ps, Marketing research, Advertising [2 hrs]\n\n\n## Unit-IV\n\nSmall scale Industries\nIntroduction, Role and scope of small scale industries, concept of small scale and ancillary industrial undertakings, How to start a small scale industry, Steps in launching own venture, procedure for registration of small scale industries, various developmental agencies-their functions and role in industrial and entrepreneurship development, Infrastructure facilities available for entrepreneurship development in India. MSMEs [4 hrs]\nPreparation of feasibility Project Report\nTools for evaluation of techno economic feasibility project report, SWOT analysis. [2 hrs] Course outcomes:\nAbility to recognize a business opportunity that fits the individual student:\n- Demonstrate the ability to provide a self-analysis in the context of an entrepreneurial career\n- Demonstrate the ability to find an attractive market that can be reached economically and create appropriate a business model\n- Apply effective written and oral communication skills to business situations.\n- Analyze the global business environment and analyze the local business environment and use critical thinking skills in business situations.\n- Apply an ethical understanding and perspective to business situations.",
    "reference books": "- The practice of Entrepreneurship - By G. G. Meredikh, R.E. Nelson and P.A. Neck\n- Handbook of Entrepreneurship - Rao and Pareek\n- Entrepreneurship, 4e - Barringer,Pearson Publication\n- Entrepreneurship Development and Small Bussiness Enterprises,- Charanthimath, Pearson Publication\n- Engineering Economics- Tarachand\n- Industrial Engineering and Management- Ravi Shankar\n- Industrial Engineering and Organization Management by S.K.Sharma and Sawita Sharma\n- Industrial Engineering and Management- O.P. Khanna\nB.Tech (Production & Industrial Engineering) 8th Semester\nB.Tech (Production & Industrial Engineering) 8th Semester Programme Elective (PE)"
  },
  {
    "course code": "PRPC-29",
    "course title": "Quality Control and Reliability",
    "number of credits": "4",
    "prerequisites": "Production Technolgy- II (PRPC18), Production Planning and Control (PRPC23)",
    "course type": "PC",
    "branch": "pie",
    "course learning objectives": "- To understand the fundamentals of Quality, Economics of Quality and T.Q.M.\n- To understand the basic statistical concepts, decision preparatory of the control charts,their applications and Process Capability Behaviour.\n- To understand the concepts of Acceptance Sampling, Sampling Plans and their applications.\n- To understand the Reliability and its relationship with Availability and Maintainability.",
    "course content": "## UNIT- I\n\nIntroduction\nQuality – Basic Concepts: Issues in Quality, factors affecting quality, creating quality by design, product development cycle, economics of quality, Various definitions, ISO definition of quality and its meanings, and various phases till TQM and its meaning to industries, customers and employees, contribution of quality gurus etc. towards quality concepts. Total Quality management: its scope application and implementation. Quality circle: its objectives, structure and techniques, Variability concept in manufacturing –cycle, fishbone diagrams, charts in time philosophy. [8 hrs]\n\n\n## UNIT -II\n\nQuality Control\nBasic statistical concepts, various types of distributions, General theory X and R chart. Decision preparatory to the control charts. Trial control limits. Selection of sub-groups. Charts with variable subgroups. Reject and Revoke, limits for average on X charts, modified control limits, specification limits, practical limitations. Control charts for fraction defectives, calculation and plotting of control limits, sensitivity of p chart, applications, and Control charts for Defects, difference between defect and defective, calculation and plotting of control limits, application. Pi charts and u charts, plotting of charts. Tests for various control charts. Tests for various control charts, process capability- inherent and potential capability. [12 hrs]\n\n\n## UNIT- III\n\nAcceptance Sampling\nPurpose, Acceptance by Attributes, single sampling plans. O.C. curve selection of sampling plans, Acceptance number, Type A and Type B errors, O.C. curves, Double sampling plan and its analysis, Multiple and sequential sampling , A.O.Q.L., Acceptance sampling plans under risk. Design of various sampling plans, Dodge- Roming type system for acceptance sampling by\nattributes (use of various tables). Determination of process average, Acceptance sampling by variables. [10 hrs]\n\n\n## UNIT- IV\n\nReliability\nConcepts of Reliability, factors affecting Reliability, pattern of Failure, Mean Time to Failure, Fundamental of Statistical Concepts, consideration of Reliability in Series and Parallel System, effect of Redundancy and Reliability, method of Reliability Evaluation, Reliability Optimization, Availability and Maintainability, means to improve Reliability, Reliability Control during manufacture. [10 hrs]\nCourse Learning Outcomes:\n- Students will be able to understand the fundamentals of Quality, Economics of Quality and T.Q.M.\n- Students will be able to understand the basic statistical concepts, decision preparatory of the control charts their applications and Process Capability Behaviour.\n- Students will be able to understand the concepts of Acceptance Sampling, Sampling Plans and their applications\n- Students will be able to understand the Reliability and its relationship with Availability and Maintainability",
    "reference books": "- Statistical Quality Control by Grant and Leaven, Mc Graw-Hill.\n- Quality Control and Reliability by Mahajan, Dhanpat Rai.\n- Quality Control by Hansen, Prentice-Hall.\n- Statistical Quality Control, a modern introduction by Douglas C. Montgomery.\n- Elementary Statistical Quality Control, 2nd Edition - CRC Press Book By. John T. Burr.\n- Total Quality Management – An Integrated Approach Paperback – 2016 by DR. Kiran\n- Handbook of Reliability Engineering and Management Book by Clyde F. Coombs Jr. and William Grant Ireson.\n- Practical Reliability Engineering Book by Patrick D. T. O'Connor.\n- Maintenance, Replacement, and Reliability: Theory and Applications, Second Edition.Book by\nA. K. S. Jardine and Albert H. C. Tsang.\n- Reliability Engineering Book by A.K. Goel."
  },
  {
    "course code": "PRPE-33",
    "course title": "Advanced Welding Technology",
    "number of credits": "3.0",
    "prerequisites": "Production Technology- II (PRPC18)",
    "course type": "PE",
    "branch": "pie",
    "course content": "Course Objective:\nThe objective of this course is teach the undergraduates about the fundamentals and advanced technology in the field of welding engineering.\n\n\n## Unit-I\n\nIntroduction to welding, classification of welding processes, volt-ampere characteristics, duty Cycle, AC/DC power sources, metal transfer in welding, residual stresses; measurement and control, welding metallurgy, weldability of some commercial alloys, welding defects and prevention. [9 hrs]\n\n\n## Unit -II\n\nHigh-energy density welding processes; concept and mechanism of keyhole welding, plasma welding, control of plasma welding, pulsed plasma welding, applications, laser welding; types of lasers, beam characteristics, plasma formation and control in laser welding, applications, electron beam welding; fundamentals, developments, applications. [9 hrs]\n\n\n## Unit -III\n\nSolid state welding processes; friction stir welding (FSW), process parameters, FSW of aluminium alloys, ultrasonic welding, explosive welding, diffusion bonding, Non-conventional welding; underwater welding, microwave hybrid joining, adhesive weld bonding, magnetic impelled arc butt welding(MIAB), [9 hrs]\n\n\n## Unit-IV\n\nAdvanced tungsten inert gas welding; high frequency pulsed GTAW, cold and hot wire feeds, multi-cathode GTAW, Pulse & Synergic-MIG, cold-metal transfer (CMT) welding, narrow-groove welding techniques; joint preparation, narrow gap GTAW torch, twist arc GMAW technique.\n[9 hrs]\nCourse outcome:\n- The students will have the understanding of conventional welding processes and fundamentals.\n- The students will have the in-depth knowledge of high-energy density welding processes and their applications\n- The students will have the understanding of advanced solid state welding processes as well as non-conventional welding techniques.\n- The students will gain the knowledge about latest developments in the GTAW and GMAW process.",
    "reference books": "- Hoffman. D.J., Welding, 2nd Ed., Pearson.\n- Little, R.L., Welding and Welding Technology, McGraw-Hill.\n- Norrish, J., Advanced Welding Processes, Woodhead Publishing.\n- Misra, R., Friction Stir Welding and Processing: Science and Engineering, Springer.\n- AWS Welding Handbooks, 9th Edition, Vol. 1 & 3, AWS Publications.\n- Kou, S., Welding Metallurgy, Wiley-Interscience.\n- Parmar, R.S., Welding Engineering and Technology, Khanna Publishers."
  },
  {
    "course code": "PRPE-34",
    "course title": "Power Plant Engineering",
    "number of credits": "3.0",
    "prerequisites": "Thermal Engineering (PRPC17)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand the basic Fundamental Power plant cycles and Diesel power plant.\n- To understand operations of gas power plant and its principle.\n- To make understand on advanced supercritical boilers technology.\n- General understanding of challenges in nuclear power plant.",
    "course content": "## UNIT-I\n\nIntroduction\nClassification of Power Plants, Future Planning for Power Generation, Review of Thermodynamics Cycles Related to Power Plants, Fuels and Combustion, Atomic Energy, Highlights of the Nuclear Power Programme. [5 hrs]\nDiesel Power Plants\nIntroduction; Field of use; Outline of diesel electric power plant; Different systems of diesel power plant; Supercharging of diesel engines; Performance of diesel power plant; Advantages and disadvantages of diesel plants over thermal power plants. [5 hrs]\n\n\n## UNIT-II\n\nGas Power Plant\nClassification of Gas Turbine Power Plant, Elements of Gas Turbine Power Plants, Gas Turbine Cycles, Gas Turbine Cycles- Performance Evaluation, Gas Turbine Cycles- Modifications, Problem Solving, Centrifugal Compressors, Regeneration and Reheating, Cogeneration, Auxiliary Systems, Control of Gas Turbines, Gas Turbine Efficiency, Combined Cycle Power Plants, Applications of Gas Turbine, Advantages of Gas Turbine Power Plant, Disadvantages. [10 hrs]\n\n\n## UNIT-III\n\nSteam Power Plant\nLayout and component of modern power plant, Rankine Cycle, Supercritical Boiler & ultra- supercritical plants, Design types, Water & Steam Flow, circulating fluidized bed boiler, boiler key features, arrangements, Furnace wall design, spiral & vertical tubes, Steam turbine features, Challenges, fuel, water, emissions, flexibility, Water Walls, Pulverized Coal, Steam Generators,\nFire Tube Boilers, Water Tube Boilers, Boiler Mountings and Accessories, High Pressure Boilers\n[10 hrs]\n\n\n## UNIT-IV\n\nNuclear Power Plant\nNuclear Power Generation, Nuclear Fusion Reactors, Basic theory and terminology; Nuclear fission and fusion processes; Fission chain reaction; Moderation; Fertile materials; Nuclear fuels;\nGeneral components of nuclear reactor; Different types of reactors; Breeder reactors; Nuclear power plants in India; Disposal of nuclear waste and Challenges [6hrs]",
    "course outcomes": "By the end of this education program, the students will be able to:\n- Understand the over view of power plant.\n- Understanding the components of gas turbine power plant and its requirement.\n- Analysis of super and ultra-critical power plant for need of power generation.\n- Understand the nuclear technology and its future need.",
    "reference books": "/ Videos:\n- Energy Resources & Technology (Video) Prof. S. Banerjee IIT Kharagpur NPTEL Video course (https://nptel.ac.in/syllabus/108105058/)\n- Steam and Gas Power Systems (Video) Prof. Ravi Kumar ( https://nptel.ac.in/syllabus\n/112107216/ )\n- Power Plant Engineering by Morse\n- Power Plant Engineering by Domkundwar\n- Power Plant Engineering by P.C. Sharma\n- Power Plant Technology by El-Wakil"
  },
  {
    "course code": "PRPE-35",
    "course title": "Maintenance Engineering",
    "number of credits": "3.0",
    "prerequisites": "Production Planning and Control (PRPC23)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand the basic fundamentals of Maintenance Engineering.\n- To understand the basic concepts of Maintenance Systems.\n- To impart the knowledge of Maintenance Planning, Maintenance schedule and programme.\n- To impart the knowledge of Reliability, Maintenance & Availability concepts and apply them to know about the practical aspects of the Industrial Systems.\n- To understand the basic concepts of Repair Discard Decisions.",
    "course content": "## UNIT-I\n\nIntroduction\nImportance of maintenance engineering, definitions and concepts used in maintenance, objectives and benefits of maintenance. [6 hrs]\n\n\n## UNIT-II\n\nMaintenance Systems\nVarious types of industrial maintenance systems maintenance systems, their merits, demerits and applications etc. [8 hrs]\n\n\n## UNIT-III\n\nMaintenance Planning\nPlanned Maintenance procedure, maintenance schedule and maintenance programme, benefits of planned maintenance. [10 hrs]\n\n\n## UNIT-IV\n\nReliability, Maintainability & Availability\nBasic concepts and definitions, availability models, economics of reliability, availability and maintainability, distribution of down time and its basic elements. [10 hrs]\n\n\n## UNIT-V\n\nRepair Discard Decisions\nIntroduction, factors affecting repair -discard decisions, cost-analysis and optimum module size.\n[6 hrs]",
    "course outcomes": "Upon completion of this course, student would be able to\n- Understand the basic concepts of Maintenance Engineering\n- Understand the fundamentals of various Industrial Maintenance Systems\n- Understand the significance of Maintenance Planning and Control\n- Understand, analyse and apply knowledge of Reliability, Availability and Maintainability.\n- Understand the relevance of Repair-Discard Decisions",
    "reference books": "- Principles of Planned Maintenance by R.H Clifton, McGraw Hill.\n- Maintenance Planning and Control by Anthony Kelly, P.H.E.\n- Handbook of Maintenance Management by Heintzelman, P.H.E.\n- Reliability, Availability and Maintainability by Faster Phillips & Rayers, M/A Press."
  },
  {
    "course code": "PRPE -36",
    "course title": "Total Quality Management",
    "number of credits": "3",
    "prerequisites": "Production Technology- II\n(PRPC18)",
    "course type": "PE",
    "branch": "pie",
    "course objectives": "To understand concept of quality management and apply this knowledge to understand the working of corporate word.",
    "course content": "## UNIT-I\n\nConcept of Quality\nProducts and services, quality of products and services, definition of quality, dimensions of quality and their measure. [4 hrs]\n\n\n## UNIT-II\n\nQuality Management Practices\nVarious approaches to control and management of quality,: inspection oriented, statistical process control oriented, assurance oriented and TQM oriented approaches. [8 hrs]\n\n\n## UNIT-III\n\nCost of Quality\nProductivity and quality relationship, concept of cost of quality, cost of conformance, prevention, appraisal and failure cost, internal and external failures, quality cost estimation in engineering and service industries [4 hrs]\n\n\n## UNIT-IV\n\nOrganizing for Quality\nCompany wide organization for quality management, prevention, control and improvement, continuous improvement process. [4 hrs]\n\n\n## UNIT-V\n\nHuman Aspects in Management of Quality\nCommitment, motivation, and involvement for quality, top management, management and worker participation, zero defects, quality circle, small group activity. [4 hrs]\n\n\n## UNIT-VI\n\nQuality Systems\nIntroduction, ISO 9000 Series of standards, Other quality systems, ISO 14000 series standards, concepts of ISO 14001, requirements of ISO 14001, EMS benefits. [6 hrs]\n\n\n## UNIT-VII\n\nSome Case Studies TQM\nMinimum four Case Studies to be explained. [4 hrs]",
    "course outcomes": "- Upon completion of this course, the students will be able to\n- Develop an understanding of quality management philosophies and framework.\n- Discuss the need of customer expectations, employee involvement and supplier partnership.\n- Analyze the TQM tools and techniques to improve the product and process quality.\n- Apply modern tools to improve quality of the product.\n- Describe ISO 9001, Environmental Management Standards and ISO 14001 Certification process.",
    "reference books": "- Besterfield, D.H, Michna, C.B, Besterfield, G. H and Sacre, M.B, “Total Quality Management” Pearson Education Asia.\n- Mukherjee, P. N., “Total Quality Management” Prentice Hall of India.\n- Rajaram, S., “Total Quality Management” Biztantra.\n- Ramasamy, S. “Total Quality Management” Mc Graw Hill Education."
  },
  {
    "course code": "PRPE-37",
    "course title": "Experimental Design",
    "number of credits": "03",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To introduce the basic concepts of experimental design such as randomization, replication, blocking, hypothesis testing, regression, ANOVA etc.\n- To expose students to different types of experimental designs like Latin Square Design, randomized block design nested designs etc.\n- To understand the full factorial designs, fractional factorial designs\n- To understand Taguchi’s DOE Approach and Response Surface Methodology",
    "course content": "## UNIT-I\n\nIntroduction:\nObjectives for experimental designs, Basic design concepts, Steps for the design of experiments, Types of experimental designs, Analysis of Means, Experimental designs and six sigma (4 hrs)\nCompletely Randomized Design:\nModel for a completely randomized design with a single factor, ANOVA for a completely randomized design, Randomized Block Design, Incomplete Block Designs, Latin Square Design, Graeco-Latin Square Design (4 hrs)\n\n\n## UNIT-II\n\nFull Factorial Designs with two Levels:\nNature of Factorial Designs, Deleterious Effects of Interactions, Effect Estimates, The 23 Design, Built –In- Replication, Role of expected mean squares in experimental design\n(5 hrs)\nFractional Factorial Designs with two Levels:\n2k-1 Designs, Effect Estimates and Regression Coefficients, 2k-2 Designs, Design Efficiency, John’s ¾ Designs (5 hrs)\n\n\n## UNIT-III\n\nRobust Designs:\nDOE and Taguchi Approach, Experimental Design using orthogonal arrays; Experimental Designs With Two-Level Factors Only; Experimental Designs With Three and Four Level Factors; ANOVA; Analysis using Signal- to Noise Ratios; Some case studies; QT4 Software\n(5 hrs)\nResponse Surface Methodology:\nResponse Surface Methodology; Response surface experimentation; Process improvement with Steepest Ascent; Analysis of Second-order response Surfaces; Central Composite Design; Box- Behnken Design; Analyzing the fitted surface; Design-Expert Software (5 hrs)\n\n\n## UNIT-IV\n\nRegression:\nSimple Linear Model, Least Squares line, Lack of fit test, Curvilinear Regression, Orthogonal polynomials. (5hrs)",
    "course outcomes": "- Students will be able to become conversant with different types of experimental designs\n- Students will be able to select a suitable design for undertaking experimental investigation in any field of engineering\n- Students will become capable to apply effectively Taguchi’s parameter design approach for solving all kinds of Industrial problems\n- Students will learn to use Response Surface Methodology for modelling and optimizing responses",
    "reference books": "- Modern Experimental Design by Thomas P Ryan. John Wiley\n- Response Surface Methodology by Myers R H and Montgomery D.C. John Wiley\n- Design of Experiments using the Taguchi Approach by Ranjit K Roy. John Wiley\n- Design and Analysis of Experiments by Montgomery D.C. Wiley India\n- Taguchi Methods: A Hands-On Approach by Glen Stuart Peace Addison-Wesley"
  },
  {
    "course code": "PRPE-39",
    "course title": "Materials Management",
    "number of credits": "3.0",
    "prerequisites": "Production Planning and Control (PRPC23)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand the concepts of materials management.\n- To understand the basic fundamentals of purchasing function.\n- To understand the basic concepts of inventory management and economic order quantity.\n- To understand the basic concepts of stores management and its applications.",
    "course content": "## Unit-I\n\nIntegrated approach to Materials Management:\nIntroduction, materials productivity and role of materials management techniques in improved materials productivity. Cost reduction and value improvement, value analysis for right choice and rationalization of materials. [8 hrs]\n\n\n## Unit-II\n\nPurchasing Function:\nObjectives, purchase requisitions/Demand, types of specification, centralized versus decentralized purchasing, timing of purchases. Mode of Tender, Tender Enquiry, Tender Opening, Techno Commercial Evaluation, Tender Purchase Committee / Negotiation Committee Purchase Order / Contract, Post Contract Management, vender selection and vender rating. Purchase price analysis and price determination. Purchasing organizations, procedures, forms, records and reports. Purchasing as a dynamic profession like e-procurement and e-publishing. Overview of Government e-Marketing (GeM). [12 hrs]\n\n\n## Unit-III\n\nInventory Management:\nInventory concepts, reasons for holding inventory, types of inventory, inventory reduction tactics. Inventory turnover ratio. Selective Inventory management: ABC, VED, and FSN analysis etc., identifying critical items with selective inventory management, assumptions for Wilson’s lot size model, inventory costs, hidden costs, composition of costs, estimation of inventory related costs, lead time, stock out point, number of time periods, calculating Economic Order Quantity (EOQ), sensitivity analysis of EOQ model. [12 hrs]\n\n\n## Unit-IV\n\nStores management\nIntroduction, stores functions, stores organization, stores systems and procedures, Receipt & Inspection Note (RIN), Certified Receipt Voucher (CRV), stores accounting and verification systems, stores address systems, stores location and layout, store equipment. [8 hrs]",
    "course outcomes": "Students will be able to\n- Develop the concepts of materials management.\n- Develop the basic fundamentals of purchasing function.\n- Develop the basic concepts of inventory management and economic order quantity.\n- Develop the basic concepts of stores management and its applications.",
    "reference books": "- Arnold and Chapman “Introduction to Materials Management”, Pearson Education Asia, Fourth Edition, (2001)\n- Narsimhan, Mcleavey & Billington, “Production Planning & Inventory Control”, Prentice Hall of India, Second Edition (2003)\n- Dobler Donald W., Burt David N., “Purchasing and Supply Management”, Tata McGraw Hill, Sixth Edition (2001)\n- Menon K S, “Purchasing and Inventory Control”, Wheeler Publishing New Delhi, Third Edition (1997)\n- Krajewski L J and Ritzman L P, “Operations Management”, Pearson Education Asia, Sixth Edition (2004)"
  },
  {
    "course code": "PRPE-40",
    "course title": "Marketing and Financial Management",
    "number of credits": "3",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- Understand the place and contribution of marketing to the business enterprise.\n- The objective of this course is to train students to apply concepts and techniques in marketing so that they become acquainted with the duties of a marketing manager.\n- More specifically, they will be exposed to the development, evaluation, and implementation of marketing management in a variety of business environments",
    "course content": "## Unit-I Introduction\n\nNeed, Want, Demand, Production, Product, Selling, Marketing and societal concepts of marketing, Types of goods. [4 hrs]\n\n\n## Unit-II\n\nMarketing Process\nAnalyzing marketing opportunities, Researching and selecting target markets, Positioning the offer, Designing and marketing strategies, Planning marketing program, Organizing, Implementing & controlling marketing efforts. [4 hrs]\n\n\n## Unit-III\n\nConsumer Behavior & Market Research\nFactors affecting consumer behavior, stages in purchasing, Market research, Market segmentation and target market selection. [4 hrs]\n\n\n## Unit-IV\n\nOrganizational Buying\nSalient features, Factors affecting organizational purchase marketing mix, Product, Product levels, Product hierarchy, Product line, Types of distributions, Channel management decisions, Product mix, Product life cycle, Procedure for new product development, Branding and packaging. [6 hrs]\n\n\n## Unit-V Price\n\nPricing objectives, Price elasticity of demand, Methods of pricing, Discounts, Discriminatory pricing. [4 hrs]\n\n\n## Unit-VI Distribution\n\nNeed for middleman and their functions, Vertical marketing system. [4 hrs]\n.\n\n\n## Unit-VII Promotion Mix\n\nAdvertising, media selection, Frequency and timing of advertisement, steps in developing effective communication, Sales promotion, Personal selling, Publicity. [5 hrs]\n\n\n## Unit-VIII\n\nSales Force Management\nRecruitment, Training, Motivating sales representatives, Controlling and evaluating. [5 hrs]\n\n\n## Unit-X\n\nBasic Valuation Concepts:\nTime value of money, Methods of dealing with time value of money, Future value of a single cash flow, Future value of annuity, Present value of a single cash flow, Present value of annuity, Risk and return concept, Valuation of bonds, Securities and equities, Principles of accounting, Balance sheet, Income statement, Financial ratios. [5 hrs]",
    "course outcomes": "The student will be able to:\n- Define primary and secondary sources of information; give examples of methods used to collect primary data; give examples of sources for secondary data; compare and contrast the advantages and disadvantages of both types of data\n- Describe major bases for segmenting consumer and business markets; define and be able to apply the three steps of target marketing: market segmentation, target marketing, and market positioning; understand how different situations in the competitive environment will affect choices in target marketing\n- Describe the major types of consumer buying behavior, the stages in the buyer decision process and completely outline the components of the marketing mix; identify how the firms marketing strategy and marketing mix must evolve and adapt to match consumer behavior and perceptions of the product (e.g., classification of products and services, brand image, price and value), the stage in the product life cycle and the competitive environment; summarize the importance of measuring and managing return on marketing\n- Identify the roles of advertising, sales promotion, public relations, personal selling, and direct marketing in the promotion mix; compare and contrast integrated marketing communications with a non-integrated approach to the promotional mix\n- Illustrate how the international trade system, economic, political-legal, and cultural environments in a foreign country affect a company’s international marketing decisions",
    "reference books": "- WinerRusselS , “Marketing Management”, Prentice Hall of India, 1998.\n- Guilitinan Joseph P , Gordon W Paul and Thomas J Maddaen, “Marketing Management: Strategies and Programs”, McGraw Hill Publication, 1996.\n- Dolan Robert J, “Marketing Management: Text & Cases”, McGraw Hill Publication, 2000.\n- Lamb Charles W and McDaniel Carl D., “Marketing”, South Western College Publication, 2004."
  },
  {
    "course code": "PRPE-41",
    "course title": "Soft Computing",
    "number of credits": "3",
    "prerequisites": "NIL",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand basics of Artificial Neural Network , Genetic Algorithm, Particle Swarm optimization and fuzzy logic\n- To learn soft computing techniques so as to build computationally intelligent systems that possess human like abilities to reason, learn and handle the uncertainty and vagueness often inherent in real world problems.\n- To solve complex practical problems for which conventional mathematical and analytical methods are inefficient.\n- To implement the soft computing solutions using appropriate tools.",
    "course content": "## UNIT-1\n\nIntroduction to soft computing, Hard Computing versus Soft Computing, Introduction to artificial neural network, Biological Neural network, Comparison between Artificial and Biological Neural Network , Model of an Artificial Neuron, Characteristics of Neural Network , Basic building blocks of Artificial Neural Network: Network Architecture, Learning methods, Activation function [5 hrs]\n\n\n## UNIT-II\n\nMcCulloch Pitts Neuron Model, Simple perceptron model, Limitations of Perceptron Single layer feed forward network, Learning process in single layer feed forward network, Multi layer feed forward neural network, Back propagation learning, Stopping criteria, Problems with backpropagation [8 Hrs]\n\n\n## UNIT-III\n\nIntroduction to Genetic Algorithm, Advantages and Disadvantages, GA’s Basic Terms, Implementation of GA, Fitness function, genetic operators, Representation/Encoding Schemes, Selection of parents, cross over methods and rate, mutation operator and rate, Convergence of genetic algorithm, Optimizing numerical functions using GA, difference and similarities between GA and other traditional methods [9 hrs]\n\n\n## UNIT-IV\n\nBasic Particle Swarm Optimization, Global Best PSO, Local Best PSO, gbest versus lbest PSO, Velocity Components, Algorithm Aspects: ( particle initialization, stopping conditions and defining the terms iteration and function evaluation) Social Network Structures, Basic PSO Parameters, Basic variations: velocity clamping, Inertia weights [6 hrs]\n\n\n## UNIT-V\n\nFuzzy versus crisp, Crisp set Theory , operation on crisp sets, properties of crisp sets ,crisp relation, Fuzzy sets: Membership function, basic fuzzy set operations, properties of fuzzy sets\n,fuzzy relations, Crisp logic, Predicate Logic, Fuzzy logic, Fuzzy quantifiers, Fuzzy inference, Fuzzy rule based system, De-fuzzification methods [12 Hrs]",
    "course outcomes": "- Student will be able to understand concept of soft computing and fundamental theory and concepts of neural networks\n- Student will be able to apply neural networks to prediction and pattern classification problems\n- Student will be able to apply Genetic Algorithm to solve optimization problems\n- Student will be able to apply Particle swarm optimization to solve optimization problems\n- Students will be able to apply fuzzy logic to solve engineering problems having uncertainty",
    "reference books": "- Saroj Kauhik and Sunita Tiwari, Soft computing fundamentals, Techniques and Applications , McGraw Hill Education Private Limited\n- S. Rajasekaran & G. A. Vijayalakshmi Pai, Neural Networks, Fuzzy Logic and Genetic Algorithms: Synthesis & Applications, PHI, 2003.\n- David.E. Goldberg, Genetic Algorithms in Search, Optimization and machine learning, Addison Wesley, 1999.\n- S. N. Sivanandam & S. N. Deepa, Principles of Soft Computing, Wiley - India, 2007.\n- Saroj Kaushik, Artificial Intelligence, Cengage Learning, 2007.\n- M. Mitchell, An Introduction to Genetic Algorithms, Prentice-Hall, 1998.\n- S. N. Sivanandam , Sumuthi & S. N. Deepa, Introduction to Neural Networks using MATLAB\n- S. N. Sivanandam , Sumuthi & S. N. Deepa, Introduction to fuzzy logic using MATLAB\n- Timothy ,J.Ross Fuzzy Logic with Engineering Applications,Wiley,2016\nPRPE42 VEHICLE DYNAMICS"
  },
  {
    "course code": "PRPE-43",
    "course title": "Computer Integrated Manufacturing",
    "number of credits": "3",
    "prerequisites": "Computer Aided Manufacturing (PRPE27)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To Understand CIM and its scope\n- To Understand hardware and software requirements for CIM\n- To Understand product design in CIM and concurrent engineering\n- To understand group technology and cellular manufacturing\n- To Understand operations planning in CIM environment",
    "course content": "## Unit-I\n\nManufacturing Enterprise and Manufacturing Systems\nIntroduction, External Challenges, Internal Challenges, World-Class winning criteria, learning CIM concepts, Manufacturing classifications, product development cycle, Enterprise organization\n[4 hrs]\nMeaning and Scope of CIM\nDefinition of CIM, CIM Wheel, Evolution of CIM, Benefits of CIM [4 hrs]\n\n\n## Unit- II\n\nComputers in Manufacturing\nPresent status, Needs of CIM: Hardware, CIM software, CIM workstations [4 hrs]\nProduct Design\nNeeds of the market, design process, design for manufacturability, computer-aided design: areas of application, benefits of CAD, concurrent engineering [6 hrs]\n\n\n## Unit- III\n\nGroup Technology and Cellular Manufacturing\nPart families, parts classifications and coding, Production flow Analysis, cellular Manufacturing- composite part concept, machine cell design, applications of group technology, Grouping parts and machines by Rank order clustering technique, Arranging machines in a G.T. cell. [8 hrs]\n\n\n## Unit- IV\n\nProduction/Operations Planning\nOperations management, manufacturing planning and control: production planning, master production schedule, product data management MRP, MRP-II, introduction to production activity control, Just-in Time manufacturing, synchronized production, ERP and beyond [14 hrs]",
    "course outcomes": "At the end of the course, the students will be able to\n- Understand CIM and its scope\n- Understand hardware and software requirements for CIM\n- Understand product design in CIM and concurrent engineering\n- Apply knowledge of group technology and cellular manufacturing to form the cell and arrangement of machines in a cell\n- Understand operations planning in CIM environment\nRecommended Books/ Journals:\n- Automation, Productions systems and Computer-Integrated Manufacturing by M.P. Groover, Prentice – Hall.\n- Computer Aided Manufacturing by Chang, Wang and Wysk.\n- Computer- Integrated Manufacturing by Rehg, J. A. and Kraebber, H.W., Second edition, Pearson Education Asia.\n- Principles of Computer-Integrated Manufacturing by Vajpayee, S. K., Prentice-Hall of India Pvt. Ltd.\n- International Journal of Production Research\n- International Journal of Computer Integrated Manufacturing"
  },
  {
    "course code": "PRPE -44",
    "course title": "Product Design and Manufacturing",
    "number of credits": "3",
    "prerequisites": "Production Technology –II (PRPC18), Production Technology-III (PRPC22), Production Planning & Control (PRPC23), Machine Design (PRPC25),Work Study & Ergonomics (PRPC28)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "The focus of Product Design and Development is integration of the marketing, design, and manufacturing functions of the firm in creating a new product. The course is intended to provide the following benefits:\n- Competence with a set of tools and methods for product design and development.\n- Develop abilities to create a new product.\n- Awareness of the role of multiple functions in creating a new product (e.g. marketing, finance, industrial design, engineering, production).\n- Ability to coordinate multiple, interdisciplinary tasks in order to achieve a common objective.\n- Reinforcement of specific knowledge from other courses through practice and reflection in an action-oriented setting.\n- Enhanced team working skills.",
    "course content": "## Unit-I\n\nIntroduction: Design theory, design materials, human factors in design, man-machine system, applied ergonomics, characteristics of successful product development, challenges to product development. [6 hrs]\n\n\n## Unit-II\n\nDevelopment process and product planning: Generic development process, Concept development, product development process flows, product planning process, identify customer needs. [6 hrs]\n\n\n## Unit-III\n\nProduct specifications and concept generation: Product specification, steps to establish the target specifications, Concept generation, five step concept generation method, concept selection, concept screening, concept testing, product architecture. [10 hrs]\n\n\n## Unit-IV\n\nProduct design methods: Creative and rational, clarifying objectives - the objective tree method, establishing functions- the function analysis method, setting requirements – the performance specification method, determining characteristics – the QFD method, generating alternatives – morphological chart method, evaluating alternatives – the weighted objective method, improving details – the value engineering method and design strategies. [6 hrs]\n\n\n## Unit-V\n\nDesign for manufacture: Estimating manufacturing cost, reducing component, assembly and support costs, design for assembly, design for disassembly, design for environment, design for graphics and packaging, effective prototyping – principle and planning [4 hrs]\n\n\n## Unit-VI\n\nIndustrial design: Its need, impact and quality, industrial design process and its management, legal issues in product design, design resources, economics and management of product development projects. [4 hrs]\n\n\n## Unit-VII\n\nErgonomics / Aesthetics: Gross human autonomy. Man-Machine interaction. Concepts of size and texture, colour .Comfort criteria. Psychological & Physiological considerations. Creativity Techniques: Creative thinking, conceptualization, brain storming, primary design, drawing, simulation, detail design. [6 hrs]",
    "course outcomes": "At the end of the course student will be able to:\n- Describe an engineering design and development process\n- Demonstrate individual skill using selected manufacturing techniques\n- Employ engineering, scientific, and mathematical principles to execute a design from concept to finished product\n- Work collaboratively on a team to successfully complete a design project\n- Effectively communicate the results of projects and other assignments in a written and oral format",
    "reference books": "- K.T. Ulrich and S.D. Eppinger, “Product design and development”, Tata McGraw Hill\n- Chitale & Gupta, “Product Development”, Tata McGraw Hill\n- Monks, J. G., “Operations Management”, McGraw Hill, 1997.\n- George Dietor, A material and Processing approach, McGraw Hill"
  },
  {
    "course code": "PRPE-45",
    "course title": "Energy Management",
    "number of credits": "3",
    "prerequisites": "Thermal Engineering (PRPC17), Fluid Mechanics and Machines (PRPC13)",
    "course type": "PE",
    "branch": "pie",
    "course learning objectives": "- To understand the basics and importance of energy audit and apply them to address the practical applications.\n- To understand the basic concepts and applications of heating and cooling management.\n- To impart the knowledge to the students about various contemporary methods to utilize different sources of energy management.\n- To impart the knowledge to the students about energy conservation management.",
    "course content": "## Unit-1\n\nPlanning for Energy Management\nInitiation phase, Audit and analysis phase, Implementation phase, General methodology for building and site energy audit, Site survey, Methodology, Site survey-electrical system, Steam and water systems, Building survey methodology, Basic energy audit instrumentation, Measurement for building surveys. [8 hrs]\n\n\n## Unit-II\n\nManagement of Heating and Cooling\nGeneral principles, The requirements for human comfort, Description of typical systems-dual duct HVAC system. Multi zone HVAC systems, Variable and volume systems, Terminal repeat system, Evaporative systems, Package system, Basic principle governing HVAC system, Package system, Basic principle governing HVAC system operation, Energy management opportunities in HVAC systems. [8 hrs]\n\n\n## Unit-III\n\nElectrical Load and Lighting Management\nGeneral principles, illumination and human comfort, Basic principles of lighting system, Typical- illumination system and equipment, Fundamentals of single phase and 3 phase A.C. circuits, energy management opportunities for lighting systems, Motors and electrical heat, Electrical and analysis and their parameters, Peak, demand control. [10hrs]\n\n\n## Unit-IV\n\nManagement of Process Energy\nGeneral principles, Process heat, Combustion, Energy saving in condensate return, Steam generation and distribution, Automotive fuel control, Hot water and water pumping, Direct and indirect fired furnaces over, Process electricity, Other process energy forms-compressed air and manufacturing processes, Problems. [7 hrs]\nThe Economics of Efficient Energy Use\nGeneral consideration, Life cycle costing, Break-even analysis, Cost of money, Benefit/cost analysis, Pay back period analysis, Prospective rate of to return, Problems. [7 hrs]\nCourse Outcome:\n- The students will be able to understand importance of energy management.\n- The students will be able to utilize concepts and applications of heating and cooling management in engineering applications.\n- The students will be able to work on different contemporary methods to utilize sources of energy management.\n- The students will be able to understand and make energy audit report.\nReference Book:\n1. Energy Management Principles by Criag B. Smith, Published by Pergamon Press."
  }
]
